[
  {
    "title": "2025-04-14 15-18_Pfizer's $130B Weight-Loss Dream Just Collapsed",
    "date": "",
    "content": "Title: Pfizer's $130B Weight-Loss Dream Just Collapsed\nDate: 2025-04-14 15:18\nURL: https://finance.yahoo.com/news/pfizers-130b-weight-loss-dream-151831937.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPfizer (NYSE:PFE) just pulled the plug on its daily weight-loss pill, danuglipron, after a clinical trial flagged a potential drug-related liver injury. That decision comes after earlier setbacks tied to severe nausea in its twice-daily versionand leaves Pfizer even further behind in a weight-loss market expected to hit $130 billion by 2030. With demand for Covid products fading fast, the company had pinned big hopes on obesity drugs to fill the gap. Instead, it's now heading back to the drawing board.\nWarning! GuruFocus has detected 6 Warning Signs with PFE.\nThe market didn't take the news lightly. Pfizer shares dropped around 1% premarket 8.59am, while rivals popped. Novo Nordisk (NYSE:NVO) jumped 2.75%, Eli Lilly (NYSE:LLY) rose 2.27% , and Viking Therapeutics (NASDAQ:VKTX) soared nearly 20% in the premarket trading at the same timeall riding momentum from stronger weight-loss offerings. Lilly's Zepbound, a once-weekly injectable, is already generating nearly $5 billion a year and has an oral version in the final stretch of trials. Structure Therapeutics and AstraZeneca aren't far behind, with their own oral contenders in the pipeline.\nThis misstep throws more heat on Pfizer CEO Albert Bourla, who's under pressure to offset looming patent cliffs that could wipe out $15 billion in revenue by decade's end. So far, the pipeline hasn't delivered, and the M&A spree hasn't produced a clear winner. As competitors rack up approvals and market share, Pfizer may have to rethink its next moveand fast. Investors will be watching closely to see if another round of strategic acquisitions is in the cards.\nThis article first appeared on GuruFocus.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 15-41_Top Midday Stories_ Stocks Rally on Tariff Exemption News; Pfizer Discontinues Development of Weight",
    "date": "",
    "content": "Title: Top Midday Stories_ Stocks Rally on Tariff Exemption News; Pfizer Discontinues Development of Weight\nDate: 2025-04-14 15:41\nURL: https://finance.yahoo.com/news/top-midday-stories-stocks-rally-154141521.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAll three major US stock indexes were up in late-morning trading Monday following the announcement o\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 16-45_Pfizer drops obesity pill development after liver injury report",
    "date": "",
    "content": "Title: Pfizer drops obesity pill development after liver injury report\nDate: 2025-04-14 16:45\nURL: https://www.clinicaltrialsarena.com/news/pfizer-drops-obesity-pill-liver-issue/?.tsrc=rss\nContent:\nPfizer still has another obesity pill in development, PF-07976016, which is currently in a Phase IIa trial.\nPfizer has terminated the development of its oral obesity candidate danuglipron after a patient on a clinical trial with the drug suffered a liver injury.\nThe oral glucagon-like peptide-1 receptor agonist (GLP-1RA) was being investigated in chronic weight management in several Phase I and Phase II trials.\n\n                        The gold standard of business intelligence.\n                    \n\n                            Find out more\n                            \n\n\n\n\nTwo Phase I studies (NCT06567327 and NCT06568731) met pharmacokinetic (PK) endpoints and determined a formulation and dose for danuglipron. In one of these studies, an asymptomatic patient experienced a potential drug-induced liver injury. The injury resolved after drug discontinuation; however, Pfizer has decided, based on this event, available clinical data, and recent input from regulators to discontinue the development of the drug. The therapy has been investigated in a total of 1,400 patients.\nChief scientific officer and president of R&D at Pfizer, Dr. Chris Boshoff said: “While we are disappointed to discontinue the development of danuglipron, we remain committed to evaluating and advancing promising programs in an effort to bring innovative new medicines to patients.”\nPfizer will be presenting data from the studies at an upcoming medical conference and peer-reviewed journal.\nUnlike some of its big pharma competitors, Pfizer has not had much luck in the obesity pill space. In December 2023, the company stopped the development of the twice-daily version of danuglipron due to high rates of gastrointestinal side effects. This came six months after the company had culled another oral GLP-1-RA candidate, lotiglipron, due to associated high transaminase levels.\nThe company still has another oral obesity candidate in trials, a once daily glucose-dependent insulinotropic polypeptide (GIP) receptor antagonist, PF-07976016. The therapy is being investigated in a Phase IIa trial (NCT06717425), which was initiated in December 2024.\nPfizer faces fierce competition in the obesity space, especially from Novo Nordisk and Eli Lilly, both of which have cemented a reputation with their subcutaneous GLP-1RA therapies Wegovy (semaglutide) and Zepbound (tirzepatide), respectively.\nEli Lilly is also looking to enter the oral obesity space and is running a Phase III programme of its daily pill orforglipron. GlobalData predicts sales of orforglipron to reach $11.8bn in 2030.\nGlobalData is the parent company of Clinical Trials Arena.\nBiotechs are also making headway in the obesity arena. Viking Therapeutics is studying an oral version of the weight loss therapy VK2735 in an ongoing Phase II study (NCT06828055), and its subcutaneous formulation is set to enter a Phase III trial in Q2 2025.\nPfizer’s stock, listed on the New York Stock Exchange (NYSE), remains stable despite the danuglipron announcement. Meanwhile, Viking’s stock, listed on the Nasdaq exchange, jumped by 21% at market open today (14 April).\n\n\n                The gold standard of business intelligence.\n            \n\n\n                    Find out more\n                    \n\n\n\n\nGive your business an edge with our leading industry insights.\nGive your business an edge with our leading industry insights. \n\n\n\n\n\n\n\n\n\n\n\nVisit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address. \n\n\nView all newsletters from across the GlobalData Media network.\n\n\t\tHard data and deep insights on clinical trials strategy & operations\n\n\t\t\t\tPowered by\n\t\t\t\t\n\n© Verdict Media Limited 2025\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance."
  },
  {
    "title": "2025-04-14 16-53_Pfizer Inc. (PFE)_ “Dead Money… Close the Casket,” Says Jim Cramer",
    "date": "",
    "content": "Title: Pfizer Inc. (PFE)_ “Dead Money… Close the Casket,” Says Jim Cramer\nDate: 2025-04-14 16:53\nURL: https://finance.yahoo.com/news/pfizer-inc-pfe-dead-money-165323179.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 10 Stocks on Jim Cramer’s Radar. In this article, we are going to take a look at where Pfizer Inc. (NYSE:PFE) stands against other stocks on Jim Cramer’s radar.\nOn Thursday, Mad Money host Jim Cramer cautioned viewers about what may lie ahead once the 90-day pause on new tariffs comes to an end. While discussing the latest Consumer Price Index report, Cramer acknowledged that the numbers looked favorable, with inflation appearing relatively tame and even some categories experiencing actual price declines. He pointed to energy prices, saying, “The best, anything it touched energy, which is plummeting.”\nREAD ALSO: Jim Cramer Discussed These 12 Stocks and 10 Stocks on Jim Cramer’s Radar Recently.\n“This is essentially an embargo. President Trump’s ecstatic that the tariffs are already taking in $2 billion a day. He’s thrilled that supposedly 75 countries are begging for something more reasonable than the 90-day pause when the 90-day pause comes to an end.”\nAccording to Cramer, President Trump is “ecstatic” that these tariffs are already generating $2 billion a day in revenue and is thrilled about 75 countries “supposedly” asking for something more workable once the 90-day grace period concludes. Despite the seemingly positive revenue flow, Cramer expressed concern over the broader consequences. He pointed out that many Americans have yet to grasp the full impact of trade policies that have allowed foreign businesses to flood U.S. markets with inexpensive products, often pricing out domestic companies.\nWhile many consumers embraced the lower costs, Cramer reminded his audience that it came at the expense of American jobs. “Now we’re going to have to pay a price. He stressed that consumers should be prepared to pay significantly more for a wide range of goods. He said that the additional cost largely will likely benefit foreign companies, which will hike prices in response to the tariffs imposed on them. He clarified his position by stating he is not a staunch advocate of free trade for its own sake. “No other country plays by the rules on trade, so we shouldn’t either,” he said but cautioned:\n“We just have to be more thoughtful about this or we’ll end up doing more harm than good. Again, as someone who wants fair trade, not free trade, I am rooting for the president to pull this off, but not at the expense of great American companies that have done nothing wrong and are the best in the world.”\nFor this article, we compiled a list of 10 stocks that were discussed by Jim Cramer during the episode of Mad Money aired on April 10. We listed the stocks in ascending order of their hedge fund sentiment as of the fourth quarter of 2024, which was taken from Insider Monkey’s database of over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA medical technician wearing protective gloves and a mask mixing a biopharmaceutical solution.\nNumber of Hedge Fund Holders: 92\nA caller asked if Pfizer Inc. (NYSE:PFE) was a buy or not and Cramer remarked:\n“Well, let me tell you something… right now, we have a government that is trying to figure out whether it’s going to tax the heck out of drug companies, raise tariffs outta drug companies or not. I can’t make a prediction anymore. It yields 8%. Normally I say fine, but you know what? Let’s say you decide, you know what, we need big tariffs on Pfizer. You’ll say, wow, I’m buying that stock at 18 rather than 21. So I’m going to have to say, pass.”\nPfizer Inc. (NYSE:PFE) focuses on discovering, creating, manufacturing, and supplying biopharmaceutical products. Its work covers areas such as heart health, infectious illness, cancer treatment, immune system conditions, and vaccines. On March 31, Cramer said:\n“Is Pfizer dead money? I mean I think it’s been mummified. I don’t know. I mean it’s like, wow. Look at that thing. Close the casket… Alright, Pfizer is unfortunately dead money. Dr. Bourla’s a terrific guy… what can I say? He’s a terrific guy. He’s a terrific guy.”\nOverall, PFE ranks 1st on our list of stocks on Jim Cramer’s radar. While we acknowledge the potential of PFE as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than PFE but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 17-19_Pfizer to Discontinue Development of Experimental Weight-Loss Pill Danuglipron",
    "date": "",
    "content": "Title: Pfizer to Discontinue Development of Experimental Weight-Loss Pill Danuglipron\nDate: 2025-04-14 17:19\nURL: https://finance.yahoo.com/news/pfizer-discontinue-development-experimental-weight-171908293.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPfizer (PFE) said Monday it will no longer develop its investigational pill for weight loss after de\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nDeciding between a $500,000 lump sum or $3,500 monthly annuity payments for your pension isn’t straightforward and involves weighing several personal factors. You need to consider how long you might live, which impacts how much total money you’ll get from monthly payments, alongside your retirement age to see how long your funds need to last. […] The post Should I Take a $500,000 Lump Sum or $3,500 Monthly Payments for My Pension? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 17-23_Pfizer (NYSE_PFE) Discontinues Danuglipron Development After Safety Review in Study",
    "date": "",
    "content": "Title: Pfizer (NYSE_PFE) Discontinues Danuglipron Development After Safety Review in Study\nDate: 2025-04-14 17:23\nURL: https://finance.yahoo.com/news/pfizer-nyse-pfe-discontinues-danuglipron-172306284.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPfizer recently announced the cessation of Danuglipron's development, an event that coincided with a 3% decline in its share price over the past week. This move was primarily due to safety concerns in clinical studies. Despite achieving key pharmacokinetic goals, the discovery of a potential drug-induced liver injury prompted Pfizer to reassess its strategy. This decision adds weight to the company's stock performance, contrasting with broader market trends, where major indexes experienced upward movement amidst tariff-related developments and positive gains in tech sectors. Pfizer's decision highlights the importance of rigorous safety evaluations in pharmaceutical developments.\nWe've discovered 3 warning signs for Pfizer (2 are significant!) that you should be aware of before investing here.\nExplore 22 top quantum computing companies leading the revolution in next-gen technology and shaping the future with breakthroughs in quantum algorithms, superconducting qubits, and cutting-edge research.\nThe cessation of Danuglipron’s development could significantly influence Pfizer's revenue and earnings forecasts moving forward. By prioritizing rigorous safety measures, Pfizer may face setbacks in accelerating R&D productivity and the associated revenue streams. This shift may lead to a more conservative approach in pipeline-driven growth expectations and could delay anticipated financial impacts from new products, potentially further pressuring revenue forecasts already impacted by legislative changes. The development halt aligns with observed market volatility around Pfizer shares, shedding light on investor concerns regarding the company's future earning capabilities amidst evolving challenges in the pharmaceutical sector.\nOver the past year, Pfizer's total return, including dividends, was a 10.14% decline, signaling underperformance relative to both the broader market and the US Pharmaceuticals industry, which experienced negative returns of 8.6%. During this period, the company's earnings showed considerable growth from a very low base, yet they have not matched market expectations overall. Notably, analysts have set a fair value price target of US$26.02, suggesting upside potential compared to the current share price of US$22.49. However, this assumes improvements in profit margins and financial performance that are not without risk given current operational challenges and headwinds from pricing reforms in Medicare.\nUnderstand Pfizer's track record by examining our performance history report.\n This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include NYSE:PFE.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nWhat does PepsiCo do?  The company in question is PepsiCo (NASDAQ: PEP).  Although largely known for its namesake beverages, it operates in the beverage, snack (Frito-Lay), and packaged food (Quaker Oats) categories.\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 17-29_Dell stock pops, Pfizer halts GLP-1 pill trial, M&T Bank outlook",
    "date": "",
    "content": "Title: Dell stock pops, Pfizer halts GLP-1 pill trial, M&T Bank outlook\nDate: 2025-04-14 17:29\nURL: https://finance.yahoo.com/video/dell-stock-pops-pfizer-halts-172944323.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJosh Lipton examines some of the trending stories for investors to watch as part of today's Market Minute.\nDell Technologies (DELL) stock pops as investors weigh a temporary tech tariff exemption.\nPfizer (PFE) has announced that trials for its weight-loss pill are being halted.\nM&T Bank's (MTB) first quarter earnings were in line with analyst estimates, though the bank cut its full-year net interest income forecast.\nStay up to date on the latest market action, minute-by-minute, with Yahoo Finance's Market Minute.\nIt's time for your Yahoo! Finance's market minute. US stocks trim gains as investors now await text current reprieve from President Trump's tariffs. Dell among the tech names getting a lift today. That's following exclusion of smartphones, computers and other consumer electronics from Trump's tariffs. However, confusion over the future of tariffs on China and on specific sectors continues to hang overhead. Pfizer announcing it's halting a late stage trial of its GLP1 pill candidate weight loss stocks such as Novo Nordisk and Eli Lilly getting a pop as Pfizer pauses its competing pill. And lastly, M&T Bank reporting first quarter results roughly in line with estimates, while looking ahead the bank did slash its net interest income forecast for the full year. However, Piper Sandler noting that guide revision was not surprising. And that's your Yahoo! Finance market minute. For more on what's trending on Yahoo! Finance, scan the QR code below.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nBofA analyst Tim Anderson notes Pfizer (PFE) announced danuglipron, an oral GLP-1 obesity, is being discontinued, following a case of liver injury seen in the phase 1 study. The firm points out that it has argued that this program has received almost too much attention – not because obesity isn’t important, but because this was only phase 1 data. Without danuglipron, Pfizer’s obesity pipeline now consists of a GIP receptor antagonist in phase 2 and a phase 1 oral GLP-1 in T2D with Nxera Pharma.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nDeciding between a $500,000 lump sum or $3,500 monthly annuity payments for your pension isn’t straightforward and involves weighing several personal factors. You need to consider how long you might live, which impacts how much total money you’ll get from monthly payments, alongside your retirement age to see how long your funds need to last. […] The post Should I Take a $500,000 Lump Sum or $3,500 Monthly Payments for My Pension? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 18-08_Sector Update_ Health Care Stocks Rise Monday Afternoon",
    "date": "",
    "content": "Title: Sector Update_ Health Care Stocks Rise Monday Afternoon\nDate: 2025-04-14 18:08\nURL: https://finance.yahoo.com/news/sector-health-care-stocks-rise-180801475.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHealth care stocks were higher Monday afternoon, with the NYSE Health Care Index rising 0.4% and the\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 19-55_Stocks to Watch Monday_ Apple, Palantir, Intel, Pfizer",
    "date": "",
    "content": "Title: Stocks to Watch Monday_ Apple, Palantir, Intel, Pfizer\nDate: 2025-04-14 19:55\nURL: https://finance.yahoo.com/m/817c5cd5-5458-3016-8ad9-e99851b0f130/stocks-to-watch-monday%3A.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n↗️ Goldman Sachs (GS): The Wall Street bank posted better-than-expected results, boosted by a surge in equities trading in the first quarter, which ended just before President Trump's sweeping tariffs.\nCompanies In The Article Are:PLTR, INTC, DELL,GS\n“Apple (AAPL) continues to dominate” when it comes to serving and exciting customers, Andy Swan, the co-founder of LikeFolio told Schwab Network recently. Swan predicted that the tech giant would launch “an incredible consumer product within the next couple of years,” adding that “we’re very bullish on Apple over the long term.” Signs of Strength […]\nINTC enters into a definitive agreement to sell a majority stake of its Altera business to Silver Lake for an enterprise value of $8.75 billion.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nPfizer (NYSE: PFE) recently reminded investors how risky the drug-development business can be.  On April 14, the company told investors it would scrap development of danuglipron, its oral GLP-1 candidate for weight management.  Pfizer's stock price is way down, but the quarterly dividend it pays has risen for 16 consecutive years.\nAMD said Tuesday that some of its central-processing units for data centers will be made at Taiwan Semiconductor Manufacturing’s site in Arizona.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 21-15_Top Analyst Reports for Bank of America, Chevron & Stryker",
    "date": "",
    "content": "Title: Top Analyst Reports for Bank of America, Chevron & Stryker\nDate: 2025-04-14 21:15\nURL: https://finance.yahoo.com/news/top-analyst-reports-bank-america-211500618.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMonday, April 14, 2025The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Bank of America Corporation (BAC), Chevron Corporation (CVX) and Stryker Corporation (SYK), as well as two micro-cap stocks Value Line, Inc. (VALU) and Sypris Solutions, Inc. (SYPR). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Today's Featured Research ReportsShares of Bank of America have gained +2.5% over the past year against the Zacks Financial - Investment Bank industry’s gain of +20.4%. The company’s volatile nature of the trading business is a major headwind. Despite an impressive performance since 2022, it is expected to normalize going forward. This is likely to hamper fee income growth. The Zacks analyst project non-interest income to rise only 3.4% in 2025. Continued investments in the franchise will keep the company’s expenses elevated. We expect total non-interest expenses to rise 3% this year. While high funding costs are still a woe, the company’s net interest income (NII) will be positively impacted by higher rates for longer. The Zacks analyst expects NII to record a CAGR of 5.3% over the next three years. Plans to open financial centers in new and existing markets and improve digital capabilities will aid the top line. We project total revenues to grow 4.8% in 2025.(You can read the full research report on Bank of America here >>>)Chevron’s shares have declined -6.2% over the past six months against the Zacks Oil and Gas - Integrated - International industry’s decline of -11.9%. The company being a fully integrated energy firm, is positioned as one of the top global integrated oil firms, set for sustainable production growth, particularly due to its dominant position in the lucrative Permian Basin. Further, the planned acquisition of Hess Corporation is expected to significantly strengthen Chevron's presence in oil-rich Guyana. However, the company is grappling with high sensitivity to oil fluctuations and relatively expensive valuation. Another concern is the weak margins on refined products that forced its downstream segment to its first quarterly loss in 4 years. Considering these factors, investors are advised to wait for a better entry point.(You can read the full research report on Chevron here >>>)Shares of Stryker have gained +4.3% over the past year against the Zacks Medical - Products industry’s gain of +5.5%. The company is poised for growth, driven by rising demand for robotic-assisted procedures, hospital capital expenditures and international expansion. The Mako SmartRobotics platform fuels adoption, while acquisitions like Inari Medical and Vertos Medical enhance the portfolio. Stryker is actively integrating new technologies such as AI-driven imaging and smart surgical systems to improve patient outcomes and maintain its competitive edge. Pricing improvements and a strong hospital order book support 2025 growth. However, foreign exchange volatility and acquisition-related margin pressures may impact earnings. Supply chain disruptions and rising costs could strain profitability. Intensifying competition in robotics and MedTech demands constant innovation. Macroeconomic risks, including potential downturns in healthcare spending and regulatory shifts, add uncertainty.(You can read the full research report on Stryker here >>>)Value Line’s shares have outperformed the Zacks Financial - Investment Management industry over the past year (+10% vs. +6.4%). This microcap company with market capitalization of $370.23 million have robust cash generation, with cash balances rising to $27.1 million from $6.1 million YoY, enhances liquidity and supports dividends, buybacks, and growth investments. EAM Trust income surged 47.7% to $13.8 million, driven by AUM growth to $5 billion, providing a rising, diversified passive income stream. The company maintains disciplined capital returns, paying $0.90/share in dividends and repurchasing shares, with $0.9 million authorization remaining. Portfolio gains doubled to $3.6 million, bolstering earnings. Strong branding and diversified offerings serve both retail and institutional clients, supporting market position. However, core publishing revenue declined to $26.7 million, and customer concentration (30% from one client) heightens risk. Operating costs and taxes rose, further pressuring margins, while limited international presence (~2% of revenues) increases vulnerability to U.S. market shifts.(You can read the full research report on Value Line here >>>)Shares of Sypris Solutions have gained +3.6% over the past year against the Zacks Electronics - Miscellaneous Services industry’s gain of +36.3%. This microcap company with market capitalization of $36.37 million benefits from an extended long-term supply agreement with a global OEM, securing stable revenues as a sole-source supplier of Ultra Axle Shafts. Sypris Solutions’ diversified presence across automotive, energy, and industrial markets reduces risk and positions it to capitalize on growth trends in heavy-duty vehicles and energy infrastructure. Sypris Solutions is also aligned with growth in aerospace and defense electronics, leveraging its capabilities in high-precision components to meet rising demand. Expansion into the Asia-Pacific region aligns with high-growth markets, leveraging regional investments in defense and infrastructure. However, liquidity challenges constrain financial flexibility. Rising costs and reliance on cyclical markets such as heavy vehicles and oil and gas exacerbate margin sensitivity. Competitive pressures in aerospace further heighten vulnerability.(You can read the full research report on Sypris Solutions here >>>)Other noteworthy reports we are featuring today include Pfizer Inc. (PFE), Ormat Technologies, Inc. (ORA) and ONEOK, Inc. (OKE).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nBranch Openings, High Rates Aid BofA (BAC), Fee Income Ails\nPermian Strength Supports Chevron's (CVX) Production Growth\nDiversified Product Portfolio Drives Stryker's (SYK) Prospects\nFeatured Reports\nPfizer's (PFE) New Products Can Drive Sales Growth in 2025Pfizer's non-COVID revenues improved in 2024, driven by its key drugs like Vyndaqel, new launches and newly acquired products from Seagen. The trend should continue in 2025, per the Zacks analyst.\nInvestments Aid Ormat (ORA), Weak Solvency Pose ThreatPer the Zacks analyst, Ormat Technologies' investment in enhancing manufacturing capacity should boost growth. Yet, its weak solvency position threatens the stock's ability to pay off its debt.\nMidstream Assets & Higher Fee-Based Earnings Aid ONEOK (OKE)Per the Zacks analyst, ONEOK is set to benefit from fee-based earnings and midstream assets located in productive regions. Investments made to expand pipelines will drive its performance.\nBroadridge (BR) Gains From Itiviti Buyout, Competition HighPer the Zacks analyst, the Itiviti acquisition has boosted Broadridge's global technology and operations segment. High competition from other players is an overhang.\nAcquisition of Edmunds Aids CarMax (KMX), High Debt AilsPer the Zacks analyst, the acquisition of Edmunds has bolstered CarMax's position in the used auto market. However, its high long-term debt-to-capital ratio remains a concern.\nWatts Water (WTS) Gains on Acquisitions Amid Europe WeaknessPer the Zacks analyst, Watts Water gains from solid acquisitions, cost-cutting efforts and a strong balance sheet, though fewer shipping days and Europe weakness remain concerns.\nSolid Unit Expansion Aid Choice Hotels (CHH), Macro Woes AilPer the Zacks analyst, Choice Hotels benefits from its unit growth strategy, hotel conversions and franchise business. However, uncertain macroeconomic environments are a concern.\nNew Upgrades\nStarz Subscriber Growth Aids Lionsgate's (LGF.A) ProspectsPer the Zacks analyst, increased premium programming, along with higher Starz subscriber growth, is likely to aid Lionsgate's top line growth.\nEverQuote (EVER) Boasts Revenue Growth, Solid Balance SheetPer the Zacks analyst, consumer traffic, quote request volume and innovative advertiser products and services drive EverQuote revenues. Its strong balance sheet enables it to fulfill debt obligations.\nAcquisition of Nissens Boosts Standard Motor (SMP) ProspectsPer the Zacks analyst, the buyout of Nissens has helped Standard Motor expand its geographic presence and establish a significant global growth platform, which will boost its top-line growth in 2025.\nNew Downgrades\nCampbell's (CPB) Gross Margins Hurt by Cost InflationPer the Zacks analyst, cost inflation hurt Campbell's gross margin. In the second quarter fiscal 2025, adjusted gross profit margin fell 100 basis points, hit by cost inflation and supply-chain costs.\nRising Expenses, Low Liquidity Hurt Carlyle's (CG) GrowthPer the Zacks analyst, Carlyle's rising cost base will likely hurt bottom-line growth. Also, with limited liquidity, the company might not be able to meet its near-term debt obligations.\nMacroeconomic Pressures, Fierce Rivalry Ails Illumina (ILMN)The Zacks analyst is concerned with Illumina's robust market opportunity in China taking a hit after MOFCOM bans imports of its NGS sequencers. Intense competitive landscape adds to the worry.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nPfizer Inc. (PFE) : Free Stock Analysis Report\nStryker Corporation (SYK) : Free Stock Analysis Report\nONEOK, Inc. (OKE) : Free Stock Analysis Report\nOrmat Technologies, Inc. (ORA) : Free Stock Analysis Report\nSypris Solutions, Inc. (SYPR) : Free Stock Analysis Report\nValue Line, Inc. (VALU): Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other best oil stocks. After an encouraging start to the year, the energy sector is once again lagging behind the overall […]\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 21-44_Pfizer hits setback in obesity drug race as GLP-1 trial halts",
    "date": "",
    "content": "Title: Pfizer hits setback in obesity drug race as GLP-1 trial halts\nDate: 2025-04-14 21:44\nURL: https://finance.yahoo.com/video/pfizer-hits-setback-obesity-drug-214449466.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPfizer (PFE) is ending a late-stage trial of its once-daily GLP-1 pill, Danuglipron, after a participant experienced a liver injury. Yahoo Finance Senior Reporter Anjalee Khemlani joins Market Domination Overtime to break down the details, as well as preview what to watch as Johnson & Johnson (JNJ) prepares to report earnings.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.\nPfizer announcing today that it is halting a late stage trial of its GLP-1 pill candidate. And Yahoo! Finance's very own Angelina Kamlani joins us now with the latest, Ange.\nJosh, that's right. We heard from Pfizer today that it is choosing to halt its phase three trial of danuglipron, that is its once daily oral pill that was supposed to be a really good competitor in the market. They said that they stopped it because one of the clinical trial participants had a liver injury and after getting off the pill was able to recover. So that is where things stand. This is, you know, really a bumpy ride for Pfizer and the end to it essentially for this one molecule. We'll have to see what the company decides to do. If you take a look at the stock, though, it didn't really move much on the news today, Wall Street seemed to kind of shrug it off, and it seems that analysts are looking at maybe the company looking inwardly through its pipeline or externally to acquire something to get it into the obesity space. Uh we got Akash Tewari from Jefferies saying that we're removing danuglipron from our model and lowering the price target for Pfizer as a result from $34 to $32, and we view this as another frustrating hit to management's credibility. The company has really been under the watch of investors for some time, and you can see on your screen the struggle that it had to really enter this obesity space already, ending one candidate earlier on in June 23rd because of similar liver issues, and then looking at twice daily danuglipron having to scrap that, then advancing once daily and now scrapping that as well. That leaves Eli Lilly as the only contender in the marketplace, uh, for a pill, as well as, of course, already a market leader with the injectables. So, really hot obesity space that Pfizer is missing out on, and investors are looking at what it can do to really get the next blockbuster out of its pipeline. I guess we'll have to wait till earnings at the end of the month to hear more about that.\nAnge, healthcare is such a big business, but if you get it right, you make a lot of money. Johnson & Johnson reports earnings tomorrow. Any wisdom, what to expect?\nYeah, we're definitely keeping an eye on a few things for Johnson & Johnson. Of course, it is a maker of medical devices, which we know have been hit by the tariffs as well as a pharmaceutical manufacturing, which has been, uh, looked at as having some sort of special tariffs that we've heard from President Trump. So, we're looking on any kind of impact from those conversations, as well as broader tariff impact on guidance. We've seen a couple of companies pull, and we'll see if Johnson & Johnson does so as well. We do know the company has committed to $55 billion in US manufacturing. So we'll have to see how that all shakes out when the company, uh, lets us know tomorrow morning.\nAnge, thank you. Appreciate it.\nJohnson & Johnson is holding its earnings outlook steady despite President Donald Trump signaling he could put tariffs on the pharmaceutical industry. The administration announced earlier it would conduct an investigation into drug imports. That move is widely seen as a first step toward imposing new levies. Earnings and revenue both beat estimates for the quarter. Johnson & Johnson CFO Joe Wolk joined Bloomberg Open Interest to talk about how tariffs could hit the industry and the drug maker's bottom line.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nBofA analyst Tim Anderson notes Pfizer (PFE) announced danuglipron, an oral GLP-1 obesity, is being discontinued, following a case of liver injury seen in the phase 1 study. The firm points out that it has argued that this program has received almost too much attention – not because obesity isn’t important, but because this was only phase 1 data. Without danuglipron, Pfizer’s obesity pipeline now consists of a GIP receptor antagonist in phase 2 and a phase 1 oral GLP-1 in T2D with Nxera Pharma.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWhile cigarette consumption has been in long-term decline, Altria has successfully pivoted to smoke-free alternatives.\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nDeciding between a $500,000 lump sum or $3,500 monthly annuity payments for your pension isn’t straightforward and involves weighing several personal factors. You need to consider how long you might live, which impacts how much total money you’ll get from monthly payments, alongside your retirement age to see how long your funds need to last. […] The post Should I Take a $500,000 Lump Sum or $3,500 Monthly Payments for My Pension? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 03-32_Trump Initiates Chips and Drug Probes Ahead of More Tariffs",
    "date": "",
    "content": "Title: Trump Initiates Chips and Drug Probes Ahead of More Tariffs\nDate: 2025-04-15 03:32\nURL: https://finance.yahoo.com/news/trump-announces-chips-drug-probes-204108780.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nThe Secret Formula for Faster Trains\nEven Oslo Has an Air Quality Problem\nNYC Tourist Helicopter Crashes in Hudson River, Killing Six\nLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage\nPresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade probes led by the Commerce Department.\nThe moves, announced Monday in the Federal Register, are a precursor to imposing tariffs and threaten to broaden the president’s sweeping US trade war.\nThe Commerce Department said it had begun investigating the impact on US national security of “imports of semiconductors and semiconductor manufacturing equipment” as well as “pharmaceuticals and pharmaceutical ingredients, including finished drug products” in a pair of register notices.\nListen to the Here’s Why podcast on Apple, Spotify or anywhere you listen.\nThe probes, which began April 1 and were ordered under Section 232 of the Trade Expansion Act, could play out for months. Under the law, the Commerce Secretary is expected to deliver the results of his investigation within 270 days, though Trump and other officials have signaled these efforts could conclude more quickly.\nThe US president has long decried foreign production of drugs and chips as a threat to national security and threatened to slap tariffs on imports in a bid to revive American manufacturing of those products. But the duties could also wreak havoc on supply chains and drive up costs for Americans.\nNew levies threaten to roil a chips industry that notched more than $600 billion in global sales of semiconductors essential to products ranging from cars to airplanes and mobile phones to consumer electronics. Supply chains still feeling the effect of disruptions caused by the Covid-19 pandemic now could face new strains from the US duties.\nThe administration’s announcement came days after it exempted semiconductors, mobile phones, computers and other electronics imports from 145% duties applied to China. That announcement was seen as a boon to tech giants like Apple Inc. and Nvidia Corp., but Trump and his advisers quickly said the relief would be short lived and that separate levies would be placed on chips.\nThe Commerce Department investigation on semiconductors is designed to have a wide range, evaluating imports of both legacy and leading-edge chips that are coveted for artificial intelligence applications. The probe will span imports of all semiconductors and the equipment used to manufacture them as well as electronic products that contain the components, according to the government notice.\nTariffs on the semiconductor sector risk affecting a wide range of companies that send billions of dollars in microprocessors and related goods to the US each year. Foreign makers of advanced chips including Taiwan Semiconductor Manufacturing Co. and SK Hynix of South Korea could be forced to raise prices or accept smaller margins if Trump delivers on his threat of import levies.\nThe measures also threaten to impose higher costs on Trump’s vision for expanding domestic semiconductor production, especially if imported chip-manufacturing equipment from companies like ASML Holding NV gets hit with tariffs. Netherlands-based ASML is a leading provider of advanced lithography machines used to produce the smallest computer chips used in AI and other sensitive applications.\nThe separate drug probe will examine imports of all pharmaceuticals — both finished generic and non-generic medicines — as well as the ingredients used to make them. Investigators also will probe imports of critical pharmaceutical inputs. The public is invited to weigh in on both probes with comments over the next 21 days.\nTariffs would also be a blow to the world’s largest drugmakers, including Merck & Co. and Eli Lilly & Co., virtually all of which operate scores of manufacturing sites scattered across the globe.\nAlex Schriver, spokesman for the trade group PhRMA, said in a statement that the pharmaceutical industry shares Trump’s goal of boosting US manufacturing. While he said the industry would work with the administration throughout its process, he added that “medicines have historically been excluded from tariffs because they can lead to higher costs and shortages of life-saving medicines.”\nDrug companies have raced to announce major investments in the US ahead of potential tariffs. Most recently, Swiss drugmaker Novartis AG said it plans to invest $23 billion in the US over the next five years, following earlier pledges from Eli Lilly, Merck & Co. and Johnson & Johnson.\nBut experts warned that likely wouldn’t blunt the impact of the tariffs.\n“There is no quick fix for exposed companies, in our view,” Leerink Partners analyst David Risinger said in a note to clients ahead of the announcement. “Redomiciling manufacturing would take years and be very costly.”\nDrugmakers will face a choice between eating the costs of potential tariffs or raising prices for their medicines in what is already the most expensive market in the world.\n“There’s a lot at stake politically I think for branded manufacturers to be increasing prices here,” said Marta Wosińska, a senior fellow at the Brookings Institution’s Center on Health Policy. “I do think there’s going to be reluctance to passing through price increases.”\nBecause there are some controls on the price of drugs, tariffs could end up hurting drugmakers’ bottom line, leading them to scale back research, according to Lilly Chief Executive Officer Dave Ricks.\n“We have to eat the cost of the tariffs and make trade offs within our own companies,” Ricks recently told the BBC. “Typically that will be in reduction of staff or research and development (R&D) and I predict R&D will come first. That’s a disappointing outcome.”\nTrump, who has repeatedly bemoaned US drugmakers’ reliance on overseas production, is breaking decades of tradition. The pharmaceutical industry has long side-stepped trade wars, protected by international agreements that largely protected medicines from tariffs on humanitarian grounds.\nWorldwide Impact\nTrump’s move on semiconductors is similar to the way he’s targeted other sectors, with imported steel, aluminum and automobiles already facing 25% tariffs and an ongoing Commerce Department trade probe expected to result in levies on foreign copper.\nUnder former President Joe Biden, the US already had doubled tariffs on so-called legacy semiconductors from China to 50% and last December launched a probe into Chinese concentration in the category that sets the stage for Trump to impose even higher levies. While not as advanced as chips driving artificial intelligence, the older technology is ubiquitous in autos, airplanes, medical devices and telecommunications.\nTrump has cast revitalizing the US chipmaking industry and industrial base as essential for the nation’s security. Winning a global race to dominate the AI industry is also a top Trump administration priority. Analysts have warned that bringing chip manufacturing to the US will take years of hard work.\nThe move on medicines will have an outsize effect on Ireland, with a $54 billion (€47.6 billion) trade surplus with the US that helped spur Trump’s wrath. The imbalance, heavily weighted by the pharmaceutical industry, stems from the country’s favorable tax regime and highly educated workforce. US drug companies, including Lilly and Pfizer Inc., operate nearly two dozen factories in Ireland that ship to the US, according to a TD Cowen analysis.\nThe US biotech industry, which drives much of the innovation in drug development, is also vulnerable to the new tariffs. Nearly 90% of American companies rely on imported components for US-approved products, according to a recent survey by the Biotechnology Innovation Organization. As a result, the supply of medicines for US patients and families are particularly vulnerable to proposed tariffs on the European Union, China and Canada, the group wrote.\nNearly all of the companies surveyed said they expect manufacturing costs to surge if import tariffs are placed on the European Union. Half of the 42 companies said they’d be forced to scramble for new research and manufacturing partners or they’d need to rework or potentially delay regulatory filings for new products.\n“Re-onshoring key parts of the biotechnology supply chain to the U.S. and our allies and strengthening the American manufacturing base should be a high priority for both national and economic security,” BIO President John Crowley said in a statement. “It will take years, though, for this shift. We need to be mindful of the negative consequences of these proposed tariffs.”\nTrump’s Exemptions\nThe US president earlier Monday announced he would consider temporary reprieves from his 25% tariff on automotive imports to allow companies time to bring production to the US.\nThe announcement suggested that the president was willing to negotiate with industry leaders, and a similar push from technology and pharmaceutical executives is almost certain to follow.\n“He’s going to get this onshoring to happen as soon as possible and as orderly as possible,” Trump economic adviser Kevin Hassett said Monday on Fox Business. “And so when he talks to CEOs and they say, ‘Hey, I need a little more time with this, I need a little time more more time with that,’ then he’s absolutely willing to listen.”\nTreasury Secretary Scott Bessent, in an interview with Bloomberg Television, said the administration remained focused on negotiating deals that would benefit Americans.\n“I think we’re going to start the negotiations, and just like with everyone else, I’m telling them, bring your A-game. We’ll see what you got, and we’ll go from there,” Bessent said.\nTrump was asked what short-lived product exclusions he was considering but did not specify how long a potential pause or lowering of auto levies would remain in place.\n--With assistance from Michael Shepard, Annmarie Hordern, Hadriana Lowenkron and Derek Wallbank.\n(Updates with pharmaceutical industry comment in 13th paragraph.)\nMost Read from Bloomberg Businessweek\nThe Beauty Salon Recession Indicator\nTrump Is Firing the Wrong People, on Purpose\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nCheap Consumer Goods Are the American Dream, Actually\nWorld Travelers Are Rethinking Vacation Plans to the US\n©2025 Bloomberg L.P.\n(Bloomberg) -- Japan’s Fair Trade Commission ordered Alphabet Inc.’s Google to stop alleged abuse of its market power over local smartphone manufacturers, just ahead of high-stakes trade negotiations with the US this week.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Even Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing Six$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingLA County Floats Leaner Budget Burdened by Fi\nNetflix shares jumped Tuesday following a report company executives said the streaming giant aims to double its revenue and join the $1 trillion market capitalization club by 2030.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nWe recently published a list of 10 AI Stocks on the Move. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other AI stocks on the move. Market uncertainty aside, the AI race is tighter than ever. A report by Stanford University’s Institute for Human-Centered AI (HAI) […]\n(Bloomberg) -- As China staggers into a slowdown caused by Donald Trump’s trade war, a hobbled jobs market is impairing the resilience Beijing needs to battle it out against the US.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortageTrump’s 145% tariffs on China’s goods are threatening to\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 04-40_Why Viking Therapeutics, Inc. (VKTX) Skyrocketed On Monday_",
    "date": "",
    "content": "Title: Why Viking Therapeutics, Inc. (VKTX) Skyrocketed On Monday_\nDate: 2025-04-15 04:40\nURL: https://finance.yahoo.com/news/why-viking-therapeutics-inc-vktx-044028854.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers.\nThe stock market kicked off the shortened trading week on a positive note, with Wall Street’s major indices finishing in the green following President Donald Trump’s temporary tax reprieve on technology companies.\nThe S&P 500 recorded the highest gain, up 0.79 percent, while the Dow Jones came second at 0.78 percent. The tech-heavy Nasdaq was also up by 0.64 percent.\nBenchmark indices aside, 10 companies dominated by biotechnology firms mirrored the broader market optimism, recording modest gains during the session.\nIn this article, let us explore Monday’s top 10 gainers and the reasons behind their gains.\nTo come up with the list, we only considered the stocks with $2 billion market capitalization and $5 million trading volume.\nA microbiologist in protective gear studying samples in a laboratory.\nViking Therapeutics Inc. saw its share prices jump by 10.58 percent on Monday to finish at $24.57 apiece following news that Pfizer Inc. (NYSE:PFE) will discontinue the development of its oral obesity medication, danuglipron, amid safety concerns.\nAccording to PFE, the decision came after a patient experienced a potential liver injury linked to the drug.\nThe scrapped plans, however, spelled good news for VKTX which is similarly underway with the development of an oral weight loss candidate called VK2735, with PFE now out of the competition.\nIn other news, reports surfaced last month that PFE was set to take over VKTX, and tapped Morgan Stanley as its advisor for the acquisition.\nThe rumors came days after VKTX released its earnings performance in the fourth quarter of the year, widening its net loss by 44 percent to $35.4 million from the $24.6 million in the same period a year earlier.\nNet loss for full-year 2024 also widened by 28 percent to $109.96 million from $85.895 million in 2023.\nOverall, VKTX ranks 5th on our list of biotech stocks that dominate Monday’s top gainers. While we acknowledge the potential of VKTX as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than VKTX but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nNo one ever claimed investing in the biotech industry was a smooth ride, but for shareholders of Viking Therapeutics (NASDAQ: VKTX), the turbulence has been extremely challenging thus far.  The stock is down 71% over the past year, amid ongoing uncertainties regarding the timeline for future commercialization of its clinical pipeline and the broader stock market sell-off.  Progress toward regulatory approval with multiple data readouts expected later this year could be the catalyst for shares to rebound sharply.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nDeciding between a $500,000 lump sum or $3,500 monthly annuity payments for your pension isn’t straightforward and involves weighing several personal factors. You need to consider how long you might live, which impacts how much total money you’ll get from monthly payments, alongside your retirement age to see how long your funds need to last. […] The post Should I Take a $500,000 Lump Sum or $3,500 Monthly Payments for My Pension? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 11-39_Is High-Yield Pfizer Stock Still a Buy After Scrapping Its Weight Loss Pill_",
    "date": "",
    "content": "Title: Is High-Yield Pfizer Stock Still a Buy After Scrapping Its Weight Loss Pill_\nDate: 2025-04-15 11:39\nURL: https://www.fool.com/investing/2025/04/15/is-pfizer-still-a-buy-after-scrapping-its-weight-l/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=5390b8a2-2770-46ca-8fc8-c9bfe8d747d0&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nPfizer (PFE -1.74%) recently reminded investors how risky the drug-development business can be. On April 14, the company told investors it would scrap development of danuglipron, its oral GLP-1 candidate for weight management. The stock has been trading about 63% below its all-time high.\nPfizer's stock price is way down, but the quarterly dividend it pays has risen for 16 consecutive years. At its beaten-down price, the stock offers an eye-popping 7.8% yield.\nIf Pfizer continues its dividend-raising streak, investors who buy at recent prices could realize market-beating gains over the long run. Let's look a little closer at danuglipron, plus some bigger problems the company faces, to see if this stock could be a smart buy on the dip.\nThe end of Pfizer's danuglipron program highlights just how risky the drug-development process can be. According to the company, it discontinued development after just one patient in a dose-optimization study experienced a liver injury that could have been caused by the experimental GLP-1 pill.\nThe danuglipron program's termination is disappointing, but it won't be the end of Pfizer's attempt to develop blockbuster weight-management drugs. The company has an oral glucose-dependent insulinotropic polypeptide receptor (GIPR) antagonist in phase 2 trials. Investors will probably hear more about this candidate, tentatively named PF-07976016, down the road.\nA disappointing outcome for a weight-management candidate isn't anywhere near the top of Pfizer's list of problems. Investors should be far more concerned with an upcoming loss of patent-protected market exclusivity for Eliquis. Sales of the oral blood thinner it markets in partnership with Bristol-Myers Squibb rose to $7.4 billion, or 11.6% of total revenue last year.\nEliquis is expected to lose patent-protected exclusivity in 2026, although generic competition in the U.S. market isn't expected to begin until 2028. Pfizer's second-largest revenue stream in 2024 could also start drying up soon. The Prevnar family of vaccines was responsible for over 10% of total sales last year. Prevnar 13 is expected to lose patent-protected exclusivity in the U.S. next year.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nVyndaqel has been a strong growth driver for Pfizer but probably not for much longer. This treatment prevents heart damage caused by transthyretin (TTR) amyloidosis and grew sales by 64% to reach $5.4 billion last year. Bridge Bio and Alnylam are now marketing competing treatments for the limited population of TTR amyloidosis patients with heart damage. In addition to competing treatments, Vyndaqel is expected to face generic competition in the U.S. in 2028.\nDrug developers need to communicate with regulators at the Food and Drug Administration (FDA) before, during, and after they run clinical trials for new drug candidates. In the U.S., many of those regulators recently lost their jobs.\nIn 2024, the FDA's Center for Drug Evaluation and Research (CDER) approved 50 new drugs. The CDER director, Patrizia Cavazzoni, M.D., stepped down in January and joined Pfizer's C-suite as chief medical officer.\nHaving the former CDER director on staff could be advantageous for Pfizer, but I'll be pleasantly surprised if the FDA completes new drug approvals at half the usual pace this year. According to reporting from STAT, more than a few FDA employees involved in the new drug approval process were among thousands recently fired from the agency.\nA crippled FDA could be a huge problem for Pfizer and its peers who must constantly launch new drugs to overcome exclusivity losses for established products.\nMany investors expect pharmaceutical industry lobbyists to prevent the Trump administration from rendering CDER incapable of reviewing new drug applications at its usual pace. They could be right, but I won't support an investment thesis that relies on industry lobbyists protecting a regulatory agency.\nIf you asked me a month ago, I would have called this stock a buy. In 2023, it earned FDA approval for nine new drugs and last year it reported over a dozen product approvals from the agency. With plenty of new products coming online, Pfizer had a good chance to overcome upcoming patent cliffs and maintain its dividend-raising streak.\nNow that the CDER has been dramatically downsized, it's probably best to assume the worst. I'll be avoiding this and all drugmaker stocks until we see proof that a much smaller FDA can continue approving new drugs at the usual pace.\n\n \n\nBefore you buy stock in Pfizer, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Pfizer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nCory Renauer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Alnylam Pharmaceuticals, Bristol Myers Squibb, and Pfizer. The Motley Fool recommends BridgeBio Pharma. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-15 14-00_NVO, LLY, GPCR & VKTX Stocks Gain Following PFE's Obesity Study Setback",
    "date": "",
    "content": "Title: NVO, LLY, GPCR & VKTX Stocks Gain Following PFE's Obesity Study Setback\nDate: 2025-04-15 14:00\nURL: https://finance.yahoo.com/news/nvo-lly-gpcr-vktx-stocks-140000975.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nObesity stocks like Novo Nordisk NVO, Eli Lilly LLY, Structure Therapeutics GPCR and Viking Therapeutics VKTX gained 2.1%, 3%, 10.6% and 19.2%, respectively, on Monday after pharma bigwig Pfizer PFE announced that it is discontinuing the development of its GLP-1R weight loss pill, danuglipron.\nPfizer has decided to discontinue the development of its oral obesity drug danuglipron, despite promising results from dose-optimization studies that met key pharmacokinetic goals and showed potential for competitive efficacy and tolerability. Although liver enzyme elevations in the enrolled patients were generally consistent with other approved drugs in the same class, one patient experienced a potential case of drug-induced liver injury, which resolved after stopping treatment with danuglipron.\nAfter reviewing all clinical data and considering regulatory feedback, Pfizer concluded that halting the program was the best course of action. This decision reverted Pfizer’s developmental program for an obesity candidate back to the early clinical stages and has significantly delayed its hopes for marketing an obesity drug that would compete with Lilly’s Zepbound and Novo Nordisk’s Wegovy for market share.\nHowever, PFE shares have not slid despite the setback, which likely reflects positive investor expectations regarding Pfizer’s ability to bounce back from its current predicament. Pfizer plans to continue the development of its oral GIPR antagonist candidate, PF-07976016, which is currently in mid-stage development and other early-stage obesity programs. Pfizer could also in-license rights to a late-stage obesity candidate from other biotechs for developing and commercialization.\nInterestingly, Jefferies reduced Pfizer’s price target from $34 to $32 following the setback, but maintained its BUY rating for the stock.\nNovo Nordisk and Eli Lilly currently dominate the obesity market on the back of the tremendous success of their GLP-1 injections. Lilly markets its dual GIP and GLP-1 receptor agonist, tirzepatide, as Zepbound for obesity, while Novo Nordisk markets its semaglutide drug as Wegovy injection for weight management.\nYear to date, shares of PFE, LLY and NVO have lost 16.6%, 2.3% and 23.2%, respectively, compared with the industry’s 4.9% decline.\nImage Source: Zacks Investment Research\nPfizer’s setback eliminates an imminent contender for LLY and NVO’s market share in the obesity space. Both firms have been raking in substantial revenues from the sale of their respective obesity injections. In 2024, Zepbound sales amounted to $4.9 billion, while Wegovy sales recorded $8.4 billion during the same time frame, both representing a substantial increase over their previous year's figures.\nShares of Lilly, Novo Nordisk, Viking Therapeutics and Structure Therapeutics rose as Pfizer's decision to discontinue its obesity pill program removes a key competitor from the market. Lilly and Novo Nordisk are also developing oral pills for treating obesity. Oral drugs are easier to use compared to injections, which can improve patient compliance. NVO is developing its oral obesity pill, amycretin, in a mid-stage study while Lilly’s oral obesity pill, orforglipron, is currently undergoing phase III development.\nViking Therapeutics and Structure Therapeutics also have oral obesity candidates in their pipeline in mid-stage development.\nYear to date, shares of VKTX and GPCR have plunged 38.9% and 30.1%, respectively, compared with the industry’s 6.4% decline.\nImage Source: Zacks Investment Research\nVKTX is currently evaluating the safety and efficacy of the oral formulation of its experimental obesity drug, VK2735, in a mid-stage study. Last month, the company reported completing enrollment in the phase II VENTURE-Oral Dosing study of the candidate for the obesity indication. Data from this study is expected in the second half of 2025.\nVKTX also plans to start a late-stage study on the subcutaneous version of VK2735 by the first half of this year.\nOn the other hand, Structure Therapeutics is conducting multiple mid-stage studies on its lead candidate, aleniglipron(GSBR-1290), a highly selective oral GLP-1 receptor agonist, for treating healthy overweight or obese individuals.\nThe rapid advancements being made by Viking Therapeutics and Structure Therapeutics in the development of their respective oral obesity treatment candidates have made them lucrative targets for collaboration or M&A deals.\nWhile Pfizer, Novo Nordisk, Eli Lilly and  Structure Therapeutics currently carry a Zacks Rank #3 (Hold) each, Viking Therapeutics has a Zacks Rank #4 (Sell) at present.\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPfizer Inc. (PFE) : Free Stock Analysis Report\nNovo Nordisk A/S (NVO) : Free Stock Analysis Report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nViking Therapeutics, Inc. (VKTX) : Free Stock Analysis Report\nStructure Therapeutics Inc. Sponsored ADR (GPCR) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe came across a bullish thesis on Novo Nordisk A/S (NVO) on Substack by Felix. In this article, we will summarize the bulls’ thesis on NVO. Novo Nordisk A/S (NVO)’s share was trading at $64.49 as of April 15th. NVO’s trailing and forward P/E were 18.76 and 15.41 respectively according to Yahoo Finance. Novo Nordisk, a dominant […]\nInvestment management company Vulcan Value Partners recently released its first-quarter 2025 investor letter. A copy of the letter can be downloaded here. The first quarter experienced the return of volatility. The companies’ management teams expressed a more cautious view following the recent election. Optimism has given way to uncertainty about tariffs and potential impacts on earnings, inflation, and […]\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nMerck and AbbVie are included in this Analyst Blog.\nThis summer, UnitedHealth, Amedisys and antitrust regulators will have a magistrate judge’s help in hashing out a solution to the DOJ’s opposition to the merger.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nNorthern Trust (NTRS) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nPfizer (NYSE: PFE) recently reminded investors how risky the drug-development business can be.  On April 14, the company told investors it would scrap development of danuglipron, its oral GLP-1 candidate for weight management.  Pfizer's stock price is way down, but the quarterly dividend it pays has risen for 16 consecutive years.\nEuropean drugmaker Novartis (NVS), best known for blockbuster drugs like Entresto, Cosentyx, and Kesimpta, just announced a major U.S. investment. The $200 billion pharma company intends to invest $23 billion in U.S.-based manufacturing to conduct research and development and produce all its major drugs stateside. Judging by Novartis’ stock performance in the days following the news, the market signaled its approval. Donald Trump is likely to be delighted, too. Novartis’ latest move is a reactiv\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 14-35_Smaller obesity drugmakers jump after Pfizer scraps weight-loss pill",
    "date": "",
    "content": "Title: Smaller obesity drugmakers jump after Pfizer scraps weight-loss pill\nDate: 2025-04-15 14:35\nURL: https://finance.yahoo.com/news/smaller-obesity-drugmakers-jump-pfizer-143525028.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the space. The Fly notes that Novo Nordisk (NVO) and Eli Lilly (LLY) manufacture some of the most popular weight loss drugs currently on the market, namely Ozempic, Wegovy, and Mounjaro.\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities using  Tipranks' Stock Screener.\nDANUGLIPRON DISCONTINUATION: Pfizer announced the decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. Pfizer’s dose-optimization studies of once-daily formulations of danuglipron met key pharmacokinetic objectives and confirmed a formulation and dose with the potential to deliver a competitive efficacy and tolerability profile in Phase 3 testing, based on earlier studies of twice-daily danuglipron. While the overall frequency of liver enzyme elevations across the over 1,400 participant safety database of danuglipron is in-line with approved agents in the class, a single asymptomatic participant in one of the dose-optimization studies experienced potential drug-induced liver injury which resolved after discontinuation of danuglipron. After a review of the totality of information, including all clinical data generated to date for danuglipron and recent input from regulators, Pfizer has decided to discontinue development of the molecule.\n“Cardiovascular and metabolic diseases including obesity remain important areas of unmet medical need, and we plan to continue applying our global capabilities to advance a pipeline of investigational treatments that have the potential to fill critical gaps in patient care, including continued development of our oral GIPR antagonist candidate and other earlier obesity programs,” said Chris Boshoff, Chief Scientific Officer and President, Research and Development at Pfizer. “While we are disappointed to discontinue the development of danuglipron, we remain committed to evaluating and advancing promising programs in an effort to bring innovative new medicines to patients.”\nLIMITED REACTION: Commenting on the news, Morgan Stanley says that its sense is that investor expectations for Danu were low. With Pfizer shares trading at a greater than 7% dividend yield, which could offer support for the stock, the firm expects “a limited reaction” in the shares to the discontinuation news. Morgan Stanley keeps an Equal Weight rating and $31 price target on Pfizer shares. The firm also notes that it expects initial Phase 3 data for Eli Lilly’s Orforglipron this quarter representing the next key catalyst for the oral GLP-1 category.\nMOSTLY POSITIVE: JPMorgan says Pfizer’s decision to discontinue development of danuglipron, an oral small molecule GLP-1, due to a liver toxicity issue in one patient, is “mostly a positive” for Structure Therapeutics and Viking Therapeutics. Structure is now in line to become the second small molecule oral to enter the market and Viking becomes an “even more attractive partnership candidate,” the firm tells investors in a research note. JPMorgan believes Structure shares could be modestly up, to 5%, as a result of Pfizer’s update.\nPRICE ACTION: In Monday morning trading, shares of Pfizer are up modestly at $22.17, while Viking’s shares have jumped about 10% to $24.43 and Structure has rallied almost 11% to $17.77.\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee today’s best-performing stocks on TipRanks >>\nRead More on PFE:\nDisclaimer & DisclosureReport an Issue\nJPMorgan says Pfizer news ‘mostly a positive’ for Structure, Viking\nViking, Structure rally after Pfizer halts obesity drug development\nMorgan Stanley sees ‘limited reaction’ in Pfizer shares to oral GLP-1 scrapping\nPfizer’s Danuglipron Discontinuation: Limited Impact on Stock Despite Hold Rating\nPfizer Stock (PFE) Dips after Weight-Loss Pill Halted Over Liver Injury\nThe financing highlights ACEN's commitment as a long-term investor in the nation's clean economy.\nThe proposed revisions to SMOs address developments in international standards.\nScotiabank raised the firm’s price target on AngloGold Ashanti (AU) to $42 from $34 and keeps a Sector Perform rating on the shares. The firm is updating its price targets on stocks in the Gold & Precious Minerals sector, the analyst tells investors. The firm is expecting flat margins quarter-over-quarter given Q1 is a weaker operating quarter for most companies, with stronger operating performance in the second half of the year. Commentary on potential tariff impact will be a focus for most com\nPFE's decision to scrap the development of danuglipron comes after a study participant develops potential drug-induced liver injury.\nScotiabank analyst Tanya Jakusconek raised the firm’s price target on Agnico Eagle (AEM) to $126 from $105 and keeps an Outperform rating on the shares. The firm is updating its price targets on stocks in the Gold & Precious Minerals sector, the analyst tells investors. The firm is expecting flat margins quarter-over-quarter given Q1 is a weaker operating quarter for most companies, with stronger operating performance in the second half of the year. Commentary on potential tariff impact will be\nThe International Monetary Fund disbursed on Tuesday the first installment of Argentina's new $20 billion bailout after President Javier Milei removed most of Argentina’s strict capital and currency controls.  For years, the restrictions had set the official exchange rate and barred companies and individuals from moving money freely.  The reserves in the Central Bank of Argentina reached $36.8 billion on Tuesday, their highest in two years, the monetary authority said, giving Milei the firepower he'd needed to lift the controls.\nWe recently published a list of Jim Cramer Reacts to the Surprise Market Surge and Highlights 8 Key Stocks In this article, we are going to take a look at where Applovin Corp. (NASDAQ:APP) stands against other key stocks that Jim Cramer highlights. In his latest appearance on CNBC’s Squawk on the Street, Jim Cramer analyzed […]\nUntil excessive inequality is addressed, expect increased political violence, populism, and social unrest.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 15-05_BofA keeps Neutral on Pfizer after danuglipron failure as core thesis unchanged",
    "date": "",
    "content": "Title: BofA keeps Neutral on Pfizer after danuglipron failure as core thesis unchanged\nDate: 2025-04-15 15:05\nURL: https://finance.yahoo.com/news/bofa-keeps-neutral-pfizer-danuglipron-150532621.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBofA analyst Tim Anderson notes Pfizer (PFE) announced danuglipron, an oral GLP-1 obesity, is being discontinued, following a case of liver injury seen in the phase 1 study. The firm points out that it has argued that this program has received almost too much attention – not because obesity isn’t important, but because this was only phase 1 data. Without danuglipron, Pfizer’s obesity pipeline now consists of a GIP receptor antagonist in phase 2 and a phase 1 oral GLP-1 in T2D with Nxera Pharma. If the company is committed to obesity, a possible next step could be business development, BofA argues. The firm reiterates a Neutral rating for Pfizer as it believes core thesis remains unchanged.\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities using  Tipranks' Stock Screener.\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee Insiders’ Hot Stocks on TipRanks >> \nRead More on PFE:\nDisclaimer & DisclosureReport an Issue\nIs Pfizer Stock (PFE) Worth Buying After Its Weight Loss Pill Failure?\nBTIG highlights some reasons to own Viking shares after danuglipron discontinued\nSmaller obesity drugmakers jump after Pfizer scraps weight-loss pill\nJPMorgan says Pfizer news ‘mostly a positive’ for Structure, Viking\nViking, Structure rally after Pfizer halts obesity drug development\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nCarmat is preparing to commence implants in the second half of this year.\nHQY stock is down more than 13% YTD amid cyber threats and rising costs, but strong HSA fundamentals remain. Is it time to hold or fold? Let's break it down.\nBofA lowered the firm’s price target on West Pharmaceutical (WST) to $280 from $285 and keeps a Buy rating on the shares. Sentiment for Life Sciences and Diagnostic Tools and Contract Research Organizations is “particularly negative” heading into earnings given that these companies “sit at the intersection of a number of policy changes from the Trump Administration,” including headwinds from NIH budget cuts and global tariffs, as well as broader macro concerns, especially around China, the analy\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Pacira BioSciences, Inc. (NASDAQ:PCRX) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big American […]\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nAdvertising giant hasn’t seen any specific instances of marketer clients pulling back thus far, executives say.\nBMS could soon face competition in the HCM space as Cytokinetics awaits a marketing application decision from the FDA for aficamten.\nThe FDA bestows a Regenerative Medicine Advanced Therapy tag on FATE's pipeline candidate, FT819, for treating moderate-to-severe systemic lupus erythematosus.\nPfizer (NYSE: PFE) recently reminded investors how risky the drug-development business can be.  On April 14, the company told investors it would scrap development of danuglipron, its oral GLP-1 candidate for weight management.  Pfizer's stock price is way down, but the quarterly dividend it pays has risen for 16 consecutive years.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 16-57_Pfizer Halts Obesity Pill Development Amid Safety Concerns",
    "date": "",
    "content": "Title: Pfizer Halts Obesity Pill Development Amid Safety Concerns\nDate: 2025-04-15 16:57\nURL: https://finance.yahoo.com/news/pfizer-halts-obesity-pill-development-165700605.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPfizer PFE announced that it is discontinuing the development of danuglipron, its investigational oral GLP-1 receptor agonist (GLP-1 RA), which is being developed to treat obesity.\nThe decision follows a safety signal observed during two dose-optimization studies, in which one study participant experienced a case of potential drug-induced liver injury. Although the individual was asymptomatic and fully recovered after stopping the treatment, Pfizer stated that its decision was based on a comprehensive review of all clinical data generated to date, along with recent regulatory feedback.\nWhile the two dose-optimization studies had met key pharmacokinetic goals and identified a dose with the potential for competitive efficacy and tolerability, the safety concerns ultimately led Pfizer to stop further development of danuglipron.\nThis is the second time that Pfizer has faced setbacks in connection with the pipeline development of danuglipron. In December 2023, the company announced that it would not move forward with phase III studies on the twice-daily formulation of danuglipron. Though the drug was effective in reducing weight in a phase IIb study, it caused several gastrointestinal side effects like nausea, vomiting and diarrhea. Back then, the company said that the pharmacokinetic study of the once-daily formulation of danuglipron continues, and it will focus on its development.\nThis also marks the second time in two years that Pfizer has given up on an obesity drug. Back in 2023, Pfizer had dropped the development of another GLP-1-RA candidate, lotiglipron, due to elevated levels of a type of liver enzymes seen in a study.\nFollowing these setbacks, Pfizer has decided to focus on developing its other obesity candidates, which are either in early-stage or mid-stage development. One such candidate is PF-07976016, an investigational GIP receptor being evaluated in a mid-stage study for obesity.\nYear to date, shares of Pfizer have lost nearly 17% compared with the industry’s 7% decline.\nImage Source: Zacks Investment Research\nPost Pfizer’s announcement, shares of Eli Lilly LLY and Novo Nordisk NVO rose 3% and 2%, respectively, on Monday. Both companies dominate the diabetes and obesity market on the back of the tremendous success of their GLP-1 products. Lilly markets its dual GIP and GLP-1 RA, tirzepatide, as Mounjaro for type II diabetes and as Zepbound for obesity. Novo markets its semaglutide drugs as Ozempic pre-filled pen and Rybelsus oral tablet for type II diabetes and as Wegovy injection for weight management.\nThe obesity market has garnered much interest lately. Per a research conducted by Goldman Sachs, the obesity market in the United States is expected to reach $100 billion by 2030. This is also evident from the fact that LLY and NVO have not only optimized their production capacities but are also developing multiple other novel obesity candidates at a rapid pace.\nThe implication of Pfizer’s setback is clear for both Eli Lilly and Novo Nordisk — the immediate removal of a potential rival from the highly lucrative GLP-1 market. The latest setback puts Pfizer back at least a couple of years from entering the obesity space.\nA company that benefited from Pfizer’s announcement was Viking Therapeutics VKTX, which jumped nearly 11% on Monday. VKTX is currently developing its obesity drug candidate VK2735 in both oral and subcutaneous (SC) formulations. Viking Therapeutics is one of the few companies in this space that has made rapid and encouraging progress with its obesity drug.\nLast month, Viking announced that it has completed enrollment in a mid-stage study evaluating oral VK2735, just a couple of months after the study initiation was announced in January. This swift enrollment underscores the growing interest in VK2735 and reflects the rising momentum in the weight-loss drug market, led by the success of Lilly’s Zepbound and Novo’s Wegovy. A late-stage study on the SC version is expected to start before the end of this quarter.\nPfizer Inc. price | Pfizer Inc. Quote\nPfizer currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nPfizer Inc. (PFE) : Free Stock Analysis Report\nNovo Nordisk A/S (NVO) : Free Stock Analysis Report\nEli Lilly and Company (LLY) : Free Stock Analysis Report\nViking Therapeutics, Inc. (VKTX) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nOn Tuesday, investors continued to snap up shares of big pharmaceutical company Pfizer (NYSE: PFE).  On Tuesday, Pfizer's stock closed the day 1.5% higher, providing a pleasant contrast to the S&P 500 index's 0.2% dip.  Tuesday was a relatively uneventful news day for Pfizer, especially following the pharmaceutical giant's disclosure on Monday that it halted the development of its investigational weight loss drug danuglipron.\nThanks to President Donald Trump's protectionist policies, lingering inflation, and sticky interest rates, the benchmark S&P 500 has lost 7.6% of its value year to date at the time of this writing.  Amid the market turbulence, two space technology pioneers, Rocket Lab USA (NASDAQ: RKLB) and Intuitive Machines (NASDAQ: LUNR), have emerged as particularly compelling candidates for growth-focused portfolios.  Both companies have seen their shares decline precipitously this year, with Rocket Lab down 25% and Intuitive Machines plummeting 57% since the start of the year, creating potentially attractive entry points for investors with longer time horizons and appropriate risk tolerance.\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nWestern Digital (WDC) closed at $35.93 in the latest trading session, marking a +0.31% move from the prior day.\nWe came across a bullish thesis on UnitedHealth Group Incorporated (UNH) on Substack by Oguz Erkan. In this article, we will summarize the bulls’ thesis on UNH. UnitedHealth Group Incorporated (UNH)’s share was trading at $587.06 as of April 14th. UNH’s trailing and forward P/E were 37.85 and 19.72 respectively according to Yahoo Finance. UnitedHealth Group stands […]\nAmerican Water Works, Exelon, CenterPoint Energy, The Progressive and Brown & Brown are included in this Analyst Blog.\nJ&J beats first-quarter earnings and sales estimates. It raises sales guidance for 2025 to reflect the addition of Caplyta from the Intra-Cellular acquisition.\nWe recently published a list of the 10 High Growth Forever Dividend Stocks to Invest In. In this article, we are going to take a look at where Eli Lilly and Company (NYSE:LLY) stands against other high growth forever dividend stocks. Dividend stocks have trailed the broader market over the past two years, largely due to […]\nUS benchmark equity indexes closed lower Tuesday as traders tracked the latest corporate earnings an\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 22-53_Why Pfizer Stock Topped the Market on Tuesday",
    "date": "",
    "content": "Title: Why Pfizer Stock Topped the Market on Tuesday\nDate: 2025-04-15 22:53\nURL: https://www.fool.com/investing/2025/04/15/why-pfizer-stock-topped-the-market-on-tuesday/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1c016625-873e-4d82-8ff3-b3b99d7cd683&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nOn Tuesday, investors continued to snap up shares of big pharmaceutical company Pfizer (PFE -1.74%). Somewhat counterintuitively, this week's rise came after the company announced it was ending the development of a drug in a very hot product category. On Tuesday, Pfizer's stock closed the day 1.5% higher, providing a pleasant contrast to the S&P 500 index's 0.2% dip.\nTuesday was a relatively uneventful news day for Pfizer, especially following the pharmaceutical giant's disclosure on Monday that it halted the development of its investigational weight loss drug danuglipron. This occurred after a patient suffered a liver injury during the testing of the medication. \nYet Pfizer watchers are well aware that the large and well-resourced company doesn't only have one pony in the race. It has a different treatment in its pipeline, PF-07976016, that's based on a different mechanism and is currently undergoing phase 2 clinical trials.\nOne analyst tracking the pharmaceutical stock didn't hesitate to point in a new research note published Tuesday morning that the company still has options. Bernstein SocGen's Courtney Breen wrote in her analysis, according to reports, that Pfizer will likely turn to its tried-and-true strategy of building up its pipeline with mergers and acquisitions, and/or licensing of products developed by peers. \nInvestors can be quite a hardy bunch, and collectively they seem to be shrugging off what many would consider a major setback in the lab with danuglipron. That being said, it is a setback, and Pfizer hasn't been a pharmaceutical pace-setter since the days of its Comirnaty vaccine during the coronavirus pandemic. The market is likely to start getting more impatient with the company soon.\n\n \n\nBefore you buy stock in Pfizer, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Pfizer wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nEric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Pfizer. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 20-15_ACIP Votes to Expand Recommendation for Pfizer’s RSV Vaccine ABRYSVO® to Include Adults Aged 50 to 5",
    "date": "",
    "content": "Title: ACIP Votes to Expand Recommendation for Pfizer’s RSV Vaccine ABRYSVO® to Include Adults Aged 50 to 5\nDate: 2025-04-16 20:15\nURL: https://finance.yahoo.com/news/acip-votes-expand-recommendation-pfizer-201500828.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nVote expands existing recommendation, which was for all adults aged 75 and older and high-risk adults aged 60 to 74\nNEW YORK, April 16, 2025--(BUSINESS WIRE)--Pfizer Inc. (NYSE: PFE) announced today that the U.S. Centers for Disease Control and Prevention’s (CDC) Advisory Committee on Immunization Practices (ACIP) voted to expand its recommendation for the use of respiratory syncytial virus (RSV) vaccines approved for adults 50-59 years of age at increased risk of RSV-associated lower respiratory tract disease (LRTD). This includes ABRYSVO® (Respiratory Syncytial Virus Vaccine), which in October 2024, the U.S. Food and Drug Administration approved for the prevention of RSV-associated LRTD in adults aged 18 to 59 at increased risk of severe disease.\nAccording to the CDC, between 15,000 - 20,000 RSV-associated hospitalizations occur annually in U.S. adults aged 50 - 59 years.1 The risk of hospitalization is highest among those adults with one or more underlying medical conditions such as obesity, cardiovascular disease, diabetes, chronic obstructive pulmonary disorder (COPD), asthma, and other chronic or immunocompromising conditions.1 With respect to ABRYSVO, ACIP stated:\nACIP recommends adults 50–59 years of age who are at increased risk of severe RSV disease receive a single dose of RSV vaccine.\n\"With its vote to expand adult RSV vaccination recommendations, ACIP has taken an important step toward protecting individuals aged 50 to 59 who have underlying medical conditions that increase their risk for severe RSV illness,\" said Alejandro Cane, Vice President, Vaccines and Antivirals U.S. Medical Lead, Pfizer. \"We are proud that ABRYSVO has the broadest indication among RSV vaccines, covering older adults, adults 18 and older at heightened risk of severe disease, and pregnant women to help protect infants.\"\nThe updated ACIP recommendation, which lowers the recommended age for RSV vaccination from 60 to 50 for high-risk adults, is pending final approval by the director of the CDC and the Department of Health and Human Services.\nABOUT RSVRespiratory syncytial virus (RSV) is a contagious virus and a common cause of respiratory illness.2 The virus can affect the lungs and breathing passages of an infected individual, potentially causing severe illness or death.3,4 Chronic cardiovascular disease, chronic lung disease, moderate or severe immune compromise, diabetes with complications, and severe obesity are among the conditions that increase an individual’s risk for severe RSV.5 There are two major subgroups of RSV: RSV-A and RSV-B. Both subgroups cause disease and can co-circulate or alternate predominance from season to season.\nABOUT ABRYSVOPfizer currently is the only company with an RSV vaccine to help protect adults aged 60 and older, and adults 18 and older at increased risk of lower respiratory tract disease caused by RSV (RSV-LRTD), as well as infants through maternal immunization. ABRYSVO is an unadjuvanted, bivalent vaccine that was designed to provide broad protection against RSV-LRTD, regardless of the virus subgroup. In the prefusion state, the RSV fusion protein (F) is a major target of neutralizing antibodies, serving as the basis of Pfizer’s RSV vaccine. Variations in the F protein sequence among RSV-A and RSV-B subgroups are clustered in a key antigenic site, a target for potent neutralizing antibodies.\nIn May 2023, the FDA approved ABRYSVO for the prevention of LRTD caused by RSV in individuals 60 years of age or older. In June 2024, the Advisory Committee on Immunization Practices (ACIP) voted to update its recommendation of RSV vaccines for use in adults aged ≥75 years and adults age 60-74 years who are increased risk for severe RSV disease. In August 2023, the FDA approved ABRYSVO for the prevention of LRTD and severe LRTD caused by RSV in infants from birth up to 6 months of age by active immunization of pregnant individuals at 32 through 36 weeks gestational age. This was followed in September 2023 with ACIP’s recommendation for maternal immunization to help protect newborns from RSV seasonally where the vaccine should be administered from September through January in most of the continental United States.\nAlso in August 2023, Pfizer announced that the European Commission granted marketing authorization for ABRYSVO for both older adults and maternal immunization to help protect infants, and in March 2025 announced the amended marketing authorization to extend the indication to include a broader adult population. Additionally, ABRYSVO has received approvals for both indications in multiple countries worldwide.\nINDICATIONS FOR ABRYSVO\nABRYSVO® is a vaccine indicated in the U.S. for:\nthe prevention of lower respiratory tract disease (LRTD) caused by respiratory syncytial virus (RSV) in people 60 years of age and older\nthe prevention of LRTD caused by RSV in people 18 through 59 years of age who are at increased risk for LRTD caused by RSV\npregnant individuals at 32 through 36 weeks gestational age for the prevention of LRTD and severe LRTD caused by RSV in infants from birth through 6 months of age\nIMPORTANT SAFETY INFORMATION FOR ABRYSVO\nABRYSVO should not be given to anyone with a history of severe allergic reaction (e.g., anaphylaxis) to any of its components\nAn increased risk of Guillain-Barré syndrome (severe muscle weakness) was observed after vaccination with ABRYSVO\nFor pregnant individuals: to avoid the potential risk of preterm birth, ABRYSVO should be given during 32 through 36 weeks gestational age\nFainting can happen after getting injectable vaccines, including ABRYSVO. Precautions should be taken to avoid falling and injury during fainting\nAdults with weakened immune systems, including those receiving medicines that suppress the immune system, may have a reduced immune response to ABRYSVO\nVaccination with ABRYSVO may not protect all people\nIn adults 60 years of age and older, the most common side effects (≥10%) were fatigue, headache, pain at the injection site, and muscle pain\nIn adults 18 through 59 years of age, the most common side effects (≥10%) were pain at the injection site, muscle pain, joint pain and nausea\nIn pregnant individuals, the most common side effects (≥10%) were pain at the injection site, headache, muscle pain, and nausea\nIn clinical trials where ABRYSVO was compared to placebo, infants born to pregnant individuals experienced low birth weight (5.1% ABRYSVO versus 4.4% placebo) and jaundice (7.2% ABRYSVO versus 6.7% placebo)\nView the full ABRYSVO Prescribing Information.\nAbout Pfizer: Breakthroughs That Change Patients’ LivesAt Pfizer, we apply science and our global resources to bring therapies to people that extend and significantly improve their lives. We strive to set the standard for quality, safety and value in the discovery, development and manufacture of health care products, including innovative medicines and vaccines. Every day, Pfizer colleagues work across developed and emerging markets to advance wellness, prevention, treatments and cures that challenge the most feared diseases of our time. Consistent with our responsibility as one of the world's premier innovative biopharmaceutical companies, we collaborate with health care providers, governments and local communities to support and expand access to reliable, affordable health care around the world. For 175 years, we have worked to make a difference for all who rely on us. We routinely post information that may be important to investors on our website at www.Pfizer.com. In addition, to learn more, please visit us on www.Pfizer.com and follow us on X at @Pfizer and @Pfizer News, LinkedIn, YouTube and like us on Facebook at Facebook.com/Pfizer.\nDISCLOSURE NOTICE:The information contained in this release is as of April 16, 2025. Pfizer assumes no obligation to update forward-looking statements contained in this release as the result of new information or future events or developments.\nThis release contains forward-looking information about ABRYSVO, including its potential benefits and a vote by ACIP to expand its recommendation to include adults 50-59 years of age at increased risk of RSV-associated lower respiratory tract disease, that involves substantial risks and uncertainties that could cause actual results to differ materially from those expressed or implied by such statements. Risks and uncertainties include, among other things, uncertainties regarding the commercial success of ABRYSVO; the uncertainties inherent in research and development, including the ability to meet anticipated clinical endpoints, commencement and/or completion dates for our clinical trials, regulatory submission dates, regulatory approval dates and/or launch dates, as well as the possibility of unfavorable new clinical data and further analyses of existing clinical data; risks associated with interim data; the risk that clinical trial data are subject to differing interpretations and assessments by regulatory authorities; whether regulatory authorities will be satisfied with the design of and results from our clinical studies; whether and when biologic license applications may be filed in particular jurisdictions for ABRYSVO for any potential indications; whether and when any applications that may be pending or filed for ABRYSVO may be approved by regulatory authorities, which will depend on myriad factors, including making a determination as to whether the product's benefits outweigh its known risks and determination of the product's efficacy and, if approved, whether ABRYSVO for any such indications will be commercially successful; intellectual property and other litigation; decisions by regulatory authorities impacting labeling, manufacturing processes, safety and/or other matters that could affect the availability or commercial potential of ABRYSVO; uncertainties regarding the ability to obtain or maintain recommendations from vaccine advisory or technical committees and other public health authorities regarding ABRYSVO and uncertainties regarding the commercial impact of any such recommendations; uncertainties regarding the impact of COVID-19 on our business, operations and financial results; and competitive developments.\nA further description of risks and uncertainties can be found in Pfizer’s Annual Report on Form 10-K for the fiscal year ended December 31, 2024, and in its subsequent reports on Form 10-Q, including in the sections thereof captioned \"Risk Factors\" and \"Forward-Looking Information and Factors That May Affect Future Results\", as well as in its subsequent reports on Form 8-K, all of which are filed with the U.S. Securities and Exchange Commission and available at www.sec.gov and www.pfizer.com.\n____________________\n1 U.S. Centers for Disease Control and Prevention. \"Evidence to Recommendations Framework (EtR): RSV Vaccination in Adults Aged 50–59 years\" https://www.cdc.gov/acip/downloads/slides-2025-04-15-16/06-Melgar-Surie-adult-rsv-508.pdf Presented April 16, 2025. Accessed April 2025.2 World Health Organization. Respiratory Syncytial Virus (RSV) disease. https://www.who.int/teams/health-product-policy-and-standards/standards-and-specifications/norms-and-standards/vaccine-standardization/respiratory-syncytial-virus-disease. Accessed February 2025.3 U.S. Centers for Disease Control and Prevention. How RSV Spreads. https://www.cdc.gov/rsv/causes/index.html. Updated August 30, 2024. Accessed February 2025.4 U.S. Centers for Disease Control and Prevention. RSV in Older Adults. https://www.cdc.gov/rsv/older-adults/index.html. Updated August 30, 2024. Accessed February 2025.5 U.S. Centers for Disease Control and Prevention. Clinical Overview of RSV. https://www.cdc.gov/rsv/hcp/clinical-overview/index.html. Updated August 30, 2024. Accessed February 2025.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250416881933/en/\nContacts\nMedia Contact:PfizerMediaRelations@Pfizer.com +1 (212) 733-1226Investor Contact:IR@Pfizer.com +1 (212) 733-4848\nNextEra (NEE) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.\nLuxury electric vehicle (EV) maker Lucid Group (NASDAQ: LCID) launched its fully electric Gravity SUV to the public last year and began accepting registrations from interested customers.  A company executive also announced that plans to launch a new, midsize SUV next year are on track.  Maybe more important for Lucid investors are plans to launch a new, lower-priced, midsize SUV next year.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]