[
  {
    "title": "2025-04-16 20-24_Nvidia's $5.5B charge_ 'Nobody' should be 'surprised'",
    "date": "",
    "content": "Title: Nvidia's $5.5B charge_ 'Nobody' should be 'surprised'\nDate: 2025-04-16 20:24\nURL: https://finance.yahoo.com/video/nvidias-5-5b-charge-nobody-202431372.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNvidia (NVDA) and Advanced Micro Devices (AMD) plunge after comments from Federal Reserve Chair Jerome Powell deepened losses sparked by costs associated with new US restrictions on exports to China.\nFuturum CEO Daniel Newman sits down with Josh Lipton, joined by Defiance ETFs CEO and chief investment officer Sylvia Jablonski, to discuss the latest chip news and what it means for investors.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\nNvidia sinking. So after the chip maker disclosed that it would take a $5.5 billion dollar hit from the US government's surprise new controls on its semiconductor exports to China. For more on the latest, let's welcome now Daniel Newman, Futurum CEO. Daniel, it is great to see you here on set. Appreciate it from Texas. Um, you know, before J. Powell, frankly, this was the story of the day. It was chips, it was Nvidia. Nvidia is down here, Dan. It's not about 10%. It's getting clobbered in today's trade. I guess two, two questions to start. One, Dan, were you surprised by that news when you saw those headlines? And two, do you think down 10%, is that move justified in your opinion?\nYeah, first of all, nobody should have been surprised by this move. Really the administration's been giving the signal that it was going to clamp down. Now, what was interesting is this week, there was a bit of gyration because they cut this deal, they announced 500 billion dollars of AI supercomputers being built here in the United States. And then a day later, he pulls back on this new export licensing requirement.\nThat that, you bring that, Dan. That is an interesting point because there were some folks who thought Jensen Wong was going to be kind of shielded from this. Right?\nThey made a deal. I had a few reporters actually hit me up, do you think there was some tip for tat going on. And first of all, I think Trump needs to show, President Trump needs to show that there is no tip for tat. So whether it's, you know, Tim Cook bringing more manufacturing here, whether it's TSMC coming here. But I actually think on the other side of this, and maybe we come back to this, is that I actually think creating some certainty with the, with the community, the business community, about what type of benefit they can expect by onshoring and bringing manufacturing back here. I think that would be a great start. Having said that, national security, economic security, and AI are tightly correlated. Us giving the chips to China, whether it's the tuned down chips or the best chips coming through intermediaries, which they shouldn't be getting. This is something that's giving an advantaging China. There's a lot of people out there that are like, oh, well, this is going to only push their resolve. Do you think China is waiting because we're sending Nvidia chips, they're not investing in Huawei and building their own chips? You can be absolutely certain that they are. This war, this trade war, is largely being fought on the grounds of long-term economic domination. Long-term economic domination will only be had if we control the technology trade. Nvidia is at the forefront of that trade.\nAnd what do you think of from an investor standpoint? Here you have Nvidia falling yet again, 8 to 10%. You know, look what happened over the last couple days. It had recovered from its lows, right? And a lot of investors who got in short term experienced that bounce. Where, where do you think that looks like this week?\nYeah. I, I look at that line of people around the corner at $150 that just couldn't wait to buy. And you go, what is really changed? Well, first of all, you've got GPUs melting over at, at X and at OpenAI. There's so much demand there. Could Nvidia pivot some of its capacity, not focus so much on building specialized products for China, and make sure we meet all the capacity and demand that's out there for companies that are in the US that are trying to build? You've got $325 billion of CAPEX. And it's been reiterated. So whether it's been Sunder Pichai, whether it's been Satya Nadella, they're all planning to spend. And I genuinely believe, Sylvia, that the companies with, you know, the big operating leverage are going to look at this pullback as the moment to build AI infrastructure out. Because when we come out of this, and we will come out of this, there will be deals made. Calling that on the record right now. It may be a tough couple of months. When deals are made, we will see the economy accelerate. And those companies want to build the future and have that AI infrastructure in place. So the Googles and the Microsofts and the Amazons, they're going to buy Nvidia. Um, and one other thing, if I, if I may, I find it very interesting that everybody thinks that China and their push to build Huawei is going to be so successful. When AMD came out with a competitive product, no one believed they could build the software. Broadcom's making chips for the hyperscalers and everyone said, well, that's great, but they don't have CUDA. So it's not going to work as well. But suddenly, everybody believes that China and Huawei is going to build the CUDA competitive product that's going to undo Nvidia? I believe in China, I believe in their resolve. I don't believe that they have as much competition or much competitive capability today as people are suggesting.\nUNI Europa argues that American digital giants like Amazon benefit from unfair economic advantages in the world’s largest single market and should be dealt with accordingly.\nSNOW and MDB are well-known players in the database management system space. Which one is a better investment option?\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nU.S. markets fell sharply Wednesday, with chip stocks leading the retreat as U.S.-China trade tensions spooked investors. The tech-heavy Nasdaq closed down 3.1%, the S&P 500 lost 2.2%, and the Dow Jones Industrial average fell 700 points, or 1.7%. Losses rippled across sectors, dragging the Russell 2000 down 1.4%.\nDavid Kostin, chief US equity strategist at Goldman Sachs, discusses expectations for US economic growth, the lack of liquidity in markets, and the outlook for earnings growth. He speaks on \"Bloomberg Open Interest.\"\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nNextEra (NEE) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.\nTrump wants to bring tech manufacturing to the US. There's little chance it will happen.\nWhales dumped more than $370 million in XRP this month, causing price drops and raising concerns among traders as selling pressure weighs on market sentiment.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-25_Nvidia drags the Nasdaq down 3% and the Dow drops 700 points as stocks tumble on trade war woes",
    "date": "",
    "content": "Title: Nvidia drags the Nasdaq down 3% and the Dow drops 700 points as stocks tumble on trade war woes\nDate: 2025-04-16 20:25\nURL: https://finance.yahoo.com/news/nasdaq-tumbles-nvidia-takes-5-123027626.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nU.S. markets fell sharply Wednesday, with chip stocks leading the retreat as U.S.-China trade tensions spooked investors. The tech-heavy Nasdaq closed down 3.1%, the S&P 500 lost 2.2%, and the Dow Jones Industrial average fell 700 points, or 1.7%. Losses rippled across sectors, dragging the Russell 2000 down 1.4%.\nNvidia stock plunged 6.9% after the company disclosed a $5.5 billion charge linked to fresh U.S. export restrictions on its H20 AI chips — once seen as a workaround for earlier bans. AMD (AMD) stock fell 7.4%, while chip equipment giant ASML dropped 7% after it missed first-quarter revenue estimates and warned that escalating tariffs could cloud the global outlook through 2026.\nMarkets retreated further as Federal Reserve Chair Jerome Powell warned that President Donald Trump’s tariffs were “highly likely” to fuel inflation, and suggested the central bank will wait to gaugetheir effect before lowering interest rates.\n“Tariffs are highly likely to generate at least a temporary rise in inflation,” Powell said during a speech at the Economic Club of Chicago. “The inflationary effects could also be more persistent. Avoiding that outcome will depend on the size of the effects, on how long it takes for them to pass through fully to prices, and, ultimately, on keeping longer-term inflation expectations well anchored.”\n“For the time being,” Powell said, “we are well positioned to wait for greater clarity before considering any adjustments to our policy stance.”\nStill, there were bright spots. Abbott Labs (ABT) beat earnings expectations with adjusted EPS of $1.09 and double-digit organic growth in its medical device division, including a 20% jump in diabetes-related products. Prologis (PLD), the world’s largest industrial REIT, met forecasts with $1.27 in core FFO and reaffirmed guidance — but noted rising customer caution.\nMeanwhile, U.S. retail sales surged 1.4% in March, the biggest monthly gain since January 2023. Analysts said shoppers likely pulled purchases forward to avoid tariff-driven price hikes: Think customers loading up on TVs and T-shirts at Costco (COST) ahead of potential price pain.\nThe CNN (WBD) Fear & Greed Index remains in “extreme fear” territory — a mood that’s proven hard to shake since Trump’s tariff barrage earlier this month. It should come as no surprise: This is a market increasingly driven by policy whiplash, cheerleading soundbites, and dropped hints of trade negotiations. Mixed signals, selective leaks, and sudden reversals — often via social media or offhand remarks — are proving as influential as official announcements.\nAnd it’s not just the policy that’s unpredictable. The choreography is, too.\nThe most closely watched story Wednesday centered on Nvidia (NVDA), the third-largest U.S. company by market capitalization, and its disclosure of the $5.5 billion charge tied to new U.S. government restrictions on exporting its AI chips to China. The Biden administration originally designed export controls to curtail China’s access to advanced AI chips — but under Trump, the policy has sharpened.\nAlso in chips news, semiconductor equipment giant ASML (ASML) reported first-quarter sales of €7.7 billion, or about $8.7 billion— below analyst expectations — and flagged “greater uncertainty” ahead due to tariffs. ASML, which makes the machines essential to high-end chip manufacturing, has seen its stock fall by 28% over the last year despite the AI boom.\nElsewhere, China posted 5.4% GDP growth for the first quarter, matching the prior quarter. Export activity surged as companies rushed to ship goods ahead of expected new U.S. tariffs. Beijing also named a new top trade negotiator.\nStill, market watchers seemed to see little clarity ahead.\nFor the latest news, Facebook, Twitter and Instagram.\nBarclays analyst Dan Levy downgraded his view of the sector to “Negative” and cut his rating for General Motors to Hold from Buy.\nStocks continued to slide heading into the final hour of trading. The Dow dropped 890 points, or 2.2.% The S&P 500 fell 3.1%. Thee Nasdaq Composite slid 4.4%. Wall Street was already selling tech stocks after Nvidia disclosed sales of its H20 AI accelerators to China will require a license from the U.\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Amazon.com Inc (NASDAQ:AMZN) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to […]\nThe stock market doesn't go up all the time.  With the S&P 500 index down by 8% year to date, President Donald Trump's tariff crisis could be an opportunity to buy quality stocks for cheap.  Let's explore why Amazon (NASDAQ: AMZN) and Super Micro (NASDAQ: SMCI) could make great bets.\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks […]\nBin Zhang is in the business of fun, but his job has become less so because of U.S. President Donald Trump.  Zhang, 36, whose company, iFun, has customers all over the world and gets orders ranging from $50,000 to $500,000 for his products - everything that's needed to set up an arcade, play area for kids in a shopping mall or for a trampoline park.  Until recently, a fifth of sales from Zhang's company, iFun, which has a factory in China’s southern manufacturing hub of Guangzhou, went to the United States.\nU.S. stock futures traded lower Wednesday, but pared some earlier losses. In recent market action:  Futures tied to the Nasdaq-100 fell the most, sinking 1.7%, as Nvidia and other chip stocks traded lower.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-26_Stocks resume sell-off as tariff costs hit tech and Powell delivers starkest warning yet on Trump's ",
    "date": "",
    "content": "Title: Stocks resume sell-off as tariff costs hit tech and Powell delivers starkest warning yet on Trump's \nDate: 2025-04-16 20:26\nURL: https://finance.yahoo.com/news/stocks-resume-sell-off-as-tariff-costs-hit-tech-and-powell-delivers-starkest-warning-yet-on-trumps-trade-war-202622781.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUS stocks tumbled on Wednesday as investors were reminded of the costs President Trump's tariffs will have for major companies and the challenges these policies may present for the broader US economy.\nThe market sell-off intensified in the final hours of trading as Federal Reserve Chair Jerome Powell delivered perhaps his starkest warning yet on the potentially stagflationary effects of Trump's tariff policies.\nPowell warned during a speech in Chicago of the \"challenging\" impacts of the uncertainty that has hit the economy, adding the central bank will \"wait for greater clarity\" before considering any interest rate adjustments.\nThese remarks amped up the potential negative impacts of sweeping tariffs and took away the likelihood the Fed would be quick to cut rates should the economy slow.\nSpecifically, Powell warned tariffs \"are highly likely to generate at least a temporary rise in inflation,\" adding, \"The inflationary effects could also be more persistent.\"\nRead more: What Trump's tariffs mean for the economy and your wallet\nThe benchmark S&P 500 (^GSPC) dropped about 2.2% while the Dow Jones Industrial Average (^DJI) shed roughly 700 points, or around 1.7%. The tech-heavy Nasdaq Composite (^IXIC) fell over 3% as the new chip provisions weighed on the tech sector.\nWednesday's losses upset what had become a more stable environment for financial markets after the initial shock of \"Liberation Day\" sent markets reeling earlier this month.\nThese remarks came in the middle of what was already shaping up to be a negative day for US stocks, led by the tech sector.\nAI chip leader Nvidia (NVDA) revealed late Tuesday night that new restrictions from the US government on its chip exports to China would result in $5.5 billion in charges. AMD (AMD) made similar announcement, saying the new provisions could cost the chipmaker up to $800 million.\nNvidia and AMD both fell about 7% on the day.\n\"What this comes down to is this continued level of uncertainty in the markets,\" Sylvia Jablonski, Defiance ETFs CEO and CIO, told Yahoo Finance.\nPolicy uncertainty has been at the forefront of the recent market sell-off. Economists broadly expect these policies to boost inflation and slow economic growth.\nTo some, that combination leads to a clear result.\n\"Recession odds are climbing even further as Powell pushes back the timing of cuts,\" Renaissance Macro head of economics Neil Dutta wrote in a note on Wednesday.\nDuring the question-and-answer session at the Economic Club of Chicago, Powell was asked directly whether the Federal Reserve would intervene if the stock market continued to plummet.\n\"No,\" Powell said, denying the theory that there is a so-called Fed put, or level of a stock market sell-off where the Fed would cut interest rates to calm markets.\nPowell said markets are currently attempting to asses a highly uncertain environment, and that leads to volatility.\n\"Markets are doing what they're supposed to do,\" Powell said. \"They're orderly and they're functioning just about as you would expect them to function.\"\nOn Wednesday, that market function featured shifting investor views on Nvidia amid the new costly provisions laid on by the Trump administration.\nInteractive Brokers chief strategist Steve Sosnick told Yahoo Finance that the slide in Nvidia shares was \"emblematic\" of the issues driving the stock market lower over the past month. As earnings season progresses in the weeks ahead, it's unlikely Nvidia will be the only company to warn about higher costs.\n\"This is uncertainty,\" Sosnick said. \"And uncertainty is a killer for a company, for any company.\"\nJosh Schafer is a reporter for Yahoo Finance. Follow him on X @_joshschafer.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance\nFederal Reserve Chairman Jerome Powell said Wednesday the central bank will 'wait for greater clarity' before considering any changes to interest rates as he expects President Trump’s tariffs to generate 'higher inflation and slower growth.'\nStalling dealmaking has dragged revenues down, and it's making some Trump-backers reconsider.\nCutting off access to his medication could have dire consequences for this San Francisco man.\n(Bloomberg) -- California Governor Gavin Newsom sued to halt Donald Trump’s tariffs, setting up a high-stakes legal challenge to the president’s landmark effort to overhaul global trade. Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe state is\nThe Trump administration plans to eliminate the IRS' Direct File program, an electronic system for filing tax returns directly to the agency for free, according to two people familiar with the decision.  The program developed during Joe Biden's presidency was credited by users with making tax filing easy, fast and economical.  The program had been in limbo since the start of the Trump administration as Elon Musk and the Department of Government Efficiency have slashed their way through the federal government.\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nThe S&P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-30_Taiwan Semiconductor Earnings Are Coming. Guidance Is Key.",
    "date": "",
    "content": "Title: Taiwan Semiconductor Earnings Are Coming. Guidance Is Key.\nDate: 2025-04-16 20:30\nURL: https://finance.yahoo.com/m/6309138d-b227-392e-a8cb-c4ecee3bf20c/taiwan-semiconductor-earnings.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nTSMC is a crucial player in the artificial-intelligence chip market, which has been upended by tariff turmoil.\nIn recent years, certain GPU makers like Nvidia have seen their share prices soar.  Intel's management team says it has a plan to reinvigorate growth.  A stock split typically occurs when a company's share price is so high that either investors errantly assume it's \"expensive\" or limit their holdings because they can't afford to buy another whole share.\nExpect Nvidia revenues to drop in future quarters, analysts wrote after the administration blocked the chipmaker from selling its key chip to China.\nASML reported weaker-than-expected orders for its chip-making machines in the first quarter and warned that President Trump’s tariff policies were creating uncertainty for the industry.  The Dutch company said Wednesday that while it still expects to grow this year and next, “recent tariff announcements have increased uncertainty” and that “the situation will remain dynamic for a while.”  ASML shares closed 5.2% lower in Amsterdam, contributing to a wider selloff in the global chips sector.\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nOne of the rare Wall Street analysts who is bearish on Meta Platforms further cut his price target for the stock, saying the Facebook parent company is \"starting to look vulnerable to a growth slowdown.\"  BNP Paribas Exane analyst Stefan Slowinksi cut his price target for Meta stock to 448 from a previous 505 in a client note late Tuesday.  Slowinski initiated coverage of Meta with the sell-equivalent call nearly 12 months ago.\nThe S&P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries.\nMiddle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]\nNvidia was rising Tuesday after President Donald Trump said the chip maker's U.S. infrastructure permits would be expedited.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-33_Nasdaq Tumbles 3.1% as Nvidia Drives Tech Sell-Off; Markets Assess Fed Chair Remarks",
    "date": "",
    "content": "Title: Nasdaq Tumbles 3.1% as Nvidia Drives Tech Sell-Off; Markets Assess Fed Chair Remarks\nDate: 2025-04-16 20:33\nURL: https://finance.yahoo.com/news/nasdaq-tumbles-3-1-nvidia-203303853.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUS benchmark equity indexes tumbled Wednesday amid a sell-off in Nvidia (NVDA) shares and as Federal\nRetail sales in the US rose in line with Wall Street's expectations in March led by the motor vehicl\nGlobal trade volume is expected to decline this year as new tariffs fuel uncertainty, with \"severe\"\nMortgage applications in the US dropped last week as higher rates weighed on refinancing and purchas\nUS homebuilder confidence unexpectedly picked up in April, though sentiment remained subdued amid he\nFederal Reserve Chair Jerome Powell indicated in remarks Wednesday that central bankers are focusing on inflation concerns when evaluating the economic risks of President Donald Trump's tariffs.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nWe recently published a list of Jim Cramer is Bullish on These 10 Stocks. In this article, we are going to take a look at where Verizon Communications Inc. (NYSE:VZ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host, Jim Cramer, shared his perspective on how investors might approach the stock […]\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe five-year note led\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-36_Nvidia stock plunges 7% as a U.S. ban on China AI exports means a $5.5 billion hit",
    "date": "",
    "content": "Title: Nvidia stock plunges 7% as a U.S. ban on China AI exports means a $5.5 billion hit\nDate: 2025-04-16 20:36\nURL: https://finance.yahoo.com/news/nvidia-stock-slumps-6-u-142600357.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe U.S.-China tech war just claimed another high-profile casualty.\nNvidia (NVDA), America’s third-largest company by market cap, said Wednesday it will take a $5.5 billion charge after the U.S. government moved to block exports of its H20 AI chips to China — citing national security risks tied to their potential use.\nThe H20 had been engineered to comply with earlier Biden-era restrictions and had become a key product for Nvidia in China, one that was quickly gaining traction. But the sudden reversal by the Trump administration, after months of policy limbo and back-channel talks, signals another hard turn in trade policy — and lays bare the high-stakes game playing out among Silicon Valley, Washington, and Beijing.\nLet’s rewind: On April 9, Nvidia CEO Jensen Huang attended a $1-million-a-plate Mar-a-Lago dinner with President Trump, where AI exports were reportedly a topic of conversation. Proceeds from the dinner went to MAGA Inc., a Trump-aligned super PAC that can raise unlimited funds but isn’t allowed to coordinate directly with the campaign. Five days later, on April 14, the U.S. informed Nvidia it would need a license to export H20 chips abroad. On April 16, Nvidia announced the multibillion-dollar charge — and markets flinched.\nMeanwhile, ASML (ASML), the Dutch semiconductor equipment powerhouse, reported first-quarter sales of €7.7 billion — slightly below forecasts — and flagged “greater uncertainty” due to trade tensions. ASML makes the machines essential for cutting-edge chip production, giving it enormous influence over global chip supply. The company warned that new tariffs and tech restrictions could weigh on its outlook for 2025 and 2026.\nInvestors didn’t like what they saw.\nNvidia stock slid 6% at the market open Wednesday and retreated further in the afternoon before closing down about 7%, with AMD (AMD) and other chipmakers falling in tandem. The broader Nasdaq dropped over 3%, as Wall Street reassessed what a prolonged, escalating tech standoff could mean for supply chains, AI development, and the semiconductor industry.\nIn a Wednesday note, Jefferies (JEF) analysts said the H20 ban was expected — but the size of Nvidia’s write-down was not. It signals outsized demand from Chinese buyers, who had reportedly placed $16 billion in H20 orders this year. Still, Jefferies says China has likely stockpiled enough GPUs for ongoing AI training and will increasingly lean on local chips for inferencing tasks.\nMarkets may have priced in some pain, but they haven’t seen the last punch.\nFor the latest news, Facebook, Twitter and Instagram.\nThe chip maker will take a $5.5 billion charge in the current quarter for H20 inventory and canceled sales.\nAbbott Labs posts first-quarter sales that missed analysts’ estimates but rose 4% from a year earlier.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nUnited Airlines offered two sets of profit guidance, depending on whether the U.S. enters a recession.  \"The company's outlook is dependent on the macro environment, which the company believes is impossible to predict this year with any degree of confidence,\" the carrier said.  United shares rose roughly 4% Wednesday morning after the company reported better-than-expected quarterly earnings.\nAbbott Laboratories forecasts an impact of \"a few hundred million dollars\" this year from Trump administration tariffs, Chief Executive Robert Ford told analysts Wednesday.  The healthcare company sees the costs starting in the third quarter.  Ford told analysts it is too early to simply double the 2025 estimate for how tariffs might affect Abbott in future years, but the company can cover them in the near term.\nExport restrictions placed on certain chips manufactured by Nvidia have weighed on other chipmakers, and shares of Broadcom, Qualcomm and others declined.\nThe percentage of U.S. credit card accounts past due for 90 days was the highest in 12 years during the fourth quarter, a Philadelphia Federal Reserve report said.\nPresident Donald Trump's turbulent tariff rollout and subsequent pullback have rattled the stock market and confused economists and business leaders.  While some of the most intense tariffs are officially under a 90-day pause, a 10% tariff on most imports is still in effect, as is a hefty 145% import tariff on Chinese goods.  The semiconductor industry has so far avoided the impact of tariffs, which is great news for artificial intelligence leader Nvidia (NASDAQ: NVDA).\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-43_AMD, Micron, Broadcom Stocks Drop as U.S. Tightens Chip Export Rules",
    "date": "",
    "content": "Title: AMD, Micron, Broadcom Stocks Drop as U.S. Tightens Chip Export Rules\nDate: 2025-04-16 20:43\nURL: https://finance.yahoo.com/m/8127a441-ec7d-32ef-94b3-ca5f953cdf21/amd%2C-micron%2C-broadcom-stocks.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChip stocks fell after new export licensing requirements were imposed on Nvidia’s H20 and AMD’s MI308.\nThe S&P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.\nAdvanced Micro Devices (NASDAQ: AMD) stock saw a big valuation pullback Wednesday.  The semiconductor company's share price ended the day's trading down 7.4% amid a 2.3% decline for the S&P 500 and a 3.1% decline for the Nasdaq Composite.  Due to new U.S. policies, AMD will require an export license in order to sell its MI308X artificial intelligence (AI) processor into the Chinese market.\nExport restrictions placed on certain chips manufactured by Nvidia have weighed on other chipmakers, and shares of Broadcom, Qualcomm and others declined.\nStocks opened lower on Wednesday after the latest trade headlines hit Nvidia and other tech stocks. The Dow Jones Industrial Average was down 310 points, or 0.8%. The S&P 500 was down 1.4%. The Nasdaq Composite was down 2.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]\nBroadcom's new Incident Prediction uses AI to disrupt cyberattacks by predicting and blocking attackers' next moves, enhancing security without business disruption.\nAbbott Labs posts first-quarter sales that missed analysts’ estimates but rose 4% from a year earlier.\nUnited Airlines offered two sets of profit guidance, depending on whether the U.S. enters a recession.  \"The company's outlook is dependent on the macro environment, which the company believes is impossible to predict this year with any degree of confidence,\" the carrier said.  United shares rose roughly 4% Wednesday morning after the company reported better-than-expected quarterly earnings.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-45_S&P 500 Gains and Losses Today_ Chip Stocks Drop as Top Firms Cite Export Restriction Effects",
    "date": "",
    "content": "Title: S&P 500 Gains and Losses Today_ Chip Stocks Drop as Top Firms Cite Export Restriction Effects\nDate: 2025-04-16 20:45\nURL: https://www.investopedia.com/s-and-p-500-gains-and-losses-today-chip-stocks-drop-as-top-firms-cite-export-restriction-impacts-11716729?.tsrc=rss\nContent:\nMichael Bromberg is a finance editor with a decade of experience. He is an expert at elucidating complex financial topics in clear, concise language. Michael received a Bachelor of Arts in literature from the University of Wisconsin-Madison and a master's in linguistics from the Universidad de Antioquia in Medellin, Colombia.\nSpencer Platt/Getty Images\n Major U.S. equities indexes tumbled Wednesday.\n\n Federal Reserve Chair Jerome Powell told the Economic Club of Chicago that changes in U.S. trade policy could pressure growth and boost inflation. Noting declines in business and consumer sentiment, Powell suggested the Fed is poised to await more visibility on possible tariff impacts before modifying interest rates.\n\n The S&P 500 ended the session 2.2% lower, while the Dow declined 1.7%. Tech sector underperformance weighed on the Nasdaq, which fell 3.1%.\n\n Shares of J.B. Hunt Transport Services (JBHT) skidded 7.7%, falling the furthest of any S&P 500 stock, following the logistics company's earnings release. Although first-quarter sales and profits edged out expectations, executives noted that tariffs were weighing on demand as customers attempt to gauge the potential impact on their supply chains and overall businesses. J.B. Hunt stressed that it is evaluating options to reduce its costs as it navigates these challenges.\n\n The top executive from marketing and corporate communications firm Omnicom (OMC) reaffirmed plans to move forward with the acquisition of advertising giant Interpublic Group (IPG), pushing back against claims that the deal could result in client losses. However, shares of both companies dropped more than 7% on Wednesday.\n\n Semiconductor stocks dropped after chip giants Nvidia (NVDA) and Advanced Micro Devices (AMD) said they expect to take significant charges related to export restrictions imposed by the Trump administration. Nvidia anticipates a $5.5 billion hit in its fiscal first-quarter results. In comparison, AMD foresees a charge of up to $800 million. Reports said that Nvidia's H20, AMD's MI308, and other equivalent chips will need export licenses to be sold to Chinese firms. AMD shares plunged 7.4%, while Nvidia shares lost 6.9%.\n\n Palantir Technologies (PLTR) shares declined 5.8% on Wednesday, reversing some of the strong gains notched this week after the data analytics firm struck a deal with the North Atlantic Treaty Organization (NATO) for the deployment of Palantir's artificial intelligence (AI) military system. Shares of other enterprise software providers also lost ground amid broad pressure in the tech sector following Powell's comments about tariffs and their possible inflationary impact.\n\n Crude oil futures prices moved higher after the U.S. government announced sanctions on Chinese importers of oil from Iran, increasing concerns about global supply. The uncertain outlook for the global economy has pressured the commodity's price this month, and the bounce back helped lift oil and gas stocks. Shares of exploration and production company APA Corp. (APA) led the way, with a gain of 3.2%, marking Wednesday's top performance in the S&P 500. \n\n Abbott Laboratories (ABT) shares jumped 2.8% after the maker of medical devices and other health care products reported better-than-expected first-quarter sales and profits. The company also reaffirmed its full-year earnings per share (EPS) guidance. It announced plans to invest $500 million in two manufacturing and research and development (R&D) facilities in Texas and Illinois that are set to open this year.\n\n Gold prices surged to another record high as the precious metal's safe-haven appeal remains solid in the tense geopolitical environment. Shares of Newmont (NEM), the world's largest gold producer, advanced 2.6%."
  },
  {
    "title": "2025-04-16 20-46_Nvidia Stock Falls. It Got Bad News About Its H20 Chips From the Government.",
    "date": "",
    "content": "Title: Nvidia Stock Falls. It Got Bad News About Its H20 Chips From the Government.\nDate: 2025-04-16 20:46\nURL: https://finance.yahoo.com/m/44ed4857-89e8-3b77-be47-4d2ed0b2dff7/nvidia-stock-falls.-it-got.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe chip maker will take a $5.5 billion charge in the current quarter for H20 inventory and canceled sales.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries. Get Heard on the ...\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where Dollar Tree, Inc. (NASDAQ:DLTR)stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump declared […]\nWithin the largest companies in the sector, the players least affected by China risk are Alphabet and Meta Platforms.\nThe U.S.-China tech war just claimed another high-profile casualty.\nOn Wednesday, Walmart (NYSE: WMT) stock was guilty by association in the eyes of the market, a dynamic reflected in a share price drop of nearly 3%.  A top investment bank published a downbeat research note on a major peer in the retail world, and the bearishness spread to Walmart's stock.  Overall, however, few investors were enthusiastic about any stocks, as Walmart's decline was only slightly steeper than the S&P 500's (SNPINDEX: ^GSPC) 2.2% dip.\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nNvidia said it would record a $5.5 billion charge on its quarterly earnings and disclosed that the U.S. will now require a license for exporting the company's H20 processors to China and other countries.  Nvidia shares fell more than 6% in after-hours trading.  The H20 chips have far less processing power than the latest top-of-the-line Nvidia processors.\nThe ban on sales of the H20 chips calls into question the company’s ability to continually beat Wall Street’s lofty expectations.\nBoeing  stock fell after China ordered its airlines to halt deliveries of the company’s jets as part of an escalating trade war with the U.S., according to a report.  Chinese airlines have been told not to accept any more Boeing deliveries and asked that carriers not buy any further aircraft-related gear from U.S. companies, Bloomberg reported, citing people familiar with the matter.  Boeing didn’t respond to a request for comment.\nWe recently published a list of 11 Top Performing European Stocks So Far In 2025. In this article, we are going to take a look at where National Grid plc (NYSE:NGG) stands against other best performing European stocks to invest in. The world economy is hanging by a thread, as the macroeconomic environment consists of […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-55_Nvidia, caught in the US-China trade war, takes a $5.5 billion hit",
    "date": "",
    "content": "Title: Nvidia, caught in the US-China trade war, takes a $5.5 billion hit\nDate: 2025-04-16 20:55\nURL: https://www.cnn.com/2025/04/16/tech/nvidia-plunge-h20-chip-china-export-intl-hnk?.tsrc=rss\nContent:\nMarkets \n\n\n\nHot Stocks \n\n\n\nFear & Greed Index \n\n\n\n\n            Latest Market News \n\n\n\n\n            Hot Stocks \n\n\n\nFollow:\n\n            Nvidia is caught in the middle of an escalating trade war between the world’s two largest economies.\n    \n\n            Nvidia on Tuesday said it will take a $5.5 billion financial hit after Washington placed fresh restrictions on the export of its H20 artificial intelligence chips to China, in the latest escalation of a growing battle for AI dominance.\n    \n\n            Nvidia (NVDA) slumped 6.87% Wednesday after tumbling during premarket trading. The export restrictions on Nvidia come as President Donald Trump’s tariffs are roiling global markets and raising concerns about the prospects for global economic growth.\n    \n\n            The World Trade Organization on Wednesday said its expectations for global trade this year have “deteriorated sharply” owing to the battery of new tariffs on goods and uncertainty around future trade policy.\n    \n\n            The H20 chip, released just last year, was purposefully made to accommodate stringent US export controls to China and allowed Nvidia to continue selling to the country. The model has less computing power than the more powerful H100 AI chip, which has already been banned for sale to China.\n    \n\n            “Nvidia specifically designed the H20 to comply with US exports restrictions…now the rules change and they lost $5 billion,” said Jay Hatfield, chief executive at Infrastructure Capital Advisors. “So this inconsistent trade policy is costing companies a lot of money.”\n    \n\n            The H20 is believed to have contributed to DeepSeek’s successful development of its ChatGPT-like reasoning AI model, R1, which was said to be trained at a fraction of the cost of American equivalents. The development stunned the tech industry and sparked an AI revolution in China.\n    \n\n            Nvidia said in a Tuesday regulatory filing that it was informed by the US government last week the H20 chips would now require a special license to be exported to China, which accounted for 13% of sales last year.\n    \n\n            The chipmaker said it will report approximately $5.5 billion worth of charges in its first quarter’s earnings on May 28, associated with H20 products for “inventory, purchase commitments, and related reserves.”\n    \n\n            Analysts led by Dan Ives, global head of technology research at financial services firm Wedbush Securities, said the financial impact is small relatively, but the restrictions mark a “strategic blow” for Nvidia’s efforts to continue engaging its Chinese customers.\n    \n\n            “This disclosure is a clear sign that Nvidia now has massive restrictions and hurdles in selling to China as the Trump Administration knows there is one chip and company fueling the AI Revolution and it’s Nvidia,” they said in a Tuesday research note.\n    \n\n            The industry-leading AI chip designer has been caught in the crossfire in recent years as the US seeks to block China’s use of American technology to advance its military and AI systems.\n    \n\n            The US Commerce Department confirmed on Tuesday it was issuing new export licensing requirements on China-related exports of Nvidia’s H20 and another American AI chipmaker AMD’s MI308 chips, as well as their equivalents, according to Reuters.\n    \n\n            “The Commerce Department is committed to acting on the President’s directive to safeguard our national and economic security,” a Commerce Department spokesperson was quoted as saying.\n    \n\n            Nvidia was told the license requirement would be in place indefinitely, the company said in the filing. It is unclear how the US government would grant the licenses. The company declined to comment beyond its filing.\n    \n\n            While the Trump administration’s imposition of curbs on the H20 chips was widely expected, the restriction was more abrupt than anticipated, analysts at Morgan Stanley said in a Wednesday note.\n    \n\n             Since DeepSeek’s R1 model shook global markets earlier this year, American lawmakers on both sides of the aisle jointly called for tighter export controls on AI chips.\n    \n\n            In the months since, China has seen an AI boom, with DeepSeek’s reveal galvanizing investment and pressure on Chinese companies to advance its AI sector. Investor confidence in the country’s tech sector has surged, driving rallies in China and Hong Kong stocks.\n    \n\n            DeepSeek, along with many of China’s established tech giants, have been major consumers of Nvidia’s H20 graphic processing units. While Chinese tech heavy weight Huawei and AI chipmaker Cambroon have developed alternatives to H20s, those China-made chips generally lag in performance, particularly in software maturity, according to Brady Wang, associate director of Counterpoint Research, a market analysis firm.\n    \n\n            The performance gap between Chinese chips and Nvidia’s is expected to widen, Wang said, because of “Nvidia’s superior ecosystem and manufacturing advantages,” even as  DeepSeek’s rise demonstrates that high-performing AI models can be trained with lower-spec hardware.\n    \n\n            The prospects for the global economy have taken a knock because of Trump’s trade war, according to a new report by the WTO.\n    \n\n            The WTO projects global economies will grow more slowly than they would without tariffs — especially in North America, a region dominated by the United States, which will see a greater slowdown than other areas.\n    \n\n            The WTO said it expects global gross domestic product to expand by 2.2% this year. That growth would be 0.6 percentage points lower than the rate it would expect in a scenario with no additional tariffs.\n    \n\n            In North America, the impact will be more severe still, with GDP growth expected to be 1.6 percentage points below what it would be otherwise.\n    \n\n            With the escalation of an aggressive trade war between the US and China, Ives said further restrictions may be coming.\n    \n\n            “While the Nvidia news is concerning, it’s not a shock as we are in the middle of a trade war between the US and China and expect more punches thrown by both sides,” he said.\n    \n\n            In 2022, President Joe Biden began curbing the sale of advanced semiconductors from chipmakers like Nvidia to China over concerns that they could power its military. The controls have subsequently expanded to include restrictions on sales of chipmaking equipment, high-bandwidth memory chips and products manufactured outside the US using American technology in order to limit China’s technological progress.\n    \n\nRelated article\nBiden unveils last round of AI chip curbs aimed at China, Russia\n\n\n            Before Biden stepped down, his administration also broadened the geographic scope of those restrictions, unveiling a global export framework that subjects countries to different restrictions in a bid to prevent advanced AI technology from getting into the hands of adversaries like China through third countries. The new rules are expected to take effect next month.\n    \n\n            The series of restrictions have come under repeated criticism from US tech giants, particularly Nvidia, which says they will undercut US competitiveness.\n    \n\n            Ned Finkle, Nvidia’s vice president of government affairs, wrote in a company blog post that the adoption of AI around the world fuels growth and opportunity for industries at home and abroad. But the restrictions put that global progress “in jeopardy” and threatened to “derail innovation and economic growth worldwide,” he said.\n    \nMost stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited.\n© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.\nIf you switch this toggle to “no,” we will not sell or share your personal information with third parties for advertising targeted to this device. Please see our Privacy Center for additional preferences.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. You can set your browser to block or alert you about these cookies, but some parts of the site will not work."
  },
  {
    "title": "2025-04-16 21-03_Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions",
    "date": "",
    "content": "Title: Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions\nDate: 2025-04-16 21:03\nURL: https://finance.yahoo.com/video/tech-stocks-tumble-nvidia-discloses-210300530.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nJanus Henderson's Denny Fish says the US is penalizing Nvidia and giving the market to Huawei as President Trump's administration curbs chips export to China. He joins Ed Ludlow on \"Bloomberg Technology\" to discuss.\nThe chip maker will take a $5.5 billion charge in the current quarter for H20 inventory and canceled sales.\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nNvidia on Tuesday said it would take $5.5 billion in charges after the U.S. government limited exports of its H20 artificial intelligence chip to China, a key market for one of its most popular chips.  Nvidia's AI chips have been a key focus of U.S. export controls as U.S. officials have moved to keep the most advanced chips from being sold to China as the U.S. tries to keep ahead in the AI race.  After those controls were implemented, Nvidia began designing chips that would come as close as possible to U.S. limits.\nTaiwan Semiconductor Manufacturing (NYSE: TSM), popularly known as TSMC, is the world's largest semiconductor foundry, which fabricates chips for the top consumer electronics companies and chip designers across the globe.  The world's leading companies, such as Nvidia, AMD, Broadcom, Sony, and Apple, tap TSMC's plants for manufacturing chips that power personal computers (PCs), smartphones, data centers, and gaming consoles, among others.  As a result, TSMC is in a solid position to benefit from the secular growth of the global semiconductor market, which is expected to hit $2 trillion in annual revenue in 2032.\nThe S&P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.\nTSMC is a crucial player in the artificial-intelligence chip market, which has been upended by tariff turmoil.\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where GameStop Corp. (NYSE:GME) stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump declared […]\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-03_Trading Day_ When the chips are down",
    "date": "",
    "content": "Title: Trading Day_ When the chips are down\nDate: 2025-04-16 21:03\nURL: https://finance.yahoo.com/news/trading-day-chips-down-210332040.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Jamie McGeever\nORLANDO, Florida (Reuters) - TRADING DAY\nMaking sense of the forces driving global markets\nBy Jamie McGeever, Markets Columnist\nTariffied once again\nThe respite was too good to last, and sure enough, it didn't. World stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.\nThe Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.\nIf U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast. More on that and more below, but first, a round-up of the day's main market moves. I'd love to hear from you, so please reach out to me with comments at . You can also follow me at @ReutersJamie and @reutersjamie.bsky.social.\nIf you have more time to read today, here are a few articles I recommend to help you make sense of what happened in markets.\n1. In a fog of uncertainty, Fed policy storm could beapproaching 2. WTO slashes 2025 trade growth forecast, warns of deeperslump 3. US-China decoupling is crossing a Rubicon 4. EXCLUSIVE-Nvidia kept some China customers in the darkabout new US chip clampdown, sources say 5. Record gold crowded by one mega player: Mike Dolan\nToday's Key Market Moves\n* Wall Street falls, dragged lower by tech - Nasdaq -3%,S&P 500 -2.2%, Dow -1.7%. The Philadelphia semiconductor indexand the Roundhouse 'Magnificent 7' ETF both fall 4%. * Nvidia falls nearly 7% - at one stage it was down 10% -wiping some $175 billion off its market cap. AMD shares fall7.4%. * Chinese tech shares listed in Hong Kong fall 3.7%. * Safe-haven gold surges 3.4% to a new high of $3,342/oz,and the Swiss franc is the biggest gainer in the G10 FX space,rallying 1% against the dollar. * The dollar index falls 0.9%, back down to last week'sthree-year low. * The Canadian dollar underperforms, gaining only 0.6% eventhough the Bank of Canada paused its easing cycle and held ratessteady at 2.75% in what traders and economists had said was aclose call. * Nikkei and DAX futures point to falls of around 0.2% and0.5%, respectively, at the open in Japan and Germany onThursday. * Oil rises nearly 2% on supply concerns after the U.S.issues new sanctions targeting Chinese importers of Iranian oil.\nWhen the chips are down, really down\nAfter a few days of relative calm, investors buckled up on Wednesday as the Trump administration's latest trade war salvo sent world markets reeling again, with the big loser being Big Tech.\nThe Trump administration clearly has China in its sights but it is U.S. firms - including the biggest cash generators Wall Street has ever seen, like Apple and Nvidia - that are being caught in the crossfire.\nLast week it was Apple, and the White House backed down. Will the damage done to Nvidia and others on Wednesday prompt a similar rethink?\nEconomic signals from China and the U.S. on Wednesday were surprisingly positive, with U.S. retail sales in March and first quarter Chinese GDP growth beating forecasts. But these are rear-view mirror indicators, and if anyone needed it, Wednesday's news is a reminder that the outlook is pretty bleak.\nEconomists at Morgan Stanley and UBS this week cut their Chinese 2025 GDP outlooks to 4.2% and 3.4%, respectively. Anything close to the UBS forecast would be particularly alarming for Beijing, which is targeting growth of around 5%.\nMorgan Stanley's economists estimate tariffs will knock 90 basis points off growth relative to their original forecast, which will only be partially offset by 60 bps of additional stimulus.\nAlthough U.S. growth is slowing, Fed Chair Jerome Powell signaled on Wednesday the central bank will wait for \"greater clarity\" before deciding its next move on rates. He also said markets have been orderly and downplayed the risk of Fed intervention.\nMassive selling of long-dated Treasuries last week raised fears that part of the bond market wasn't functioning smoothly. There was no sign of that on Wednesday, however, as bonds' 'safe haven' qualities pushed yields down as much as 5 basis points at the short end.\nIn Europe, eyes will turn to Frankfurt where the European Central Bank on Thursday will announce its latest policy decision and ECB President Christine Lagarde will offer her outlook. Market pricing suggests a 25 basis point cut is all but certain, with at least another two coming later this year.\nAnd after Wednesday's rout, the focus in Asia on Thursday will stay on tech as Taiwan's TSMC reports first-quarter earnings. The world's largest contract chipmaker is expected to report a 34.2% increase in revenue to $25.318 billion from $18.87 billion a year ago, according to the mean estimate from five analysts based on LSEG data.\nTech and tariffs - a potent mix which roiled markets on Wednesday and will likely do so again sooner rather than later.\nUS Big Tech swaps 'safe haven' sheen for trade war target\nTreasuries are not the only 'safe haven' U.S. asset getting the cold shoulder as investors around the world rethink their enthusiasm for all things America. The shadow over 'Big Tech' is darkening and lengthening too.\nIn recent weeks, the global trade war, the Trump administration's 'America First' agenda and its apparent disdain for the post-war world order have dramatically slowed inflows into U.S. markets, and in some cases, reversed them. What used to be considered some of the safest shelters from crisis are now looking a little flimsy.\nIt might seem a stretch to put shares of U.S. technology and chip companies, such as Nvidia, Apple, and Amazon, on par with IOUs of the federal government, but these cash-generating emblems of 'U.S. exceptionalism' certainly seemed like sure things up until recently.\nAs these firms' global dominance spread over the past decade and their market footprint reached an unprecedented size, they effectively become ATMs for shareholders, generating record profits running into the hundreds of billions of dollars.\nIn the fourth quarter of last year, the 'Magnificent Seven' - Nvidia, Apple, Amazon, Meta, Alphabet, Microsoft and Tesla - accounted for a record 35% of the S&P 500's market cap, with a combined valuation of around $17.5 trillion. Credit ratings on some, like Apple, are the same as the U.S. sovereign rating, and yields have even traded below Treasury yields on occasion.\nInvestors of all stripes wanted in, from domestic to foreign, retail to official.\nAnd who could blame them? The 'Mag 7' appeared to offer the best of both investment worlds: a high income-generating asset and a safe-haven. So much so that the Swiss National Bank has a quarter of its $150 billion equity holdings in Apple, Nvidia, Microsoft and Amazon, and half of the $1.8 trillion Norwegian wealth fund's record $222 billion profit last year came from U.S. tech.\nREALITY CHECK\nBut that sweet spot is gone. The 'American exceptionalism' narrative has been undermined, as the U.S. economy looks set to slow and America's AI invincibility has been shattered by China's DeepSeek. And now tech companies find themselves on the front line of the global trade war.\nWashington is issuing new export licensing requirements for Nvidia's H20 AI chips to China. Nvidia said it faces $5.5 billion in charges, and its shares tumbled 9% on Wednesday, wiping nearly $250 billion off its market value and dragging the broader semiconductor index down 4%.\nTo be sure, U.S. tech has been getting slammed since mid-February, as investors have begun to re-evaluate the sunny outlook they had for the industry under a Trump presidency. The semiconductor index is now deep in a bear market. It has lost 30% in just two months and valuations have come down much more than the wider S&P 500.\nU.S. Big Tech is suddenly vulnerable on multiple fronts. Tariffs and trade restrictions from Washington will bite, as will retaliatory moves from China. And if Europe really wants to hit America where it hurts, tech is an obvious target.\nWHAT GOES UP...\nBut it's also worth remembering how much Big Tech outperformed on the way up. They were - and remain - incredibly profitable. According to LSEG figures, the Mag 7's net profit margin hit a record 25.8% in the fourth quarter, nearly double the S&P 500's 13.4%.\nNvidia's value rose 10-fold in two years to more than $3.5 trillion, Mag 7 stocks more than doubled between October 2023 and last December, and these companies accounted for almost all of the market's profit growth in 2023.\nWhile that halved last year and is expected to decline further this year to around a third, there is still a lot of air left to come out of the balloon. According to Bank of America's latest global fund manager survey, 'long Mag 7' was the most crowded trade for 23 consecutive months until April.\nAnd what was it replaced with? Long gold, one 'safe haven' that isn't giving up its title.\nWhat could move markets tomorrow?\n* TSMC earnings (Q1) * Japan trade (March) * Bank of Korea interest rate decision * European Central Bank interest rate decision * Germany producer price inflation (March) * U.S. weekly jobless claims * U.S. 5-year TIPs auction * U.S. Treasury Secretary Scott Bessent meets Japan EconomyMinister Ryosei Akazawa\nOpinions expressed are those of the author. They do not reflect the views of Reuters News, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.\nTrading Day is also sent by email every weekday morning. Think your friend or colleague should know about us? Forward this newsletter to them. They can also sign up here.\n(By Jamie McGeever, editing by Nia Williams)\nASML Holding, NVIDIA and Taiwan Semiconductor Manufacturing Company are included in this Analyst Blog.\nTrump wants to bring tech manufacturing to the US. There's little chance it will happen.\nNike initiated, GM downgraded: Wall Street's top analyst calls\nWe recently published a list of Energy Stocks that are Losing This Week. In this article, we are going to take a look at where Par Pacific Holdings, Inc. (NYSE:PARR) stands against other energy stocks that are crashing this week. After an encouraging start to the year, the energy industry is now trailing just behind the […]\nThese are today's mortgage and refinance rates. The 30-year fixed rate is down eight basis points, and most interest rates have dropped. Lock in your rate today.\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where Applied Materials, Inc. (NASDAQ:AMAT) stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump […]\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-05_Is NVIDIA Corp. (NVDA) the Best NASDAQ Stock to Buy So Far in 2025_",
    "date": "",
    "content": "Title: Is NVIDIA Corp. (NVDA) the Best NASDAQ Stock to Buy So Far in 2025_\nDate: 2025-04-16 21:05\nURL: https://finance.yahoo.com/news/nvidia-corp-nvda-best-nasdaq-210516724.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other NASDAQ stocks to buy in 2025.\nOn April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact of current tariffs and compared the situation to an economic armageddon. If the current tariffs remain in place, Ives thinks it would lead to a 15% to 20% demand reduction across the board. He thinks that investor anxiety is much higher considering how things were in the March 2020 COVID-19 crash earlier. The analyst thinks that investors should now focus on the likelihood of tariff adjustments from comments about negotiations, the impact on consumer-focused companies, and the potential for demand destruction. He even thinks that companies may refuse to provide guidance in the first-quarter earnings calls due to the persistent tariff uncertainty.\nIves thinks that a lot of tech companies will not be able to absorb high tariff increases and rather this cost will be passed on to the consumers which will lead to significant margin erosion and even potential sales declines. He indicated that tech stocks are currently pricing in a 10% to 15% cut to numbers. He suggests that investors should now look at companies with strong long-term potential as he believes earnings may normalize in 2025 and 2026. The analyst also addressed the defensive performance of defense contractors. While acknowledging the relative stability here, Ives cautioned that even these even such sectors are not immune to tariffs. He noted the significant foreign component, specifically 40% to 50% in some instances, in hardware and other sectors.\nWe sifted through the financial media reports to compile a list of the top NASDAQ stocks to buy for 2025. We then selected the 13 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 900 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA close-up of a colorful high-end graphics card being plugged in to a gaming computer.\nNumber of Hedge Fund Holders: 223\nNVIDIA Corporation (NASDAQ:NVDA) is a computing infrastructure company. The company’s Compute & Networking segment primarily includes Data Center computing platforms and end-to-end networking platforms. The main offerings in its Graphics segment encompass the GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service, and related infrastructures.\nThe company’s Data Center segment is foundational to its growth and grew by 93% year-over-year in FQ4 2025, while it doubled year-over-year for the full fiscal year 2025. This growth was driven by the rapidly increasing demand for AI infrastructure. 50% of the company’s total revenue comes from major cloud providers. However, these providers are currently looking for more cost-effective alternatives and trying to reduce their reliance on NVIDIA Corp. (NASDAQ:NVDA) after seeing developments like that of DeepSeek. For this reason, the company’s FQ1 2026 revenue growth guidance is also 9.4% sequentially, which is lower than the previous 12% figure.\nAt the same time, new US AI Diffusion Rules have also been introduced. These rules aim to control the global distribution of advanced AI chips and other technologies so that the spread of powerful AI can be regulated.  However, Bank of America still reaffirmed its Buy rating on the company with a $200 price target of March 28. This is because Large CSPs like Azure, GCP, AWS, and OCI are using the company’s Blackwell systems to meet their growing infrastructure demands.\nGuinness Global Innovators is highly bullish on NVIDIA Corp. (NASDAQ:NVDA) due to its dominant AI chip market position. It stated the following in its Q4 2024 investor letter:\n“For a second year running, NVIDIA Corporation (NASDAQ:NVDA) was the Fund’s top performing stock, delivering a stellar return of +177.7% over the year. Since the beginning of last year, Nvidia’s ‘Hopper’ GPUs have been at the centre of exploding demand for chips powerful and efficient enough to facilitate the energy intensive requirements of AI processes within datacentres. Initially possessing over 95% of market share in these types of chips, Nvidia have been quick to entrench their position as the technological leader in the space, launching the successor to the current ‘Hopper’ GPU in March, Blackwell, inhibiting the likes of AMD and Intel making meaningful inroads in taking share of the fast-growing market. Compared to the previous iteration (Hopper) which is continuing to fuel Nvidia’s extreme revenue growth, the Blackwell chip is twice as powerful for training AI models and has 5 times the capability when it comes to “inference” (the speed at which AI models respond to queries). Throughout the year, Nvidia’s financial performance has remained resilient. Quarterly revenues hit $35.1 billion in their most recent quarter, beating consensus expectations by 6% and representing a +94% year-over-year increase. Additionally, Nvidia’s data centre segment, driven by the Hopper (H100) chip, grew fivefold over the past year, underscoring the sustained demand for advanced AI infrastructure. The H100 chip, priced at around $40,000, continues to see significant adoption due to its ability to enhance AI model training efficiency while lowering overall costs. This growth is expected to continue as companies invest in upgrading existing data centres and building new ones, with Nvidia well-positioned to capture a significant share of the estimated $2 trillion market opportunity over the next five years. There have been some concerns over Blackwell production delays causing share price volatility however, Nvidia has recovered swiftly, driven by positive earnings results through the year and assurances from management regarding future supply. Additionally, the release of the H200 chip promises to extend Nvidia’s technological leadership, ensuring continued momentum into 2025. While Nvidia’s valuation remains a topic of debate, the stock is not at a significant premium to history, and it still appears reasonable given its dominant market position, innovative prowess, and exposure to long-term secular growth trends in AI, cloud computing, and data infrastructure. As a result, Nvidia remains well-positioned to deliver sustained outperformance over the long term, making it a cornerstone of growth-oriented portfolios.”\nOverall, NVDA ranks 5th on our list of the best NASDAQ stocks to buy so far in 2025. While we acknowledge the growth potential of NVDA, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries.\nTaiwan Semiconductor Manufacturing (NYSE: TSM), popularly known as TSMC, is the world's largest semiconductor foundry, which fabricates chips for the top consumer electronics companies and chip designers across the globe.  The world's leading companies, such as Nvidia, AMD, Broadcom, Sony, and Apple, tap TSMC's plants for manufacturing chips that power personal computers (PCs), smartphones, data centers, and gaming consoles, among others.  As a result, TSMC is in a solid position to benefit from the secular growth of the global semiconductor market, which is expected to hit $2 trillion in annual revenue in 2032.\nNvidia (NASDAQ: NVDA) shares fell more than 7% on Wednesday morning, after the company disclosed new export restrictions on its artificial intelligence (AI) chips.  Specifically, the company must now obtain licenses from the U.S. government to sell its H20 processors in China.  Nvidia stock now has plummeted 30% from the record high it reached in January.\nWaste Connections (WCN) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nTaiwan Semiconductor Manufacturing (NYSE: TSM) stock got hit with significant sell-offs in Wednesday's trading.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) and Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 2.2% and 3.1% in the session, respectively.  TSMC's valuation moved lower today in conjunction with news of new export restrictions on Nvidia's processors, higher tariffs on China, and cautious commentary from Federal Reserve Chairman Jerome Powell.\nNvidia (NASDAQ: NVDA) stock is falling fast amid multiple bearish catalysts in Wednesday's trading.  Nvidia's valuation is heading lower today amid multiple bearish catalysts.  Yesterday, the company submitted a filing to the Securities and Exchange Commission stating that it would be taking a $5.5 billion write-down following news from the U.S. government that it would now require an export license to sell its H20 processors to China.\nBuying stocks when overall markets are falling can seem dangerous and counterintuitive.  A great example would have been buying shares of quality companies amid the market chaos of 2020.  While it wasn't an easy time to buy stocks given the uncertainty ahead, doing so could have resulted in some significant gains for investors.\nThe U.S.-China tech war just claimed another high-profile casualty.\nTSMC is a crucial player in the artificial-intelligence chip market, which has been upended by tariff turmoil.\nPresident Trump’s 25% tariffs on the auto sector are the talk of the New York International Auto Show.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-14_Watch_ Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions",
    "date": "",
    "content": "Title: Watch_ Tech Stocks Tumble After Nvidia Discloses Chip Export Restrictions\nDate: 2025-04-16 21:14\nURL: https://finance.yahoo.com/m/f6289098-686c-3dd4-aebe-7ac2183e9c0c/watch%3A-tech-stocks-tumble.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries. Get Heard on the ...\nThe chip maker will take a $5.5 billion charge in the current quarter for H20 inventory and canceled sales.\nThe S&P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.\nTesla  stock fell Wednesday amid continuing economic fears.  “Tariffs are highly likely to generate at least a temporary rise in inflation,” Powell said in prepared remarks on Wednesday.  It has been a volatile few months for Tesla stock.\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nTSMC is a crucial player in the artificial-intelligence chip market, which has been upended by tariff turmoil.\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-28_Gold Hits Record High on Trade Tariffs and Nvidia Warning; Tech Stocks Fall",
    "date": "",
    "content": "Title: Gold Hits Record High on Trade Tariffs and Nvidia Warning; Tech Stocks Fall\nDate: 2025-04-16 21:28\nURL: https://finance.yahoo.com/news/gold-hits-record-high-trade-212850197.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGold prices surged to a record high in Asian trading Wednesday as investors sought safety amid heightened U.S.-China trade tensions and a $5.5 billion impairment warning from Nvidia (NVDA, Financials) linked to new chip export restrictions.\nWarning! GuruFocus has detected 3 Warning Signs with NVDA.\nList of 52-Week Lows\nList of 3-Year Lows\nList of 5-Year Lows\nSpot gold climbed 1.7% to $3,283.63 per ounce, while June gold futures peaked at $3,299.52 per ounce. The rally was supported by a weakening U.S. dollar and selling pressure on U.S. Treasuries, reflecting growing concerns about the U.S. economic outlook under President Donald Trump.\nTrump announced a 145% cumulative tariff on Chinese imports earlier this week, with additional levies under consideration for electronics and pharmaceuticals. China responded with a 125% tariff on U.S. goods. While the U.S. president exempted electronics from the latest measures and granted a 90-day reprieve on reciprocal tariffs for select countries, the shifting policy stance left markets unsettled.\nNvidia warned Tuesday that the company faces a $5.5 billion charge in the first quarter due to U.S. restrictions on semiconductor exports to China. The company said the move may limit sales opportunities in one of the world's largest chip markets. Nvidia shares fell 8.79% to $102.34 following the disclosure, leading declines in tech-heavy indices and sparking losses among chipmakers in Asia. The curbs could also restrict access to artificial intelligence components for Chinese firms, increasing the risk of further retaliatory trade actions.\nSilver futures rose 0.5% to $32.455 per ounce, while platinum futures slipped 0.1% to $968.95 per ounce. Copper prices moved lower despite China's first-quarter gross domestic product exceeding expectations. Analysts cautioned that future GDP readings may reflect the economic toll of escalating trade tensions. Copper on the London Metal Exchange dropped 0.6% to $9,108.85 per ton, while U.S. copper futures slipped 0.5% to $4.5920 per pound.\nMajor U.S. stock indexes fell, with the Nasdaq Composite down 3.29%, the S&P 500 losing 2.27%, and the Dow Jones Industrial Average declining 1.54%. The U.S. dollar index dropped 0.71% to 99.25, and the CBOE Volatility Index rose 9.46% to 32.97.\nOther major decliners included Tesla (TSLA, Financials), Palantir (PLTR, Financials), and Apple (AAPL, Financials), each posting sharp losses alongside Nvidia.\nThis article first appeared on GuruFocus.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nThe chip maker will take a $5.5 billion charge in the current quarter for H20 inventory and canceled sales.\nThe U.S.-China tech war just claimed another high-profile casualty.\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nTaiwan Semiconductor Manufacturing (NYSE: TSM), popularly known as TSMC, is the world's largest semiconductor foundry, which fabricates chips for the top consumer electronics companies and chip designers across the globe.  The world's leading companies, such as Nvidia, AMD, Broadcom, Sony, and Apple, tap TSMC's plants for manufacturing chips that power personal computers (PCs), smartphones, data centers, and gaming consoles, among others.  As a result, TSMC is in a solid position to benefit from the secular growth of the global semiconductor market, which is expected to hit $2 trillion in annual revenue in 2032.\nTSMC is a crucial player in the artificial-intelligence chip market, which has been upended by tariff turmoil.\nThe S&P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.\nNvidia on Tuesday said it would take $5.5 billion in charges after the U.S. government limited exports of its H20 artificial intelligence chip to China, a key market for one of its most popular chips.  Nvidia's AI chips have been a key focus of U.S. export controls as U.S. officials have moved to keep the most advanced chips from being sold to China as the U.S. tries to keep ahead in the AI race.  After those controls were implemented, Nvidia began designing chips that would come as close as possible to U.S. limits.\nBOSTON/LONDON (Reuters) -Global shares fell sharply on Wednesday as U.S. restrictions on chip sales to China and continued tariff uncertainty battered tech stocks, while gold traded at record highs and support for the dollar continued to erode.  Washington issued new export licensing requirements for sales to China of Nvidia's H20 and AMD's MI308 artificial intelligence chips.  Nvidia said the move would cost it $5.5 billion and its shares slumped nearly 7%.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-00_TSMC_ Why This Semiconductor Giant Looks Like a Massive Bargain Right Now",
    "date": "",
    "content": "Title: TSMC_ Why This Semiconductor Giant Looks Like a Massive Bargain Right Now\nDate: 2025-04-16 22:00\nURL: https://www.fool.com/investing/2025/04/16/tsmc-why-this-semiconductor-giant-looks-like-a-mas/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=c092ea3b-2e16-4332-8c29-2bec7e17bcd5&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nTaiwan Semiconductor Manufacturing (TSM -3.59%), popularly known as TSMC, is the world's largest semiconductor foundry, which fabricates chips for the top consumer electronics companies and chip designers across the globe. That explains why it has been growing at an impressive pace over the past couple of years.\nThe world's leading companies, such as Nvidia, AMD, Broadcom, Sony, and Apple, tap TSMC's plants for manufacturing chips that power personal computers (PCs), smartphones, data centers, and gaming consoles, among others. As a result, TSMC is in a solid position to benefit from the secular growth of the global semiconductor market, which is expected to hit $2 trillion in annual revenue in 2032.\nThat would be more than triple the $656 billion in revenue that the semiconductor industry generated last year. However, TSMC stock has been caught in the tariff turmoil of late, which explains why it is down more than 20% in 2025 as of this writing. But this pullback has made TSMC a terrific bargain.\nLet's look at the reasons why buying TSMC looks like a no-brainer right now.\nTSMC enjoys a massive lead in the foundry market with an estimated share of 67%, according to Counterpoint Research. That figure has been heading higher in recent quarters. Specifically, TSMC's foundry market share increased by six percentage points in 2024. Meanwhile, second-placed Samsung lost ground in this market as its share shrank by three points to 11%.\nA key reason why TSMC has been able to open such a huge gap over rivals in the foundry market is because of its technological advantage. TSMC's advanced process nodes allow its customers to manufacture powerful and power-efficient chips. For example, TSMC's 3-nanometer (nm) node is considered to be the most advanced chip manufacturing technology.\nThis process node is being used to manufacture smartphone chips and PC processors by the likes of AMD, MediaTek, Apple, and Qualcomm. Now, it looks like Nvidia will tap TSMC's 3nm process node to manufacture its next-generation Rubin graphics processing units (GPUs). Looking ahead, TSMC is looking to push the envelope further in chip manufacturing technology with the 2-nanometer process.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nThe company is expected to start mass-producing its 2nm processors in the second half of this year, which could put it ahead of rivals Samsung and Intel. Meanwhile, TSMC is also looking to diversify its global presence. The company has pledged an investment of $165 billion in the U.S. to build advanced chip manufacturing facilities that will power artificial intelligence (AI) applications.\nIt is worth noting that TSMC already fabricates chips for the leading AI semiconductor companies such as Nvidia, Broadcom, and Marvell, and its focus on boosting investments in advanced technologies should allow it to maintain its dominant position in the global foundry market. Additionally, TSMC's strategy of diversifying its global manufacturing footprint in countries such as Japan, the U.S., and Europe could turn out to be a smart move in the long run as it could help it mitigate the challenges arising out of potential trade-related conflicts, such as the one we are witnessing right now.\nSo, it won't be surprising to see TSMC remaining the top semiconductor foundry for a long time to come, and that's expected to translate into robust financial growth for the company.\nTSMC finished 2024 with $90 billion in revenue, an improvement of 30% from the prior year. The company has got off to a stronger start in 2025, recording a solid 42% jump in revenue in the first three months of the year to $25.6 billion. That's better than what the market was anticipating. Analysts expect TSMC's growth to gain momentum as the year progresses, as evident from the chart below.\n\nTSM Revenue Estimates for Current Fiscal Year data by YCharts\nWhat's more, the chart above also tells us that TSMC is on track to deliver robust growth over the next couple of years as well. Importantly, it won't be surprising to see the company sustaining its solid growth for a much longer period in light of the points discussed in the article. The semiconductor market is set to grow at an impressive pace, and TSMC itself sees a total addressable market worth almost $250 billion in its foundry and packaging services.\nThat figure could be bigger in the future as the size of the semiconductor market keeps growing. Not surprisingly, TSMC management expects to maintain an annual revenue growth rate of 20% for the next five years, which should translate into robust bottom-line growth as well. All this makes TSMC a top semiconductor stock to buy right now as it is trading at just 22 times trailing earnings and 17 times forward earnings, which is a nice discount to the tech-laden Nasdaq-100 index's forward earnings multiple of 27 (using the index as a proxy for tech stocks).\n\n \n\nBefore you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nHarsh Chauhan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Advanced Micro Devices, Apple, Intel, Nvidia, Qualcomm, and Taiwan Semiconductor Manufacturing. The Motley Fool recommends Broadcom and Marvell Technology and recommends the following options: short May 2025 $30 calls on Intel. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 22-05_Investing $5,000 Into Each of These 3 Stocks During the 2020 Crash Would Have Created a Portfolio Wo",
    "date": "",
    "content": "Title: Investing $5,000 Into Each of These 3 Stocks During the 2020 Crash Would Have Created a Portfolio Wo\nDate: 2025-04-16 22:05\nURL: https://www.fool.com/investing/2025/04/16/investing-5000-into-each-of-these-3-stocks-during/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=cd5abcdd-949a-4989-8724-c20651bcf3d2&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nBuying stocks when overall markets are falling can seem dangerous and counterintuitive. However, if you're investing in stocks for the long term, the benefits are extremely rewarding. \nA great example would have been buying shares of quality companies amid the market chaos of 2020. Five years ago, around April 14, 2020, the S&P 500 was already down nearly 13.5% for that year despite being in the midst of a rebound after a steep decline in March due to the emergence of the coronavirus pandemic. While it wasn't an easy time to buy stocks given the uncertainty ahead, doing so could have resulted in some significant gains for investors.\nStrategy (MSTR 0.35%), Celsius Holdings (CELH -0.98%), and Nvidia (NVDA -7.03%) have all generated monstrous gains for investors in just the past five years.\nIf you had invested $5,000 into each one of these stocks in April 2020, you'd have well up over $300,000 today. Here's a look at how much those investments would be worth as of April 16, and whether these stocks are still good buys right now.\nThe best-performing stock on this list is Strategy, formerly known as MicroStrategy. It would have turned a $5,000 investment into roughly $126,750 over just a five-year stretch. It's an astounding performance, especially when you consider that the main reason investors are bullish on it is for its position in Bitcoin -- it prides itself on being the largest corporate holder of the cryptocurrency. \nYet, investing $5,000 into the digital currency itself would have grown to a more modest sum of $63,000. Strategy has been the better investment. Despite posting volatile earnings numbers that sometimes feature massive seven-figure losses, its favorable position on Bitcoin has been a big reason for its rapid rise in value.\nWhile it technically provides companies with business intelligence solutions, Strategy has risen primarily due to the hype and excitement relating to crypto. Its fundamentals don't support its sizable $80 billion-plus market cap. This is a highly speculative and volatile investment, and investors shouldn't assume that because the tech stock has done so well in the past five years, it will be able to replicate these types of returns in the future.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nEnergy drink company Celsius Holdings has made for a tremendous growth stock over the years, establishing itself as one of the top companies in the industry over that time frame. A $5,000 investment in the business five years ago would now be worth a staggering $129,400 -- and this is even with shares of Celsius falling more than 50% over the past 12 months.\nMoving forward, the company can still be an appealing investment given its focus on the sugar-free market, where it can be a big player. It recently announced plans to acquire Alani Nutrition, which will expand its presence in that area. Last year, Celsius' sales grew by just 3% to $1.4 billion, but with much more growth still on the horizon for the business, it may not be too late to invest in the stock.\nChipmaker Nvidia has been a top stock to own due to its growth in artificial intelligence (AI). It plays a vital role in helping businesses expand their AI capabilities. It may seem surprising that the stock isn't higher on this list, but that's largely because of tariffs and the economic uncertainty ahead for the tech industry as a whole, and the risk that spending on chips may slow down in the near future.\nNvidia's five-year returns are still impressive, however, and the stock would have turned a $5,000 investment into close to $73,000 today. The company's dominance in AI chips makes it a strong buy moving forward as Nvidia's robust earnings and growth make it likely the business will become even more valuable in the future, and any dip in price could be an attractive buying opportunity for investors.\nIn its most recent fiscal year, which ended in January, the company reported over $130.5 billion in sales (more than double what it generated a year earlier), and profits of $72.9 billion soared from $29.8 billion in the previous year. Nvidia has been a growth machine, and even if business slows down in the near term, this can still make for an excellent long-term buy.\nIn total, a $15,000 investment across all these stocks five years ago would now be worth a staggering $329,000. These massive returns should remind investors that buying when sentiment is poor may not be as bad a time to invest in the stock market as it may appear to be.\n\n \n\nBefore you buy stock in Nvidia, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nDavid Jagielski has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bitcoin, Celsius, and Nvidia. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 22-06_Why Taiwan Semiconductor Manufacturing Stock Sank Today",
    "date": "",
    "content": "Title: Why Taiwan Semiconductor Manufacturing Stock Sank Today\nDate: 2025-04-16 22:06\nURL: https://www.fool.com/investing/2025/04/16/why-taiwan-semiconductor-manufacturing-stock-sank/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=7f04454a-4056-4e2a-b6a0-4f58851308c0&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nTaiwan Semiconductor Manufacturing (TSM -3.59%) stock got hit with significant sell-offs in Wednesday's trading. The semiconductor foundry leader's share price closed out the day down 3.6% after having been off as much as 5.6% in the session. Meanwhile, the S&P 500 (^GSPC -2.24%) and Nasdaq Composite (^IXIC -3.07%) fell 2.2% and 3.1% in the session, respectively.\nTSMC's valuation moved lower today in conjunction with news of new export restrictions on Nvidia's processors, higher tariffs on China, and cautious commentary from Federal Reserve Chairman Jerome Powell. The stock is now down 23% year to date. \nNvidia submitted a filing yesterday disclosing a significant new business headwind. The company is now being required to submit for an export license if it wants to sell more of its H20 processors to China, which likely means that the product will be barred from being sold to the country.\nTSMC manufactures the chip designs for the processors, and the foundry specialist could see overall demand pressured by new restrictions preventing advanced artificial intelligence (AI) semiconductors from being sold into the Chinese market.\nTSMC stock also sold off today in response to news that the U.S.'s tariffs on China will be raised to 245% and commentary from Jerome Powell on the potential impacts of the new export taxes. Powell indicated that the Fed would hold off on cutting interest rates until the potential inflationary impacts of new tariffs became more clear. \nAccording to a report published by DigiTimes today, TSMC intends to increase the prices on its 4nm chips by 30% in response to surging demand. The news suggests that the company should continue to post very strong sales growth in the near term, but there are still some big risk factors on the horizon. TSMC looks poised to be the leading manufacturer of advanced chips for AI applications for the foreseeable future, but its significance in the escalating tensions between the U.S. and China means the stock comes with outsized geopolitical risk.\n\n \n\nBefore you buy stock in Taiwan Semiconductor Manufacturing, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Taiwan Semiconductor Manufacturing wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nKeith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Nvidia and Taiwan Semiconductor Manufacturing. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 22-40_Trump administration reportedly considers a US DeepSeek ban",
    "date": "",
    "content": "Title: Trump administration reportedly considers a US DeepSeek ban\nDate: 2025-04-16 22:40\nURL: https://techcrunch.com/2025/04/16/trump-administration-reportedly-considers-a-us-deepseek-ban/?.tsrc=rss\nContent:\nLatest\t\n\n\n\n\t\tAI\t\n\n\n\n\t\tAmazon\t\n\n\n\n\t\tApps\t\n\n\n\n\t\tBiotech & Health\t\n\n\n\n\t\tClimate\t\n\n\n\n\t\tCloud Computing\t\n\n\n\n\t\tCommerce\t\n\n\n\n\t\tCrypto\t\n\n\n\n\t\tEnterprise\t\n\n\n\n\t\tEVs\t\n\n\n\n\t\tFintech\t\n\n\n\n\t\tFundraising\t\n\n\n\n\t\tGadgets\t\n\n\n\n\t\tGaming\t\n\n\n\n\t\tGoogle\t\n\n\n\n\t\tGovernment & Policy\t\n\n\n\n\t\tHardware\t\n\n\n\n\t\tInstagram\t\n\n\n\n\t\tLayoffs\t\n\n\n\n\t\tMedia & Entertainment\t\n\n\n\n\t\tMeta\t\n\n\n\n\t\tMicrosoft\t\n\n\n\n\t\tPrivacy\t\n\n\n\n\t\tRobotics\t\n\n\n\n\t\tSecurity\t\n\n\n\n\t\tSocial\t\n\n\n\n\t\tSpace\t\n\n\n\n\t\tStartups\t\n\n\n\n\t\tTikTok\t\n\n\n\n\t\tTransportation\t\n\n\n\n\t\tVenture\t\n\n\n\n\t\tEvents\t\n\n\n\n\t\tStartup Battlefield\t\n\n\n\n\t\tStrictlyVC\t\n\n\n\n\t\tNewsletters\t\n\n\n\n\t\tPodcasts\t\n\n\n\n\t\tVideos\t\n\n\n\n\t\tPartner Content\t\n\n\n\n\t\tTechCrunch Brand Studio\t\n\n\n\n\t\tCrunchboard\t\n\n\n\n\t\tContact Us\t\n\nPosted:\nThe Trump administration is considering new restrictions on the Chinese AI lab DeepSeek that would limit it from buying Nvidia’s AI chips, and potentially bar Americans from accessing its AI services, The New York Times reported on Wednesday.\nThe restrictions are part of the Trump administration’s effort to compete with China on AI. Months after DeepSeek jolted both Silicon Valley and Wall Street, U.S. officials seem to be weighing several options to limit China’s access to American technologies and consumers.\nOn Tuesday, the White House moved to restrict more of Nvidia’s AI chip sales to China, strengthening rules created by the Biden administration.\nDeepSeek’s popularity among U.S. AI developers has soared in recent months, and the startup’s competitive pricing has forced Silicon Valley to offer frontier AI models at lower costs.\nThere are lingering questions, however, around whether DeepSeek engaged in IP theft to create some of its more competitive models. OpenAI has alleged that the Chinese lab distilled its models, violating OpenAI’s terms of use.\nTopics\nSubscribe for the industry’s biggest tech news\nEvery weekday and Sunday, you can get the best of TechCrunch’s coverage.\nTechCrunch's AI experts cover the latest news in the fast-moving field.\nEvery Monday, gets you up to speed on the latest advances in aerospace.\nStartups are the core of TechCrunch, so get our best coverage delivered weekly.\nBy submitting your email, you agree to our Terms and Privacy Notice.\n© 2025 Yahoo.\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!"
  },
  {
    "title": "2025-04-16 23-20_China Open to Talks If US Shows Respect, Names Point Person",
    "date": "",
    "content": "Title: China Open to Talks If US Shows Respect, Names Point Person\nDate: 2025-04-16 23:20\nURL: https://finance.yahoo.com/news/china-open-talks-us-shows-085205469.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- China wants to see a number of steps from President Donald Trump’s administration before it will agree to trade talks, including showing more respect by reining in disparaging remarks by members of his cabinet, according to a person familiar with the Chinese government’s thinking.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nOther conditions include a more consistent US position and a willingness to address China’s concerns around American sanctions and Taiwan, said the person, who asked not to be identified to discuss internal thinking.\nFollow the The Big Take daily podcast on Apple, Spotify or anywhere you listen.\nBeijing also wants the US to appoint a point person for talks who has the president’s support and can help prepare a deal that Trump and Chinese leader Xi Jinping can sign when they meet, the person said.\nThe fate of the global economy and financial markets hinges in large part on whether the US and China can find a way to avoid a protracted trade war. Trump has hit China with tariffs of 145% on most goods since taking office, prompting Beijing to retaliate and threatening to wipe out most trade between the world’s biggest economies.\nThe offshore yuan gained 0.2% against the dollar in the wake of the report. The Australian dollar, a China-proxy currency, also advanced 0.5%. S&P 500 Index futures pared losses from as much as 1.6% earlier in the session. The benchmark closed 2.2% lower on Wednesday after Federal Reserve Chair Jerome Powell warned that trade tensions risk undermining the central bank’s employment and inflation goals.\nThe rapid onslaught of US tariffs has engendered broad public support in China for retaliation, giving Xi a political incentive to rebuff Trump’s repeated demands for a phone call. The US leader on Tuesday again called on China to reach out to him in order to kick off negotiations to resolve the trade fight.\nIt’s unclear what will produce a breakthrough to get talks moving. While both sides have indicated they’re open to negotiations, Trump appears determined to get Xi on the phone straight away while China wants any conversation between the leaders to produce a clear outcome.\nEven then if they agree on process, fundamental questions persist on what any agreement would look like. Trump’s demands remain unclear, and tariff levels on China would need to remain high to achieve his goal of balancing trade and attracting manufacturers to the US.\nWhile both China and the US probably want to see tariff rates lowered due to domestic pressure, negotiations are “unlikely to lead to a meaningful deescalation,” said Michelle Lam, Greater China economist at Societe Generale SA.\n“There is a bit more clarity on what China is looking from: respect, consistency and a point person,” she said. “So now the ball is in US court on whether they can meet these demands. But that is still difficult — especially if the aim is to contain China’s rise.”\nAccording to the person familiar with Beijing’s thinking, the most important precondition for any talks is that Chinese officials need to know such engagement will be conducted with respect.\nWhile the president has been relatively dovish when speaking publicly about Xi, other members of his administration have been more hawkish, leaving officials in Beijing unsure of the US’s position, the person said.\nWhatever the situation in Trump’s first term, officials in Beijing believe he now has tremendous control over this administration, said the person. As a result, when US officials make pointed statements about China, and Trump doesn’t disavow those views, Chinese officials have assumed the president condones their positions, the person said.\nWhile the person didn’t identify any specific comments by administration officials, Beijing has recently expressed notable displeasure with comments Vice President JD Vance made about “Chinese peasants.” Chinese Foreign Ministry spokesman Lin Jian last week called the remarks “ignorant and disrespectful,” in what was a rare direct rebuke of a senior US leader.\nIn addition to wanting a consistent message from the US administration, officials in Beijing also want to know that Washington is ready to address some of China’s concerns, the person said. Chief among those is the prevailing perception among Chinese officials that the US has enacted policies designed to contain and suppress China’s modernization.\nThe US in recent years has tightened export controls around China in an effort to prevent Beijing from obtaining cutting-edge chips and other advanced technology. Trump’s administration on Monday barred Nvidia Corp. from selling its H20 chip in China, escalating the tech fight with Beijing.\nChina also wants the US to address its national security concerns, particularly over Taiwan, the person said. Beijing claims the self-governing island as part of its territory and has pledged to take steps, including military action if necessary, to protect those claims. China will not undertake any provocative actions on Taiwan, the person said, but it will respond if provoked.\nFinally, Beijing also wants the US to designate a point person to oversee talks, the person said. China has no preference for who that is but they want the person to clearly be speaking and acting with Trump’s authority.\nChinese officials also understand that Trump may want to personally lead the negotiations, the person said. While Beijing would be flattered by Trump wanting to invest his time to such discussions, the person said, China believes the best way forward is for officials designated by the two presidents to oversee the talks.\nThat would be the most effective way to ensure that negotiations culminated in a meaningful summit between Trump and Xi, the person said.\n‘Inching’ Toward Talks\nTrump on Wednesday personally met with visiting Japanese officials in town to negotiate a trade deal, saying “big progress” had been made. Treasury Secretary Scott Bessent has said Japan, a military ally, will likely be prioritized along with other US partners in an effort to harness a collective effort to apply economic pressure on China.\nIn one sign of the confusion around US policy toward China, the Trump administration confirmed Wednesday morning the baseline tariff rate on Chinese imports to the US remains 145%, after a White House fact sheet released Tuesday afternoon Washington time said the nation “now faces up to a 245% tariff on imports to the United States as a result of its retaliatory actions.”\nThe figure takes into account preexisting duties on certain Chinese products, such as electric vehicles that faced a 100% charge before Trump’s second term, according to a White House official. Those older duties were added to the 145% Trump rate.\nChina had noted the cumulative tariff rate on certain exports is 245% and reiterated it will “fight to the end” if the US continues to harm its interests, the Ministry of Commerce said in a statement.\nBoth sides appear to be “inching toward the negotiating table,” said Scott Kennedy, a China expert at the Washington-based Center for Strategic and International Studies. “Both sides are trying to convey they are in a stronger position and that the ball is in the others’ court, but they’re now also trying to shape the potential agenda, participants and process for talks.”\n--With assistance from Wenjin Lv, Fran Wang and Derek Wallbank.\n(Updates with analyst comment in final paragraph.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nNvidia was rising Tuesday after President Donald Trump said the chip maker's U.S. infrastructure permits would be expedited.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsAdjusted first-quarter profit fell to 4 cen\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nTaiwan Semiconductor Manufacturing (NYSE: TSM) stock got hit with significant sell-offs in Wednesday's trading.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) and Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 2.2% and 3.1% in the session, respectively.  TSMC's valuation moved lower today in conjunction with news of new export restrictions on Nvidia's processors, higher tariffs on China, and cautious commentary from Federal Reserve Chairman Jerome Powell.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\nNetflix is slated to report first-quarter results after markets close Thursday, and options markets suggest traders are expecting a stock price big move in the following days.\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]