[
  {
    "title": "2025-04-16 09-19_Global Tech Stocks Drop as ASML Warning Adds to Nvidia Curbs",
    "date": "",
    "content": "Title: Global Tech Stocks Drop as ASML Warning Adds to Nvidia Curbs\nDate: 2025-04-16 09:19\nURL: https://finance.yahoo.com/news/asian-tech-stocks-slide-fresh-055536977.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) — Technology stocks sank as new US government restrictions on the export of Nvidia Corp. chips to China and a disappointing report from ASML Holding NV fanned trade war concerns, wiping out $155 billion in market value for the two companies alone.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nNvidia (NVDA) fell as much as 7.1% in US premarket trading after the chipmaker warned it will report around $5.5 billion in related charges during the fiscal first quarter, contributing to a 1.4% decline in Nasdaq 100 futures. Dutch chip-equipment maker ASML (ASML) slid as much as 7.6%. The selloff in semiconductor stocks over the past three months has already wiped out about $2 trillion in market capitalization.\nPresident Donald Trump’s administration has barred Nvidia from selling its H20 chip in China, an escalation of Washington’s tech battle with Beijing. ASML later added to investor anxiety by posting orders that missed expectations and saying that it doesn’t know how to quantify the impact of recent tariff announcements.\nThe latest developments show how tariffs are already wreaking havoc on global companies, while the trade war is extending beyond mere import taxes as well. The fallout could weigh on chip-sector earnings and also set back China’s ambitions to compete on the global tech stage. ASML’s drop weighed on Europe’s technology sector, with losses across chip equipment peers pushing the Stoxx 600 Technology Index about 2.5% lower.\nThe H20 restrictions are “driven by concerns over China’s rise in the electronics sector, and in that sense, it is likely to become a permanent policy,” said Tomo Kinoshita, global market strategist at Invesco Asset Management. “It is expected to have a significant negative impact on semiconductor supply chain.”\nTrump’s war on trade is prompting economists to scale back their forecasts for GDP growth worldwide, casting doubt over the outlook for everything from smart-phone demand to computing. Even before Washington slapped additional tariffs on much of the world — only to roll them back shortly after — many industry analysts had questioned whether big tech firms from Microsoft Corp. to Meta Platforms Inc. will continue to buy Nvidia Corp. chips at the same pace in 2025.\nAmong key suppliers, Korean memory maker SK Hynix Inc. slumped 3.7% Wednesday. Top foundry Taiwan Semiconductor Manufacturing Co. fell 2.5% ahead of results on Thursday. Japanese chip-equipment maker Advantest Corp. (6857.T) dropped 6.6%, extending its fall after ASML’s statement.\nTSMC was already likely to slow some production expansion on a weaker economic outlook, and “the tighter rules on Nvidia’s China sales might amplify the deceleration,” Bloomberg Intelligence analyst Ken Hui wrote in a note.\nFor China, the broader restrictions raise concerns that access to global tech hardware will be further choked off. Exports of the most-advanced chips and equipment to the Asian nation are already banned, and the H20 is a scaled-down product specifically designed not to be too powerful.\nEven after DeepSeek raised hopes that advances can be made in artificial intelligence and other fields without the most cutting-edge chips, China’s tech giants may suffer if curbs keep getting extended. Alibaba Group Holding Ltd. (BABA, 9988.HK) sank as much as 5.4% in Hong Kong trading Wednesday, while Baidu Inc. (BIDU) fell 3.3%.\n“It is a reminder of the potential susceptibility of tech stocks to the ongoing prickly relationship between the US and China regarding semiconductors,” said Tim Waterer, chief market analyst at KCM Trade in Sydney. “There is a reliance on the H20 chip from big name players in the Asian tech space, so any moves which could impact supply will be a drag on the broader sector.”\nOn the other side of the equation, China continues to work toward self-reliance in technology, though its companies are still seen lagging far behind advanced global leaders like Nvidia.\nAmong Chinese hardware stocks bucking the regional sector declines Wednesday, Hua Hong Semiconductor Ltd. jumped as much as 6.6% in Hong Kong while Advanced Micro-Fabrication Equipment Inc. rose 2.1% in Shanghai.\n“AI innovation in China is booming and the H20 ban would not dampen it — it may accelerate the use of China domestic chips,” said Vey-Sern Ling, a managing director at Union Bancaire Privee. “Domestic AI chips may not perform as well as Nvidia’s H20, but that is missing the point. China has been able to develop innovative AI models despite US restrictions.”\n—With assistance from Abhishek Vishnoi, Kit Rees, Edwin Chan, Henry Ren and Kurt Schussler.\n(Adds market value data in first and second paragraphs, US premarket trading in second)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nThe Beauty Salon Recession Indicator\nTrump Is Firing the Wrong People, on Purpose\n©2025 Bloomberg L.P.\nBy subscribing, you are agreeing to Yahoo's \n                        \n                            Terms\n                        \n                     and \n                        \n                            Privacy Policy\n                        \n\nJ&J faces several headwinds at the start of the year, including patent expiry, talc litigation, and, now, tariffs.\nTariffs put the U.S. at a short-term disadvantage and will harm competition for North American automakers once Chinese automakers arrive, Lawler said.\nNvidia was rising Tuesday after President Donald Trump said the chip maker's U.S. infrastructure permits would be expedited.\nSellers took center stage early Wednesday as news of a possible China trade barrier for Nvidia put a chill on tech firms specializing in artificial intelligence, and the markets in general.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-24_Market Chatter_ Meta Platforms Offered $450 Million Settlement to End FTC Antitrust Case",
    "date": "",
    "content": "Title: Market Chatter_ Meta Platforms Offered $450 Million Settlement to End FTC Antitrust Case\nDate: 2025-04-16 10:24\nURL: https://finance.yahoo.com/news/market-chatter-meta-platforms-offered-102406317.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMeta Platforms (META) chief executive officer Mark Zuckerberg offered to pay $450 million to settle\nThe FTC wanted $30 billion to drop its case. Zuckerberg offered much less and hoped Trump would back him up.\nThe Meta Platforms CEO testified that his company had legitimate business reasons for acquiring Instagram more than a decade ago.\nThe latest trading day saw Meta Platforms (META) settling at $521.52, representing a -1.87% change from its previous close.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-25_Jim Cramer_ Meta (META) Should “Break It Up”—WhatsApp Alone Is “Worth the Price”",
    "date": "",
    "content": "Title: Jim Cramer_ Meta (META) Should “Break It Up”—WhatsApp Alone Is “Worth the Price”\nDate: 2025-04-16 13:25\nURL: https://finance.yahoo.com/news/jim-cramer-meta-meta-break-132546873.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Meta Platforms Inc. (NASDAQ:META) stands against other key stocks that Jim Cramer analyzes.\nIn his latest appearance on CNBC’s Squawk on the Street, Jim Cramer reacted to the partial tariff exemptions announced by the White House, interpreting them not as a full retreat, but as a strategic pause designed to avoid punishing American companies. He suggested the administration was being careful not to hand over competitive advantages to Southeast Asian rivals, particularly Samsung:\n“So what I saw today, and not to be facetious, but what I see is people saying, you know what, we’ve seen the downside. Maybe we can test it again. But the president has, I don’t want to say blink, because that’s nonsense. What the president did was say, OK, look, we’re not going to continue to punish American companies and give the green light to Korea. I don’t know if you heard Lutnick’s words. He was very specific. Southeast Asia. That’s Samsung. They didn’t want to give the ball to Samsung.”\nREAD ALSO: Jim Cramer Hints at a Bigger Agenda Behind Tariffs and Breaks Down These 7 Stocks and Jim Cramer Reacts to the Surprise Market Surge and Highlights 8 Key Stocks.\nTurning to currency dynamics, Cramer pushed back on what he sees as misplaced panic over a weakening U.S. dollar. Instead, he argued that a softer dollar actually benefits American multinationals and gives long-needed relief to CFOs who’ve spent years blaming currency strength for lost market share:\n“Well, look, I’m not so certain I’m going to do a little contrary stuff on the dollar here. When we listen to conference calls, for the last four years, all we hear about is it would have been so much better if the dollar weren’t so strong. We keep losing share, the dollar’s too strong. Suddenly the dollar’s weaker, and now we start hearing all the downside, what, the bonds? I mean, I’m almost thinking that, I’m gonna put this out there, the people who are saying that it’s the end of the world, that the dollar is weaker, I think they have to go do some work boots on the ground. […] So suddenly the dollar’s weaker and we are petrified? These are people who have an agenda. And their agenda is to say, you know what matters more than anything else? Our hegemony from a strong dollar. And I don’t get it. If you’re in our business of picking stocks, you’re sick and tired of hearing CFOs say, we are done. We’ve got to stop this dollar rise.”\nCramer also gave his opinion about the rhetoric coming from Beijing, likening it to the Cold War-era paranoia of the 1960s and ’70s. He questioned whether a diplomatic breakthrough similar to Nixon’s historic visit to China is even possible under the current tone of U.S.-China relations:\n“But when I listen to the rhetoric from China, this is the 1968-72 rhetoric. It’s the kind of rhetoric that just says there’s never going to be a meeting. Is there a way to have a Nixon to China moment? Because as far as I’m concerned, this is just right now you’re on the verge of when I was a little boy and we kept thinking, when are they going to bomb us? I mean, that was the same rhetoric. When are they going to launch their nuclear weapons? I mean, that’s why we used to live in fear. That’s why we had cubbyholes. That’s why we used to put our heads in a cubbyhole, because the Chinese were going to bomb us if the Russians didn’t bomb us. This is the same sound.”\nTo make our list of the stocks that Jim Cramer talked about, we listed down the stocks he mentioned during CNBC’s Squawk on the Street aired on April 14th.\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund holders: 262\nDiscussing Meta Platforms Inc. (NASDAQ:META)’s antitrust scrutiny, Cramer took a contrarian view, suggesting that even if the company were forced to break up, it could unlock more shareholder value. He also emphasized WhatsApp’s overlooked strength as a key asset within Meta’s portfolio. Here’s his commentary:\n“I mean, all I know is that you break it up, you make even more money. It’s even better. I was on WhatsApp this weekend, David. That’s worth the price of the company. WhatsApp is a very powerful platform. Yeah, you have to hold it down and then you let it go and you talk into it and it’s just amazing. I’m all over it. Oh, I’m a WhatsApp guy. I have a lot of executives who really just, they come to me on WhatsApp.”\nOverall, META ranks 3rd on our list of key stocks that Jim Cramer analyzes. While we acknowledge the potential of META as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nContending that Meta (META) recently delivered “the best quarter in its history,” Jeffrey Small, the President of Arbor Financial, called on investors to “definitely buy the stock.” Small, who was speaking on Schwab Network, is also quite upbeat on Netflix (NFLX). More of Small’s Thoughts on META The financial advisor does not expect Meta’s profits […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-33_After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street",
    "date": "",
    "content": "Title: After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street\nDate: 2025-04-16 14:33\nURL: https://finance.yahoo.com/news/after-surge-to-record-highs-gold-overtakes-magnificent-7-as-the-most-crowded-trade-on-wall-street-143338618.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGold has surpassed the \"Magnificent Seven\" tech stocks as the most crowded trade on Wall Street as the precious metal surged to record highs this year amid volatile markets and an uncertain economic backdrop.\nAccording to the latest Bank of America fund managers survey published this week, nearly half of the fund managers surveyed (49%) see long gold, or bets that gold prices will rise, as the most crowded trade in the market right now. This marks the first time in two years that fund managers did not see the Magnificent Seven as Wall Street's most crowded trade, according to the survey.\nGold futures (GC=F) on Wednesday rose to an all-time high of $3,334 as investors continued to favor the safe-haven asset amid a falling US dollar (DX-Y.NYB) and tariff uncertainty.\nGold prices have surged more than 27% year to date, while the Magnificent Seven tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), Tesla (TSLA), and Nvidia (NVDA) — are down considerably.\nRead more: How to invest in gold in 4 steps\nTesla stock has led Magnificent Seven losses and is down about 38% since the start of 2025. Apple stock has fallen 21%.\nNvidia stock has also declined 21% year to date. In a regulatory filing, the AI chip giant warned of a multibillion-dollar impact from US export controls on China, which weighed on shares.\nShares of Alphabet, Microsoft, Meta, and Amazon — the remainder of the Magnificent Seven — are all down by double-digit percentages since the start of the year.\nGold's rally comes as central banks' demand hit all-time highs last year and as investors increased inflows into physical gold-backed exchange-traded funds (ETFs).\n\"The new highs in gold are signaling a shift in appetite for US assets,\" Ryan McIntyre, senior managing partner at asset manager firm Sprott, recently told Yahoo Finance.\n\"Confidence in the US has clearly been shaken, so people are looking to diversify.\"\nWall Street analysts have remained bullish on gold, upping their price forecasts on the precious metal even amid its fast ascent.\nSome 42% of fund managers expect gold will be the best-performing asset of 2025, up from 23% in March, according to Bank of America.\nThe firm's survey also showed investors have rotated out of US assets by a record amount over the past two months, with 73% of respondents saying \"US exceptionalism\" has peaked.\nInes Ferre is a Senior Business Reporter for Yahoo Finance. Follow her on X at @ines_ferre.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nSTH MVRV dropped to 0.82, signaling investor stress — while long-term holders quietly accumulate.\nSemiconductor stocks sank Wednesday after Nvidia and Advanced Micro Devices warned they would take a hit after the Trump administration moved to limit the chipmakers' exports to China.\nOppenheimer analysts on Wednesday initiated coverage of Lyft with an \"outperform\" rating, writing that they expect the company to benefit as ridesharing continues \"to challenge the rising cost of car ownership.\"\nOther companies hit hard include a medical device maker, a semiconductor firm and the maker of Vans sneakers.\nGold futures opened at $3,248.40 an ounce on Wednesday, up from Tuesday's close of $3,218.70. Gold's highest opening price in history follows ongoing uncertainty about changing U.S. tariff policies and the U.S. inflation outlook.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-20_Meta trial_ 5 key moments from Zuckerberg's testimony",
    "date": "",
    "content": "Title: Meta trial_ 5 key moments from Zuckerberg's testimony\nDate: 2025-04-16 15:20\nURL: https://finance.yahoo.com/news/meta-trial-5-key-moments-152043283.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Jody Godoy\nWASHINGTON (Reuters) - Meta Platforms CEO Mark Zuckerberg testified this week at a high-stakes trial in Washington where the U.S. Federal Trade Commission is seeking to unwind Meta's acquisitions of prized assets Instagram and WhatsApp.\nHere are five key moments from his testimony.\nBREAKUP CONSIDERED\nZuckerberg in 2018 floated the idea of spinning off Instagram amid mounting pressure on Big Tech from antitrust regulators, in a sign of how seriously he took the threat of precisely the type of claims Meta now faces.\n\"I wonder if we should consider the extreme step of spinning Instagram out as a separate company,\" he said in a document shown at trial. \"While most companies resist break ups, the corporate history is that most companies actually perform better after they've been split up.\"\n\"INSTAGRAM WAS BETTER\"\nSeeking to explain messages in which he worried that Instagram was a competitive threat, Zuckerberg said the app's camera was simply better than camera features Meta had developed.\n\"We were doing a build vs. buy analysis\" while in the process of building a camera app, Zuckerberg said. \"I thought that Instagram was better at that, so I thought it was better to buy them.\"\nThe comments appeared to bolster FTC claims that Meta chose to buy out rivals rather than compete. Meta argues that Zuckerberg's motivations do not matter because it does not have a monopoly.\nSOCIAL MEDIA CHANGING\nThe FTC claims Meta monopolizes the market for social networks where users share with friends and family. A key piece of Meta's defense is that the social media landscape has changed vastly since it bought Instagram in 2012 and WhatsApp in 2014, and even since the FTC brought the case 5 years ago.\nZuckerberg testified that now around 20% of content on Facebook and 10% on Instagram is generated by users' friends as opposed to accounts they follow based on interests.\n\"People just kept on engaging with more and more stuff that wasn't what their friends were doing,\" he said.\nALL-AD FEED\nPurchasing Instagram diminished competition and let Meta manipulate the service in ways that benefited the company and not users, such as by boosting the number of ads, the FTC argues. More competition would result in better outcomes for users, such as pressure to show fewer ads, the FTC has said.\nZuckerberg defended ads, saying Meta's system is designed to \"show more ad content to people who like seeing ad content.\"\nHe suggested that Meta has even contemplated introducing a feed consisting entirely of ads.\n\"I think we have discussed it at different points but I don't think we have done it,\" he said.\nSLOW AGAINST TIKTOK\nZuckerberg testified that Meta was slow to recognize the threat TikTok posed in the late 2010s but that over the past few years the short video app has been the \"highest competitive threat for Instagram and Facebook.\"\nThe FTC has not included TikTok or YouTube in the market where it says Meta has a monopoly, arguing that they are broadcast platforms rather than networks for connecting with friends and family.\nWith TikTok and YouTube included, Meta's share of the market drops below 30%, Meta has argued.\n(Reporting by Jody Godoy in Washington; Editing by Mark Porter)\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nThe latest trading day saw Meta Platforms (META) settling at $521.52, representing a -1.87% change from its previous close.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-31_Is Meta Platforms Inc. (NASDAQ_META) a Reddit Stock with High Potential_",
    "date": "",
    "content": "Title: Is Meta Platforms Inc. (NASDAQ_META) a Reddit Stock with High Potential_\nDate: 2025-04-16 15:31\nURL: https://finance.yahoo.com/news/meta-platforms-inc-nasdaq-meta-153138836.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 12 Reddit Stocks with High Potential. In this article, we are going to take a look at where Meta Platforms Inc. (NASDAQ:META) stands against other Reddit stocks with high potential.\nOn April 15, Monica Guerra, Morgan Stanley Wealth Management Head of US Policy, joined ‘Closing Bell Overtime’ on CNBC to discuss how investors should avoid knee-jerk reactions when it comes to volatility. Monica Guerra pointed out the significance of focusing on President Trump’s statements, as they contribute to market volatility despite their mixed and unclear nature. She acknowledged that deciphering his comments is challenging because they lack clarity but staying attentive to both presidential statements and congressional actions is still crucial. She stressed that policy certainty might emerge once Congress finalizes the budget, which is expected around August this year.\nShe also emphasized that while the day started positively with markets up by 0.79%, the situation otherwise remains uncertain. She reminded clients that the 90-day reprieve on tariffs is not the end of the story and the ongoing studies on semiconductors could lead to additional pressures related to tariffs and market volatility. Guerra noted that tariff revenues are being considered as funding sources for tax cuts and this interplay between tariffs and taxes could influence market volatility. On discussing future developments in tariff policy, she mentioned that more than 70 countries have approached President Trump in attempts to renegotiate the universal 10% tariff and reciprocal tariffs. She cautioned that even if reciprocal tariffs are eliminated and only the universal tariff remains, additional increases could be highly inflationary. China’s effective tariff rate is already at 145% and adding reciprocal tariffs could push inflationary pressures further.\nGuerra advised clients against reacting impulsively to such news and encouraged them to focus on long-term investment goals.\nWe sifted through Reddit threads to make a list of the top stocks with the highest analysts’ upside potential (at least 30%) as of April 15. The stocks are ranked in ascending order of their upside potential. We have also added the hedge fund sentiment for each stock, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 1000 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA team of developers working in unison to create the company's messaging application.\nNumber of Hedge Fund Holders: 262\nAverage Upside Potential as of April 15: 40.17%\nMeta Platforms Inc. (NASDAQ:META) develops products that enable people to connect and share with friends and family through mobile devices, personal computers, VR and mixed reality headsets, AR, and wearables. It operates through two segments: Family of Apps (FoA) and Reality Labs (RL). It was formerly known as Facebook Inc. until October 2021.\nMeta’s total FoA revenue surged by 21% in Q4 2024. Notable, ad revenue for FoA alone rose by 21% as well. FoA recorded $47.3 billion in Q4 revenue, while FoA ad revenue was $46.8 billion in the same quarter. The total number of ad impressions also increased by 6%, and the average price per ad rose by 14%. Meta is further improving its revenue performance through better monetization efficiency.\nOn April 10, Thomas Champion from Piper Sandler maintained a Buy rating on the company with a $610 price target. This sentiment was fueled by performance checks with an Ad Buyer and an evaluation of Meta’s upcoming financial performance. Meta now anticipates generating $42.5 to $45.5 billion in revenue in the second quarter of the year. This will be a 9% to 16.5% improvement year-over-year.\nNightview Capital highlighted the company’s strong growth potential, due to its AI leadership with Llama model, advertising ecosystem, and AR capabilities. It stated the following regarding Meta Platforms Inc. (NASDAQ:META) in its Q4 2024 investor letter:\n“Core Opportunity: Meta Platforms, Inc.’s (NASDAQ:META) platforms—Instagram, Facebook, WhatsApp, and Messenger—reach nearly half the world’s population daily, making it one of the most powerful advertising ecosystems globally. With investments in AI and augmented reality (AR), we believe Meta is also creating significant optionality for long-term growth.\nOverall, META ranks 8th on our list of the 12 Reddit stocks with high potential. While we acknowledge the growth potential of META, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of the 12 Reddit Stocks with High Potential. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other Reddit stocks with high potential. On April 15, Monica Guerra, Morgan Stanley Wealth Management Head of US Policy, joined ‘Closing Bell Overtime’ on CNBC […]\nReddit initiated, Target downgraded: Wall Street's top analyst calls\nThe company plans to use the capital to further develop its technology, expand into new markets, among others.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-31_The price Mark Zuckerberg wasn't willing to pay to halt Meta's antitrust trial",
    "date": "",
    "content": "Title: The price Mark Zuckerberg wasn't willing to pay to halt Meta's antitrust trial\nDate: 2025-04-16 15:31\nURL: https://finance.yahoo.com/news/the-price-mark-zuckerberg-wasnt-willing-to-pay-to-halt-metas-antitrust-trial-153134257.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMeta (META) CEO Mark Zuckerberg hoped to avoid a high-stakes antitrust trial playing out this week in Washington, D.C., but he wasn't willing to pay the price US antitrust cops wanted.\nHe and the Federal Trade Commission encountered stratospheric differences on what it would take to settle a case seeking the breakup of Zuckerberg's empire, according to a report from the Wall Street Journal.\nIn March, Zuckerberg offered the head of the FTC $450 million, according to the Wall Street Journal, well short of the $30 billion demanded by the FTC. He eventually increased it to $1 billion, according to the Wall Street Journal, but FTC boss Andrew Ferguson wouldn't accept anything lower than $18 billion.\nThe revelations about Zuckerberg's attempts to settle with the Trump administration add a new layer of drama to the legal battle between the social media giant and the FTC, which alleges Meta became a monopoly in the market for \"personal social networking\" by buying up potential rival social media startups such as Instagram and WhatsApp.\nMeta's Facebook acquired Instagram in 2012 for $1 billion and WhatsApp in 2014 for $19 billion. The FTC reviewed and approved the purchases but now wants a judge to force Meta to divest both of them.\nZuckerberg and his top aides made multiple visits to the White House to meet with President Trump and administration officials before the trial began. Zuckerberg also made two visits to the president's private Mar-a-Lago club. And Meta donated $1 million to Trump's inaugural fund.\nTrump, according to the Wall Street Journal, did ask staff to work on a potential settlement. But Ferguson and the Justice Department's antitrust chief, Gail Slater, persuaded Trump to support their recommendation to proceed to trial.\nThis week in court, the FTC wasted no time laying out evidence against Zuckerberg by calling the CEO as its first trial witness.\nInstagram became the FTC's central topic as prosecutors confronted Zuckerberg with his past emails.\nIn a 2012 email, Zuckerberg told Facebook's then-CFO, David Ebersman, that purchasing Instagram and other startups could be viewed as a way for Facebook to buy time.\n\"Even if some new competitor springs up, buying Instagram, Path, Foursquare etc. now will give us a year or more to integrate their dynamics before anyone can get close to their scale again,\" Zuckerberg wrote, according to an account of the testimony reported by Bloomberg.\nZuckerberg agreed under questioning by the FTC's attorney that buying Instagram was intended to \"neutralize a competitor,\" but he added that the purchase was also meant to boost Facebook's quality and functionality.\n​​\"I read this as talking about incorporating the functionality and staying ahead in terms of quality. But scale is one aspect of that, and time is one aspect of that,\" Zuckerberg testified, according to Bloomberg.\n\"It's not accurate to say that the only reason we were interested was the scale or growth rate, which I think that your question is implying.\"\nZuckerberg's testimony concluded on Wednesday by addressing Facebook's view of the Chinese social media app TikTok launched in 2018.\nZuckerberg viewed the app's increasing popularity as a \"highly urgent\" threat and \"we observed that our growth slowed down dramatically.\"\n\"TikTok is still bigger than either Facebook or Instagram, and I don't like it when our competitors do better than us,\" Zuckerberg said, according to reports.\nAntitrust lawyers have said TikTok presents a potential sticking point for the FTC's case because the company offers similar services to Facebook and Instagram, yet is excluded in the group of companies that the commission claims compete in the market for personal social networking.\n\"We haven't been shy about explaining why it doesn't make sense for the FTC to bring a case to trial that requires it to prove something every 17-year-old in America knows is absurd — that Instagram doesn’t compete with TikTok,\" a Meta spokesperson said.\n\"We are prepared to win at trial.\"\nAlexis Keenan is a legal reporter for Yahoo Finance. Follow Alexis on X @alexiskweed.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\nLet's explore why Phillip Morris International (NYSE: PM) and Alpine Income Property Trust (NYSE: PINE) could be long-term winners.  Because nicotine is habit-forming, demand for cigarettes and other tobacco products typically remains strong no matter what is happening in the economy.  Philip Morris International has tackled this challenge through geographic diversification and a pivot to safer, reduced-risk tobacco products.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock […]\nAll is not lost when it comes to investing in Nvidia. Here's what Lawrence McDonald of the Bear Traps Report has to say.\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nThe stock market has been crashing this year and if you're a long-term investor, it can be a good time to invest in companies at discounted valuations.  Three stocks that are in a free fall right now that I still wouldn't bother buying today are Tesla (NASDAQ: TSLA), Tilray Brands (NASDAQ: TLRY), and Rigetti Computing (NASDAQ: RGTI).  Shares of electric vehicle maker Tesla are down 37% year to date, and there is no shortage of reasons to explain why the stock is struggling.\nThese 10 stocks performed the best over the past 10 years.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-00_Apple market cap falls back below $3 trillion as 'relief rally' fades amid new tariff uncertainty",
    "date": "",
    "content": "Title: Apple market cap falls back below $3 trillion as 'relief rally' fades amid new tariff uncertainty\nDate: 2025-04-16 16:00\nURL: https://finance.yahoo.com/news/apple-market-cap-falls-back-below-3-trillion-as-relief-rally-fades-amid-new-tariff-uncertainty-160003888.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL) stock fell nearly 4% on Wednesday, sending the iPhone maker's market capitalization back below $3 trillion as tariff pressures continue to weigh on the company after shares had enjoyed what some analysts called a \"relief rally\" earlier in the week.\nApple stock surged to start the week, leading the \"Magnificent Seven\" stocks higher as investors cheered the Trump administration's temporary tariff exemptions for tech products announced over the weekend.\nThe \"relief rally,\" as Citi's Atif Malik put it, briefly put Apple's value back above the $3 trillion mark after falling to its lowest value in almost a year last week at just under $2.6 trillion.\nApple is still the world's most valuable company, ahead of Microsoft (MSFT).\nUS Customs and Border Protection issued regulations late Friday exempting consumer electronics — and almost all of Apple's products — from reciprocal tariffs.\nOn April 2, Trump announced global reciprocal tariffs that would go into effect on April 9.\nRead more: The latest news and updates on Trump's tariffs\nThe president instead announced a 90-day pause on the reciprocal tariff plan last Wednesday — with the exception of a 145% reciprocal tariff on Chinese imports, a development cheered by Apple investors. Some 90% of Apple's iPhones are made in China.\nApple had shed more than $770 billion from its market cap between April 2 and April 8.\nApple's decline on Wednesday comes after Nvidia (NVDA) disclosed late Tuesday that the Trump administration had effectively banned exports of its H20 chips to China.\nNvidia's disclosure followed reports that Trump had been set to back off plans to restrict Nvidia's chips designed for China to comply with US trade rules.\nTo Jefferies analyst Edison Lee, these developments show that there are “many conflicting opinions within Trump's team on the issue of tariffs, strategies against China and US tech restrictions.\"\n\"The concern about Apple is that it will become harder to avoid the crossfire between the US and China as tariffs and restrictions come into play,\" DA Davidson analyst Gil Luria told Yahoo Finance in an email.\n\"The [export] restrictions on chips that came out from NVIDIA represent an escalation in the trade dispute.\"\nTech stocks fell across the board Wednesday, with the Nasdaq (^IXIC) dropping 3%.\nFellow Magnificent Seven stocks Meta (META) and Microsoft (MSFT) also sank, falling nearly 4%, while Nvidia plummeted almost 7%.\nTrump also set the stage to tariff semiconductors this week — the Commerce Department opened a probe into computer chips Tuesday under Section 232 of the Trade Expansion Act of 1962, which grants the president the ability to impose levies on imports due to national security. And Trump has promised that most electronics will still get wrapped up in his tariffs, which could hurt Apple.\n\"We are taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations,\" he posted Sunday.\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe five-year note led\nTSMC, the main global producer of advanced chips used in artificial intelligence applications, is set to report a 57% leap in first-quarter profit on Thursday, though it is also likely to flag risks from U.S. President Donald Trump's trade policies.  Taiwan Semiconductor Manufacturing Co is expected to report a net profit of T$354.6 billion ($10.92 billion) for the three months ended March 31, according to a LSEG SmartEstimate drawn from 18 analysts.\nAll is not lost when it comes to investing in Nvidia. Here's what Lawrence McDonald of the Bear Traps Report has to say.\nTrump's Treasury secretary wants business owners to relax. That's hard to do when Trump's tariffs are pushing costs higher and profits lower and threatening a recession.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nThe dollar resumed its fall on Wednesday with both safe-havens and risk-sensitive currencies outperforming the greenback as traders waited to see if U.S. President Donald Trump’s administration reaches new trading agreements with partners.  The dollar tumbled last week on concerns over the economic impact of new tariffs and as investors shifted allocations overseas due to uncertainty on the erratic implementation of the trade levies.  The United States is in discussions with countries including Japan, while tensions between China and the U.S. are intensifying.\nNvidia stock sank after a surprise disclosure it would take a hit north of $5 billion following new chip export restrictions.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-28_Meta Shares Tips on How to Maximize Click-to-Message Ads",
    "date": "",
    "content": "Title: Meta Shares Tips on How to Maximize Click-to-Message Ads\nDate: 2025-04-16 16:28\nURL: https://www.socialmediatoday.com/news/meta-shares-click-to-messaging-ad-tips/745595/?.tsrc=rss\nContent:\nLet Social Media Today’s free newsletter keep you informed, straight from your inbox.\n                    \n                \n            \n\nMeta’s click to messaging ads have seen significant growth of late, with the promotions helping brands tap into the familiarity and intimacy of DMs, and sparking immediate connection.\nIndeed, Meta has reported that click-to-message ads, in all formats (for Messenger, IG Direct, and WhatsApp) have been gaining popularity, which could make them a viable consideration for your strategy.\nAnd if you are considering Meta’s click-to-message promotions, Meta has shared some new tips on how to get the most out of your DM-driving promotions.\nFirst off, in terms of general tips, Meta says that brands should:\nIn addition to these tips, Meta has also shared some more advanced pointers for your click-to-message campaigns:\nThere are more tips in Meta’s full overview, which outlines a range of ways that you can utilize click-to-message ads to best effect.\nAnd again, with more and more social media discussion switching to messaging apps, it could be worth considering, providing a means to drive direct engagement and interaction that can lead to more purchases.\nGet the free daily newsletter read by industry experts\nThe key to maximizing a social media marketing strategy is to ground the approach in purpose.\nFor months, we’ve been tracking Elon Musk’s $44 billion deal with Twitter. Now that the deal is done, we watch as the Musk-Twitter era begins.\nSubscribe to Social Media Today for top news, trends & analysis\nGet the free daily newsletter read by industry experts\nThe key to maximizing a social media marketing strategy is to ground the approach in purpose.\nFor months, we’ve been tracking Elon Musk’s $44 billion deal with Twitter. Now that the deal is done, we watch as the Musk-Twitter era begins.\nThe free newsletter covering the top industry headlines"
  },
  {
    "title": "2025-04-16 17-00_Is Meta Platforms, Inc. (META) The Best American Tech Stock To Buy Now_",
    "date": "",
    "content": "Title: Is Meta Platforms, Inc. (META) The Best American Tech Stock To Buy Now_\nDate: 2025-04-16 17:00\nURL: https://finance.yahoo.com/news/meta-platforms-inc-meta-best-170033209.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently compiled a list of the 14 Best American Tech Stocks To Buy Now. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against the other American tech stocks.\nAmerican stocks moved up a bit on Monday, April 14 as investors focused on news about tech companies getting a break from President Trump’s tariffs. The S&P 500 rose by 0.8%, the tech-heavy Nasdaq rose by 0.6%, and the Dow Jones Industrial Average increased by about 0.7%.\nREAD ALSO: 11 Best American Energy Stocks to Buy Now and 10 Best Stocks Under $10 to Buy Now.\nIn recent days, President Trump and his advisers have given mixed signals on the future of tariffs on China and on specific industries. Over the weekend, big American tech companies scored a victory when it was revealed that the US had not put tariffs on smartphones, computers, and other consumer electronics.\nHowever, on Sunday, US Commerce Secretary Howard Lutnick stated that these electronics would soon be covered under new tariffs, which would be different from those imposed on specific countries. President Trump also posted on social media that there would be “no exception” for these products. He also said that the government is looking at semiconductors and the entire electronics supply chain in the upcoming National Security Tariff Investigations.\nLast week was the best week for the major indexes since at least 2023. However, with all this uncertainty, Wall Street is getting ready for another week of potential tariff-fueled ups and downs.\nTo compile our list of the 14 best American tech stocks to buy now, we used stock screeners from Finviz and Yahoo Finance to find the largest American technology companies. We sorted our results based on market capitalization and picked the top 30 American stocks. Next, we focused on the 14 stocks most favored by institutional investors. Data for the hedge fund sentiment surrounding each stock was taken from Insider Monkey’s Q4 2024 database of more than 1,000 elite hedge funds. Finally, the 14 best American tech stocks to buy now were ranked in ascending order based on the number of hedge funds holding stakes in them as of Q4 2024.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter's strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 262\nMeta Platforms, Inc. (NASDAQ:META), previously named Facebook, Inc., is an American multinational technology corporation that owns and operates Facebook, Messenger, Instagram, Threads, and WhatsApp. The company also offers a range of other devices, products, and services that are powered by AI and immersive technologies. Meta Platforms, Inc. (NASDAQ:META) ranks among the best American stocks to buy right now.\nOn April 10, Piper Sandler analyst Thomas Champion reduced the firm’s price target on Meta Platforms, Inc. (NASDAQ:META) from $775 to $610 but maintained an “Overweight” rating. This adjustment reflects a cautious stance due to the company’s exposure to e-commerce and China. Champion cited performance checks with an Ad Buyer that were considered the best in the group, and focused on Meta Platforms, Inc.’s (NASDAQ:META) Q2 revenue guidance of $42.5 billion to $45.5 billion, representing an increase of 9 to 16.5% year-over-year. The analyst also expects the company’s management to reiterate their fiscal year 2024 operating expense forecast of $114 to $119 billion and capital expenditures forecasted at $60 to $65 billion. Additionally, updates on Meta Platforms, Inc.’s (NASDAQ:META) advancements in AI, particularly Llama 4 and the agentic opportunity, are anticipated. The revised price target is also based on reduced revenue estimates for 2025 and 2026, which have been lowered by 2% and 4%, respectively.\nOverall, META ranks 3rd on our list of the best American tech stocks to buy now. While we acknowledge the potential of META as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than META but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nTake advantage of the recent sell-off with these three bargain growth stocks.\nNSC's first-quarter 2025 top line is expected to have been significantly affected by weak freight demand and tariff-related uncertainties.\nToronto-Dominion Bank (NYSE: TD) has a 5% dividend yield.  Realty Income's (NYSE: O) yield is 5.7%.  There was a large fine, the company is upgrading its internal controls, and TD Bank, as it is more commonly known, is operating under an asset cap in the U.S. The asset cap is the big problem because it basically means TD Bank can't expand its U.S. business until regulators are convinced the money laundering issue is in the past.\nAmazon (NASDAQ: AMZN) started out in the 1990s selling books online.  Should you buy Amazon stock now and hold for the next 20 years?  Jeff Bezos, Amazon's billionaire founder, always wanted the company to prioritize the customer above anything else.\nRecent market volatility has raised anxiety for some investors, but these are the best opportunities to buy shares of the best growth stocks.  The stocks of growing companies will continue to hit new highs over many years.  You just have to maintain a cool attitude toward market swings and realize that the traders on Wall Street hitting the sell button on negative news are not investing for the long term.\nNvidia (NASDAQ: NVDA) stock is falling fast amid multiple bearish catalysts in Wednesday's trading.  Nvidia's valuation is heading lower today amid multiple bearish catalysts.  Yesterday, the company submitted a filing to the Securities and Exchange Commission stating that it would be taking a $5.5 billion write-down following news from the U.S. government that it would now require an export license to sell its H20 processors to China.\nMeta CEO Mark Zuckerberg gave thought to spinning off Instagram as US antitrust scrutiny intensified last decade, according to a memo surfaced Tuesday as Zuckerberg again took the stand to defend his company against claims that Meta illegally dominated social media.\nBuying stocks when overall markets are falling can seem dangerous and counterintuitive.  A great example would have been buying shares of quality companies amid the market chaos of 2020.  While it wasn't an easy time to buy stocks given the uncertainty ahead, doing so could have resulted in some significant gains for investors.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-15_Why Meta Platforms, Inc. (META) is the Best Blue Chip Stock to Buy According to Billionaires",
    "date": "",
    "content": "Title: Why Meta Platforms, Inc. (META) is the Best Blue Chip Stock to Buy According to Billionaires\nDate: 2025-04-16 19:15\nURL: https://finance.yahoo.com/news/why-meta-platforms-inc-meta-191532281.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other best blue chip stocks to buy according to billionaires.\nThe US stock market is showing volatility after President Donald Trump’s recent announcement of sweeping 10% tariffs on all US trading partners and higher tariffs on countries with a trade deficit with the US.\nEconomists and investors believe President Trump’s tariff policies could potentially lead to a trade war with America’s trading partners, propelling inflation even higher. These two factors could plunge the US into an economic slowdown, and the markets could potentially sell off quickly if a recession materializes among its looming threats.\nOn April 10, CNBC reported that stock prices rose sharply a day before after declining for four days straight following President Trump’s announcement of a pause in a significant part of his tariff plan. The White House said that Democratic lawmakers were indulged in partisan games by inquiring if any stock market purchases conducted in recent days were undertaken with prior knowledge of the fact that President Trump would authorize a pause in his tariff plans. Trump announced higher tariffs on China even after he announced a 90-day pause for steeper-than-baseline rates for several other countries.\nREAD ALSO: 10 Best Medical Stocks to Buy According to Billionaires and 10 Best Organic Food Stocks to Buy According to Billionaires.\nOn April 11, Erica York, economist and the vice president of federal tax policy at the Tax Foundation’s Center for Federal Tax Policy, talked to CNBC’s “The Exchange” about the ongoing scenario and said that the imposition of around 145% total tariff on Chinese goods would result in a suspension of most trade between the US and China. She said:\n“It depends on how narrowly the tariff is applied or how broadly it’s applied, but generally, if you get north of a triple-digit tariff, you are cutting off most trade.”\nShe further opined that:\n“There may still be some things without any substitutes that companies just have to foot the bill, but for the most part, that cuts it off.”\nThe economist said that Trump’s new China tariffs, along with the others he implemented, would raise the average tariff rate to record highs the country hasn’t seen since the 1940s. The current market volatility has created numerous remarkable investment opportunities, so let’s look at the 15 best blue chip stocks to buy according to billionaires.\nWe reviewed financial media reports and ETFs to compile an initial list of blue chip stocks and selected stocks that have a 5-year revenue growth rate of at least 10%. We have also considered the popularity of these stocks among billionaire investors. These billionaires are founders or managers of some of the world’s leading hedge funds and companies. We also added the number of hedge fund holders for each stock as of fiscal Q4 2024, and sourced the hedge fund sentiment data from Insider Monkey’s database.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nNumber of Billionaire Investors: 36\nNumber of Hedge Fund Holders: 262\nMeta Platforms, Inc. (NASDAQ:META) builds technological products that allow people to share, connect, grow businesses, and find communities. These products help people connect through personal computers, mobile devices, virtual reality (VR), mixed reality (MR) headsets, and wearables. Most of Meta Platforms, Inc.’s (NASDAQ:META) revenue comes from its advertising business.\nThe company is employing AI to boost engagement on its social platforms. At the end of 2024, Meta CEO Mark Zuckerberg told investors that this tool was raising the amount of time users spend on Instagram and Facebook. Meta Platforms, Inc. (NASDAQ:META) generated a record $164.5 billion in total revenue in 2024, reflecting a 22% growth compared to 2023. Its net income also rose by 59% to a record $62.3 billion for 2024, translating to $23.86 in EPS.\nIn addition, fiscal Q4 2024 saw the total number of ad impressions served across Meta Platforms, Inc.’s (NASDAQ:META) services increase by 6%, while the average price per ad increased by 14%.\nIn a report released on April 10, Thomas Champion from Piper Sandler maintained a Buy rating on Meta Platforms, Inc. (NASDAQ:META), with a price target of $610.00. The company takes the third spot on our list of the best blue chip stocks to buy according to billionaires.\nRowan Street Capital stated the following regarding Meta Platforms, Inc. (NASDAQ:META) in its Q4 2024 investor letter:\n“Meta Platforms, Inc. (NASDAQ:META): Investment Initiated: April 2018: Internal Rate of Return (IRR*): 22% *IRR represents the annualized rate of return on an investment, accounting for the timing and magnitude of cash flows over the holding period.\nOverall, META ranks 3rd on our list of the best blue chip stocks to buy according to billionaires. While we acknowledge the potential for META as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than META but trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nOne of the rare Wall Street analysts who is bearish on Meta Platforms further cut his price target for the stock, saying the Facebook parent company is \"starting to look vulnerable to a growth slowdown.\"  BNP Paribas Exane analyst Stefan Slowinksi cut his price target for Meta stock to 448 from a previous 505 in a client note late Tuesday.  Slowinski initiated coverage of Meta with the sell-equivalent call nearly 12 months ago.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-26_Magnificent Seven Stocks Sell Off_ Nvidia Plunges; Apple, Tesla Dive",
    "date": "",
    "content": "Title: Magnificent Seven Stocks Sell Off_ Nvidia Plunges; Apple, Tesla Dive\nDate: 2025-04-16 19:26\nURL: https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-sell.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nDubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first three months of 2025, however, performance for these mega-cap stocks has been negative thus far.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leane\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe five-year note led\nApple (AAPL) will effectively develop Apple Intelligence, while “new form factors” will boost the tech giant’s 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network. Zino has a $235 price target and a Buy rating on the shares. Apple’s Positive Catalysts The development of Apple Intelligence, which […]\nNissan will cut Japanese production of its top-selling U.S. model, the Rogue SUV, over May-July, said a person familiar with the matter, becoming the latest global automaker to alter manufacturing plans in response to new U.S. import tariffs.  U.S. President Donald Trump's decision to slap a 25% levy on cars built overseas has upended the global automotive supply chain.  Nissan, Japan's third-largest carmaker, is more exposed than some rivals.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries. Get Heard on the ...\nThe automaker joins a growing list of companies tapping the EV segment leader’s fast-charging technology.\nCatch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: TARIFF EXEMPTION: According to new guidance from U.S. Customs and Border Protection, President Trump has exempted smartphones, computers, and other electronic devices and components, including semiconductors, solar cells, flat panel TV displays, flash drives, and memory cards from the reciprocal\n(Bloomberg) -- Hertz Global Holdings Inc. shares had their biggest gain ever after CNBC reported that Pershing Square Capital Management had amassed a position of almost 20% in the beleaguered car rental company.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nJapanese manufacturers expressed improved business sentiment in April versus March though are bearish about their outlook over the next three months as they brace for the impact of sweeping U.S. import tariffs, a Reuters Tankan poll found.  The poll, which tracks the Bank of Japan quarterly business survey, yielded a manufacturers' business sentiment index of plus 9 in April, recovering from minus 1 in March.  The poll was conducted over April 2-11, just as U.S. President Donald Trump introduced a 25% tariff on car and truck imports and a further 24% tariff on Japanese goods - though the latter has been cut to 10% for 90 days.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-22_Meta CEO Mark Zuckerberg wraps up testimony in antitrust case",
    "date": "",
    "content": "Title: Meta CEO Mark Zuckerberg wraps up testimony in antitrust case\nDate: 2025-04-16 20:22\nURL: https://finance.yahoo.com/news/meta-ceo-mark-zuckerberg-wraps-202256571.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWASHINGTON (AP) — Meta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.\nZuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon. He took questions from Meta attorney Mark Hansen, who has argued that his client hardly has a monopoly in social media, as the FTC claims, and still faces stiff global competition.\nHansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nZuckerberg said he’s very focused on inventing new things, and understanding what other people are creating is a big part of the process. At any given point in his company’s history, he said, similar tones of concern could be found in emails about what other companies were doing better than his.\n“This is my job,\" Zuckerberg said. \"I need to understand what is going on, and I need to push our teams to move quickly” to learn about what is going on in a very competitive market.\nHansen questioned Zuckerberg about competition, particularly from TikTok, the popular social media site owned by Beijing-based company ByteDance, and the the growth of the video-sharing platform YouTube, which is owned by Alphabet.\nZuckerberg testified that people spend more time on YouTube than on Facebook and Instagram combined.\nWhile Hansen noted that the FTC doesn't consider YouTube to be a Meta competitor — because it doesn't have the same friend-sharing technology as Facebook — Zuckerberg said YouTube has built in ways to share videos.\nThe FTC contends Meta has used a monopoly in its technology that facilitates connecting with friends and family to generate enormous profits as consumer satisfaction has dropped. The case could force the tech giant to break off Instagram and WhatsApp, startups it bought more than a decade ago that have since grown into social media powerhouses.\nDaniel Matheson, the FTC's attorney who questioned Zuckerberg, has repeatedly brought up his own words in emails to associates before and after the acquisition of Instagram to try to show Zuckerberg was more interested halting Instagram's alarming growth than improving the product.\nUnder questioning by Hansen, Zuckerberg insisted that he had no intention of acquiring Instagram only to slow its development and end a threat. He said the focus was on \"having it run as an independent brand.”\nHansen noted that the FTC is making similar claims about the acquisition of the messaging app WhatsApp: that Zuckerberg was afraid of the company's potential.\n“It’s something I thought about,\" Zuckerberg said, noting the app's formidable capabilities, but he added that he later learned not to be worried because the owners didn't share the same vision or direction.\nHe said his interest in buying it was “the usage of it.”\n“I thought the app was important and valuable,” Zuckerberg said.\nThe trial, which is slated to last weeks, will feature other Big-Tech figures. After Zuckerberg, Sheryl Sandberg, Facebook's former chief operating officer, took the stand.\nThe trial is one of the first big tests of President Donald Trump’s FTC’s ability to challenge Big Tech. The lawsuit was filed against Meta — then called Facebook — in 2020, during Trump’s first term. It claims the company bought Instagram and WhatsApp to squash competition and establish an illegal monopoly in the social media market.\nFacebook bought Instagram — which was a photo-sharing app with no ads — for $1 billion in 2012.\nInstagram was the first company Facebook bought and kept running as a separate app. Until then, Facebook was known for smaller “acqui-hires” — a popular Silicon Valley deal in which a company purchases a startup as a way to hire its talented workers, then shuts the acquired company down. Two years later, it did it again with the messaging app WhatsApp, which it purchased for $22 billion.\nWhatsApp and Instagram helped Facebook move its business from desktop computers to mobile devices, and to remain popular with younger generations as rivals like Snapchat (which it also tried, but failed, to buy) and TikTok emerged.\nU.S. District Judge James Boasberg is presiding over the case. Late last year, he denied Meta’s request for a summary judgment and ruled that the case must go to trial.\nThe news comes a day after Nvidia warned of a $5.5 billion hit as Washington restricted exports of its AI processor tailored for China.  Intel, under new CEO Lip-Bu Tan, told clients last week that its chips would require a license for exporting to China if they have a total DRam bandwidth of 1,400 gigabytes (GB) per second or more, input-output (I/O) bandwidth of 1,100 GB per second or more, or a total of both of 1,700 GB per second or more, according to the report.  Intel's Gaudi series as well as Nvidia's H20 far exceed these requirements, the report said.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nOne of the rare Wall Street analysts who is bearish on Meta Platforms further cut his price target for the stock, saying the Facebook parent company is \"starting to look vulnerable to a growth slowdown.\"  BNP Paribas Exane analyst Stefan Slowinksi cut his price target for Meta stock to 448 from a previous 505 in a client note late Tuesday.  Slowinski initiated coverage of Meta with the sell-equivalent call nearly 12 months ago.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nMeta Platforms CEO Mark Zuckerberg testified this week at a high-stakes trial in Washington where the U.S. Federal Trade Commission is seeking to unwind Meta's acquisitions of prized assets Instagram and WhatsApp.  Zuckerberg in 2018 floated the idea of spinning off Instagram amid mounting pressure on Big Tech from antitrust regulators, in a sign of how seriously he took the threat of precisely the type of claims Meta now faces.  Seeking to explain messages in which he worried that Instagram was a competitive threat, Zuckerberg said the app's camera was simply better than camera features Meta had developed.\nApple stock fell more than 2% late Wednesday morning, once again putting its market capitalization below the $3 trillion mark after a brief rally.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-27_Zuckerberg_ Snapchat would have grown faster if it accepted $6B buyout offer",
    "date": "",
    "content": "Title: Zuckerberg_ Snapchat would have grown faster if it accepted $6B buyout offer\nDate: 2025-04-16 20:27\nURL: https://techcrunch.com/2025/04/16/zuckerberg-snapchat-would-have-grown-faster-if-it-accepted-6b-buyout-offer/?.tsrc=rss\nContent:\nLatest\t\n\n\n\n\t\tAI\t\n\n\n\n\t\tAmazon\t\n\n\n\n\t\tApps\t\n\n\n\n\t\tBiotech & Health\t\n\n\n\n\t\tClimate\t\n\n\n\n\t\tCloud Computing\t\n\n\n\n\t\tCommerce\t\n\n\n\n\t\tCrypto\t\n\n\n\n\t\tEnterprise\t\n\n\n\n\t\tEVs\t\n\n\n\n\t\tFintech\t\n\n\n\n\t\tFundraising\t\n\n\n\n\t\tGadgets\t\n\n\n\n\t\tGaming\t\n\n\n\n\t\tGoogle\t\n\n\n\n\t\tGovernment & Policy\t\n\n\n\n\t\tHardware\t\n\n\n\n\t\tInstagram\t\n\n\n\n\t\tLayoffs\t\n\n\n\n\t\tMedia & Entertainment\t\n\n\n\n\t\tMeta\t\n\n\n\n\t\tMicrosoft\t\n\n\n\n\t\tPrivacy\t\n\n\n\n\t\tRobotics\t\n\n\n\n\t\tSecurity\t\n\n\n\n\t\tSocial\t\n\n\n\n\t\tSpace\t\n\n\n\n\t\tStartups\t\n\n\n\n\t\tTikTok\t\n\n\n\n\t\tTransportation\t\n\n\n\n\t\tVenture\t\n\n\n\n\t\tEvents\t\n\n\n\n\t\tStartup Battlefield\t\n\n\n\n\t\tStrictlyVC\t\n\n\n\n\t\tNewsletters\t\n\n\n\n\t\tPodcasts\t\n\n\n\n\t\tVideos\t\n\n\n\n\t\tPartner Content\t\n\n\n\n\t\tTechCrunch Brand Studio\t\n\n\n\n\t\tCrunchboard\t\n\n\n\n\t\tContact Us\t\n\nPosted:\nDuring Meta’s antitrust trial this week, Meta CEO Mark Zuckerberg said that Snapchat would have grown faster if it accepted his company’s offer to buy the social network back in 2013, Business Insider reports.\nCourt documents revealed that Meta, then called Facebook, offered to buy Snapchat for $6 billion (reports at the time said that the dollar amount was $3 billion). In response to questioning from an FTC attorney, Zuckerberg said he thought Snapchat “wasn’t growing at the potential that it could” and that his company would have improved the app.\n“For what it’s worth, I think if we would have bought them, we would have accelerated their growth, but that’s just speculation,” Zuckerberg testified.\nThe government brought up the failed acquisition attempt to support its argument that Meta aims to preserve its dominance in the social media landscape by acquiring rivals, rather than competing with them directly. \nThe FTC is looking to force Meta to restructure or sell Instagram and WhatsApp, arguing that the company spent billions to acquire the apps to fend off Facebook competitors, creating an illegal monopoly.\nTopics\nSubscribe for the industry’s biggest tech news\nEvery weekday and Sunday, you can get the best of TechCrunch’s coverage.\nTechCrunch's AI experts cover the latest news in the fast-moving field.\nEvery Monday, gets you up to speed on the latest advances in aerospace.\nStartups are the core of TechCrunch, so get our best coverage delivered weekly.\nBy submitting your email, you agree to our Terms and Privacy Notice.\n© 2025 Yahoo.\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!"
  },
  {
    "title": "2025-04-16 20-54_Rare Bearish Meta Analyst Cuts Price Target, Says Tech Giant 'Starting To Look Vulnerable'",
    "date": "",
    "content": "Title: Rare Bearish Meta Analyst Cuts Price Target, Says Tech Giant 'Starting To Look Vulnerable'\nDate: 2025-04-16 20:54\nURL: https://finance.yahoo.com/m/612b78fa-757d-3eb4-bdc2-ad12dd2475e4/rare-bearish-meta-analyst.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOne of the rare Wall Street analysts who is bearish on Meta Platforms further cut his price target for the stock, saying the Facebook parent company is \"starting to look vulnerable to a growth slowdown.\" BNP Paribas Exane analyst Stefan Slowinksi cut his price target for Meta stock to 448 from a previous 505 in a client note late Tuesday. Slowinski initiated coverage of Meta with the sell-equivalent call nearly 12 months ago.\nContending that Meta (META) recently delivered “the best quarter in its history,” Jeffrey Small, the President of Arbor Financial, called on investors to “definitely buy the stock.” Small, who was speaking on Schwab Network, is also quite upbeat on Netflix (NFLX). More of Small’s Thoughts on META The financial advisor does not expect Meta’s profits […]\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock […]\nIn a blockbuster antitrust trial that’s just getting underway, the Federal Trade Commission is making its case that Meta (META) abused its social-networking dominance as part of a “buy or bury” strategy to squash emerging threats.\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nStruggling to make your monthly credit card payment? Your issuer can help you find a payment plan that gets you out of credit card debt faster. Here’s how.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-21_Meta boss Mark Zuckerberg finishes giving evidence in antitrust case",
    "date": "",
    "content": "Title: Meta boss Mark Zuckerberg finishes giving evidence in antitrust case\nDate: 2025-04-16 21:21\nURL: https://uk.finance.yahoo.com/news/meta-boss-mark-zuckerberg-finishes-212116202.html?.tsrc=rss\nContent:\nWe, Yahoo, are part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and AOL, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\n    If you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\n    If you would like to customise your choices, click 'Manage privacy settings'.\n\n    You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
  },
  {
    "title": "2025-04-16 21-32_Meta CEO Zuckerberg Defends Instagram, WhatsApp Acquisitions in FTC Antitrust Trial",
    "date": "",
    "content": "Title: Meta CEO Zuckerberg Defends Instagram, WhatsApp Acquisitions in FTC Antitrust Trial\nDate: 2025-04-16 21:32\nURL: https://finance.yahoo.com/news/meta-ceo-zuckerberg-defends-instagram-213221838.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMeta Platforms (META, Financials) Chief Executive Officer Mark Zuckerberg testified in a federal courtroom on Monday, defending the company's acquisitions of Instagram and WhatsApp as the Federal Trade Commission seeks to prove the deals were part of a strategy to eliminate competition in the social networking market.\nWarning! GuruFocus has detected 2 Warning Sign with META.\nThe trial, which began in Washington, marks a significant legal test for federal antitrust enforcement and could potentially force Meta to divest two of its most successful platforms. Zuckerberg, called as the first witness by the FTC, addressed internal communications that the agency says reveal concerns about Instagram's rapid growth and Meta's lack of progress on similar products before acquiring the company in 2012.\nFTC attorney Daniel Matheson presented messages showing Zuckerberg's dissatisfaction with the company's internal efforts to compete in the photo-sharing space. Zuckerberg responded that he was highlighting performance issues rather than expressing acquisition motives.\nWhen asked about Instagram's treatment after the acquisition, Zuckerberg denied neglect, stating that Meta invested substantially in the platform post-purchase. He also challenged the framing of discussions about focusing on Facebook over Instagram, arguing they were not formal strategies.\nThe FTC alleges that Meta followed a long-standing approach of acquiring emerging competitors instead of developing rival products, referencing a 2008 statement by Zuckerberg that it is better to buy than compete. The agency says this strategy created barriers for new entrants and stifled innovation, particularly as users migrated from desktop to mobile platforms.\nMeta, in its defense, argues that the market is far broader than the FTC defines, pointing to competitors such as TikTok, YouTube, Apple's iMessage, and X (formerly Twitter). The company maintains that regulators cleared the acquisitions over a decade ago and that the current lawsuit undermines finality in mergers and penalizes past decisions that were lawful at the time.\nMeta also noted in a recent court filing that the FTC must prove the company holds monopoly power todaynot in the pastunderscoring the growth of rival services over the years.\nU.S. District Judge James Boasberg, who denied Meta's request for summary judgment in late 2024, is overseeing the trial. If the court rules against Meta, the company could be required to divest Instagram and WhatsApp, a move that could cut its advertising revenue significantly.\nThe outcome could have broader implications for other technology firms, as similar antitrust actions are pending against Alphabet (GOOGL, Financials) and Amazon (AMZN, Financials), signaling a new phase in federal efforts to challenge the market dominance of large tech companies.\nThis article first appeared on GuruFocus.\nSome pointers for your click-to-message promotions.\nFrom Instagram Stories to Facebook Dating, Mark Zuckerberg’s expansionist strategy is at the center of a high-stakes antitrust case.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leane\nOne of the rare Wall Street analysts who is bearish on Meta Platforms further cut his price target for the stock, saying the Facebook parent company is \"starting to look vulnerable to a growth slowdown.\"  BNP Paribas Exane analyst Stefan Slowinksi cut his price target for Meta stock to 448 from a previous 505 in a client note late Tuesday.  Slowinski initiated coverage of Meta with the sell-equivalent call nearly 12 months ago.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Netflix, Inc. (NASDAQ:NFLX) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-14_Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial",
    "date": "",
    "content": "Title: Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial\nDate: 2025-04-16 22:14\nURL: https://finance.yahoo.com/news/meta-saw-tiktok-highly-urgent-221403450.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nOver a marathon three days of testimony, the Meta Platforms Inc. co-founder and chief executive officer clearly articulated how the social media market has evolved rapidly over time — which, if the judge agrees, could make it more difficult for the FTC to prove Meta dominates it.\nZuckerberg was composed, but occasionally evasive, when challenged to explain past emails and other private messages indicating a concerted effort to muscle out competitors.\nThose old messages and emails, gathered during the pre-trial discovery process, were more damning than his present-day testimony. The messages, often between Zuckerberg and other top Meta executives, painted a picture of an executive who was paranoid about his rivals and willing to buy competitors whenever possible.\nThe FTC is seeking to force Meta to sell off Instagram and WhatsApp, arguing that the two acquisitions have given Meta an illegal monopoly over parts of the social networking industry. Emails and documents presented at trial show that Meta, then called Facebook Inc., struggled to compete in the mobile app boom in the early 2010s, buying up successful competitors. The FTC said Meta bought the companies to eliminate direct competitive threats.\nMultiple Competitors\nZuckerberg and Meta’s lawyers, meanwhile, argued that Meta faces a wide array of competitors that fight for user attention, including ByteDance Ltd.’s TikTok, Google’s YouTube, Apple Inc.’s iMessage and Microsoft Corp.’s LinkedIn. On Wednesday, Zuckerberg said that TikTok, in particular, posed a “highly urgent” competitive threat when it sprang up in 2018.\n“We observed that our growth slowed down dramatically,” as TikTok gained popularity, Zuckerberg said Wednesday. “It was highly urgent, this has been a top priority for the company for several years.” Meta eventually rolled out a direct competitor, called Reels, that now drives a significant amount of video traffic for the company.\nZuckerberg was at times vague over his three days in court, and regularly disputed the FTC’s interpretations of his prior emails. As a leader, the way he communicated with staff was often blunt or harsh, and he spent time on the stand trying to add more nuance to what was written by his younger self. He occasionally clashed with the FTC’s lead lawyer, Daniel Matheson, who objected at one point that Zuckerberg wasn’t answering his questions.\nWhat’s unclear is how much weight those emails will ultimately have as US District Judge James Boasberg, who is presiding over the case, makes his decision. Meta has argued that the intent behind the purchases doesn’t matter, only whether those deals lead to consumer harm, which it disputes.\nBoasberg previously said the FTC will have a difficult time. Despite allowing the bulk of the case to proceed last November, Boasberg struck a skeptical tone about the FTC’s chances at trial. “Prevailing here, however, does not obscure the fact that the Commission faces hard questions about whether its claims can hold up in the crucible of trial,” the judge said. “Indeed, its positions at times strain this country’s creaking antitrust precedents to their limits.”\nBoasberg also said in a ruling shortly before the trial that the FTC must prove Meta is harming competition in the present day.\nSheryl Sandberg, the company’s former chief operating officer, followed Zuckerberg on the witness stand, facing sharp questioning from FTC lawyer Susan Musser.\nIf the FTC prevails, a spinoff of Instagram and WhatsApp would undo years of integration between the apps, disrupt two of the most popular digital consumer products in the world and potentially erase hundreds of billions of dollars in Meta’s market value. It would also raise serious questions about how the government evaluates and approves deals because the government allowed the transactions to go through at the time.\n‘Network Effects’\nPart of the FTC’s case involves the technical concept of “network effects,” meaning that the more users a company like Meta has, the more likely they are to retain a dominant position, because people are unlikely to switch to a service used by few people.\nBoasberg has remained largely silent during the questioning, but interjected during Zuckerberg’s testimony Wednesday to ask if network effects still really matter.\n“How much does it matter if your friends are on a particular platform if you can send content out of that platform? Why does it matter if your friends are there?” the judge said.\nZuckerberg said it doesn’t. “These apps now serve primarily as discovery engines,” he said. “People can take that content to messaging engines.”\nBigger Company\nUnder questioning by Meta lawyer, Mark Hansen, Zuckerberg refuted the FTC’s argument that Meta bought Instagram to bury a competitor. Instagram would not likely have been able to grow to the extent it has had it remained independent, he said. “Instagram has been built out into a much more vibrant service” as a result of the deal, Zuckerberg said.\nTaking a small online platform to a billion users and beyond is unlikely to happen without the backing of a larger company, he said. “Every company that has this level of scale is owned by a bigger company,” he said, citing TikTok and YouTube as examples.\nEarlier in the trial, it was revealed that Snap Inc.’s Evan Spiegel turned down a $6 billion acquisition offer from Facebook in 2013 for its Snapchat app. Zuckerberg said that the app would have grown more rapidly had it joined his company.\nZuckerberg sought to walk back some statements that he made in previous internal communications. He acknowledged that he sent a 2013 email saying that Facebook blocked advertising for messaging apps WeChat, Kakao and Line, in which he wrote the apps were “trying to build social networks to replace us.” On the stand this week, however, he said “it’s hard for me to characterize what their intent was.”\nMatheson also sought to show that Meta was aware of its antitrust risk years ago, including a possible breakup.\nHe displayed an email from 2018 in which Zuckerberg suggested that Meta should consider spinning off Instagram into a standalone company. “As calls to break up the big tech companies grow, there is a non-trivial chance that we will be forced to spin out Instagram and perhaps WhatsApp in the next 5-10 years anyway,” he wrote.\nAt one point, Zuckerberg was asked by Hansen to describe how he was evaluating the competitive threat posed by Instagram and others at the time of the deals. He referenced a quote from former Intel Corp. CEO Andy Grove: “Only the paranoid survive.”\n(Updates with color on Zuckerberg testimony starting in the first paragraph)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsAdjusted first-quarter profit fell to 4 cen\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsInterior Secretary Doug Burgum ordered the pause on\nUnderstanding what credit inquiries are, when they occur, and how they affect your credit can help you protect and improve your credit score.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-32_Spinning off Instagram, the decline of ‘friending’ and other takeaways from Mark Zuckerberg at the F",
    "date": "",
    "content": "Title: Spinning off Instagram, the decline of ‘friending’ and other takeaways from Mark Zuckerberg at the F\nDate: 2025-04-16 22:32\nURL: https://www.cnn.com/2025/04/16/tech/mark-zuckerberg-testimony-meta-ftc-trial?.tsrc=rss\nContent:\nMarkets \n\n\n\nHot Stocks \n\n\n\nFear & Greed Index \n\n\n\n\n            Latest Market News \n\n\n\n\n            Hot Stocks \n\n\n\nFollow:\n\n            CEO Mark Zuckerberg defended Meta’s acquisition of Instagram and WhatsApp on the stand this week during the start of trial over the blockbuster antitrust lawsuit brought by the Federal Trade Commission.\n    \n\n            But, it turns out, Zuckerberg predicted that he might find himself in this position years ago – and even proposed the idea of spinning off Instagram himself.\n    \n\n            That was one of several takeaways from more than 10 hours of testimony from Meta’s CEO, during which he pushed back on the FTC’s claims that the company has built an illegal “social network monopoly” by acquiring would-be rivals. The testimony painted a picture of how Zuckerberg views the competition and the company’s struggles to keep up with a rapidly evolving social media landscape that it argues has pushed users toward rivals like TikTok and YouTube.\n    \n\n            There’s a lot at stake for Meta, as it could be forced to offload Instagram and WhatsApp if it loses.\n    \n\n            Here are the biggest takeaways from Zuckerberg, who took the stand just before former Facebook Chief Operating Officer Sheryl Sandberg testified on Wednesday.\n    \n\n            In 2018, Zuckerberg raised concerns to other executives that “as calls to break up the big tech companies grow, there is a non-trivial chance that we will be forced to spin out Instagram and perhaps WhatsApp in the next 5-10 years anyway,” according to an email produced in court.\n    \n\n            In light of that, Zuckerberg suggested spinning off Instagram because the company’s “family of apps” structure could hurt Facebook. He added: “most companies actually perform better after they’ve been split up.”\n    \n\n            Of course, Meta didn’t end up spinning Instagram or WhatsApp off, and it’s now in court fighting the FTC to avoid having to do just that.\n    \n\n            Zuckerberg was indeed concerned that WhatsApp and Instagram could threaten Facebook’s dominance prior to buying the platforms, documents presented during FTC lawyer Daniel Matheson’s questioning suggested.\n    \n\n            In 2011, Zuckerberg appeared to realize that Facebook’s now-defunct Facebook Camera service was falling behind Instagram in functionality and popularity.\n    \n\n            “In the time it has taken us to get our act together on this, Instagram has become a large and viable competitor to us on mobile photos, which will increasingly be the future of photos,” Zuckerberg wrote in an email at the time. Facebook ended up acquiring Instagram for $1 billion in April 2012.\n    \n\n            In a 2012 email to then-COO Sandberg, Zuckerberg said then-Chief Technology Officer Mike Schroepfer’s teams “are executing well technically but their results this year are only okay so far.”\n    \n\n            “Messenger isn’t beating WhatsApp, Instagram was growing so much faster than us that we had to buy them for $1 billion,” he wrote in the email. “That’s not exactly killing it.”\n    \n\n            Then in 2013, Zuckerberg told then-growth head Javier Olivan he worried that WhatsApp would develop features similar to Facebook and Instagram and could “start winning in the US and other markets.” Olivan responded at the time he had been having “sleepless nights” worried that WhatsApp was “the real deal.” Facebook had also been concerned around that time that Google could acquire WhatsApp before it did.\n    \n\n            But Zuckerberg said in court Wednesday, during cross examination by Meta’s lawyer, that he thought it was “extremely unlikely” that WhatsApp would build competitive features after his first meeting with the platform’s co-founder Jan Koum.\n    \n\n            Facebook bought WhatsApp in 2014 for $19 billion.\n    \n\n            Zuckerberg also claimed that Meta made both platforms better for users by acquiring them.\n    \n\n            Zuckerberg originally built Facebook to connect and share content with friends and family. That’s the market that the FTC claims Meta now dominates.\n    \n\n            But Zuckerberg said that kind of use of his product has been declining.\n    \n\n            The FTC’s lawyer on Tuesday asked Zuckerberg about an internal document from 2022 that indicated “friending and friend sharing are losing steam.”\n    \n\n            “The amount that people are sharing with friends on Facebook, especially, has been declining,” Zuckerberg said. “Even the amount of new friends that people add … I think has been declining. But I don’t know the exact numbers.”\n    \n\n            But the future isn’t necessarily the content creator-filled feeds that have become the norm on Meta’s products. Instead, Zuckerberg said, messaging between individuals or friend groups is becoming more popular than sharing content on more public social media feeds.\n    \n\n            “Messaging has been growing dramatically, and sharing with friends in feeds has been declining,” he said Tuesday.\n    \n\n            It’s not just TikTok and Snapchat; Google’s YouTube platform is also a major rival to Facebook, the Meta CEO said on the stand this week.\n    \n\n            YouTube has indeed been capturing the attention of younger audiences; Pew Research found that nine in 10 US teens use YouTube, while Facebook usage has “steeply declined” over the past decade among that age group.\n    \n\n            Zuckerberg attributed this in part to a rise in “richer forms of media,” like video, as mobile networks have grown more capable in the last 10 years. “YouTube is the most competitive for creators,” he said Wednesday, referring to online personalities that garner huge followings through posting videos on platforms like YouTube, TikTok and Instagram.\n    \n\n            “My understanding … is that people spend more time on YouTube than on Facebook and Instagram combined, certainly more than either one independently,” he said.\n    \n\n            Still, Meta holds a firm grip on the social media market, especially in the US, according to Pew Research, where it operates a quarter of the most widely-used social media platforms.\n    \nMost stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited.\n© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.\nIf you switch this toggle to “no,” we will not sell or share your personal information with third parties for advertising targeted to this device. Please see our Privacy Center for additional preferences.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. You can set your browser to block or alert you about these cookies, but some parts of the site will not work."
  },
  {
    "title": "2025-04-16 22-39_Temu, Shein slash digital ads as tariffs end cheap shipping from China, data show",
    "date": "",
    "content": "Title: Temu, Shein slash digital ads as tariffs end cheap shipping from China, data show\nDate: 2025-04-16 22:39\nURL: https://finance.yahoo.com/news/temu-shein-slash-digital-ads-223910316.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Arriana McLymore\nNEW YORK (Reuters) - Chinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.\nThe online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.\nU.S. President Donald Trump's executive order earlier this month threatens this business. As of May 2, merchandise valued at under $800 shipped from China and Hong Kong will no longer be exempt from tariffs.\nTemu and Shein plan to raise product prices next week as the removal of this \"de minimis\" exemption on import tariffs increases costs for the companies. And they are cutting ad spending on most platforms, according to two digital marketing firms that measure ad spending.\nTemu's daily average U.S. ad spend on Facebook, Instagram, TikTok, Snap, X and YouTube declined a collective average of 31% in the two weeks from March 31 to April 13 compared with the previous 30 days, estimated Sensor Tower, which tracks such spending.\nShein's daily average U.S. ad spend on Facebook, Instagram, TikTok, YouTube and Pinterest fell a collective average of 19% over the same period, it added.\nMeta declined to comment. Google, Shein and Temu were not immediately available for comment.\nTemu has sharply reduced ads on Google Shopping since April 12 after a marked ramp-up during the first quarter, said Mark Ballard, director of digital marketing research at Tinuiti.\n(Reporting by Arriana McLymore in New York City; Editing by Richard Chang)\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsAdjusted first-quarter profit fell to 4 cen\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leane\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsInterior Secretary Doug Burgum ordered the pause on\nUnderstanding what credit inquiries are, when they occur, and how they affect your credit can help you protect and improve your credit score.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]