[
  {
    "title": "2025-04-15 20-08_Is Apple Inc. (AAPL) The Best American Tech Stock to Buy Now_",
    "date": "",
    "content": "Title: Is Apple Inc. (AAPL) The Best American Tech Stock to Buy Now_\nDate: 2025-04-15 20:08\nURL: https://finance.yahoo.com/news/apple-inc-aapl-best-american-200819194.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently compiled a list of the 14 Best American Tech Stocks To Buy Now. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other American tech stocks.\nAmerican stocks moved up a bit on Monday, April 14 as investors focused on news about tech companies getting a break from President Trump’s tariffs. The S&P 500 rose by 0.8%, the tech-heavy Nasdaq rose by 0.6%, and the Dow Jones Industrial Average increased by about 0.7%.\nREAD ALSO: 11 Best American Energy Stocks to Buy Now and 10 Best Stocks Under $10 to Buy Now.\nIn recent days, President Trump and his advisers have given mixed signals on the future of tariffs on China and on specific industries. Over the weekend, big American tech companies scored a victory when it was revealed that the US had not put tariffs on smartphones, computers, and other consumer electronics.\nHowever, on Sunday, US Commerce Secretary Howard Lutnick stated that these electronics would soon be covered under new tariffs, which would be different from those imposed on specific countries. President Trump also posted on social media that there would be “no exception” for these products. He also said that the government is looking at semiconductors and the entire electronics supply chain in the upcoming National Security Tariff Investigations.\nLast week was the best week for the major indexes since at least 2023. However, with all this uncertainty, Wall Street is getting ready for another week of potential tariff-fueled ups and downs.\nTo compile our list of the 14 best American tech stocks to buy now, we used stock screeners from Finviz and Yahoo Finance to find the largest American technology companies. We sorted our results based on market capitalization and picked the top 30 American stocks. Next, we focused on the 14 stocks most favored by institutional investors. Data for the hedge fund sentiment surrounding each stock was taken from Insider Monkey’s Q4 2024 database of more than 1,000 elite hedge funds. Finally, the 14 best American tech stocks to buy now were ranked in ascending order based on the number of hedge funds holding stakes in them as of Q4 2024.\nWhy do we care about what hedge funds do? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter's strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) is an American multinational technology company that designs, manufactures, and markets consumer electronics, software, and services. The company is best known for its products like the iPhone, iPad, and Mac computers, as well as services such as the App Store, iCloud, and Apple Pay. Apple Inc. (NASDAQ:AAPL) ranks among the best American stocks to invest in.\nOn April 9, Jefferies upgraded Apple Inc. (NASDAQ:AAPL) from “Underperform” to “Hold” but lowered the price target to $167.88 from the previous $202.33. This adjustment reflects concerns about the potential impacts of a global recession on iPhone demand and the expected price increases for future iPhone models. The analyst noted that Apple Inc. (NASDAQ:AAPL) is expected to be exempted from US tariffs because of its commitment to invest $500 billion in the US over the next four years. The analyst believes that the company will make further investments in US manufacturing, possibly including iPhone production. Despite this, a growing risk of a global recession could have a negative impact on iPhone demand. Jefferies has lowered its iPhone shipment forecasts by 3.6%, 7.7%, and 5.5% for fiscal years 2025, 2026, and 2027 respectively, which leads to a reduction in projected revenue by 2%, 4.1%, and 3.5% for the same fiscal years. The firm anticipates that Apple Inc. (NASDAQ:AAPL) will raise iPhone prices by $50 in 2026 for the iPhone 18 and by $100 in 2027 for the iPhone 19. These increases in price are expected to be mainly driven by higher hardware costs. Following these revisions, Jefferies now estimates earnings per share (EPS) estimates for Apple Inc. (NASDAQ:AAPL) lower than market consensus by 2.5%, 8.5%, and 3.4% for fiscal years 2025, 2026, and 2027, respectively.\nOverall, AAPL ranks 6th on our list of the best American tech stocks to buy now. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nApple (AAPL) closed at $202.14 in the latest trading session, marking a -0.19% move from the prior day.\nTo the relief of anyone with an aging iPhone, the Trump administration exempted smartphones, computers, and other tech products from its punishing tariffs on Chinese imports over the weekend.  While Apple (NASDAQ: AAPL) has geographically diversified its supply chain, the company still relies heavily on Chinese manufacturing partners for its devices.  Absent any special treatment, prices in the U.S. on Apple products would have likely risen substantially due to the tariffs.\nWe recently published a list of 12 Best Gambling Stocks to Buy According to Analysts. In this article, we are going to take a look at where DraftKings Inc. (NASDAQ:DKNG) stands against other best gambling stocks to buy according to analysts. Gambling stocks include companies that own, run, or manage lawful gambling activities and events […]\nBP expects weak gas trading and a $4B rise in debt in Q1. Refining margins and oil output offer partial support amid its shift to fossil fuels.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 21-31_When Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Cos",
    "date": "",
    "content": "Title: When Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Cos\nDate: 2025-04-15 21:31\nURL: https://finance.yahoo.com/news/apples-tim-cook-revealed-real-213129145.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple Inc. (NASDAQ:AAPL) CEO Tim Cook previously explained the company’s decision to continue manufacturing its products in China, refuting the widespread belief that it’s due to low labor costs.\nWhat Happened: A 2024 video of Tim Cook has resurfaced, providing insights into Apple’s manufacturing choices amid the ongoing U.S.-China tariff war. In the video, posted on X by CNBC TV18 reporter Nigel D’Souza, Cook dismissed the idea that Apple’s manufacturing in China is due to low labor costs, stating, “China stopped being a low labor cost company many years ago.”\nTrending: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones. You can invest today for just $0.26/share with a $1000 minimum.\nInstead, he emphasized China’s unparalleled skilled labor concentration in one location and advanced tooling capabilities as the primary reason. Cook emphasized that “the products that we do require truly advanced tooling.”\n\nOn that note, Cook emphasized the sharp difference in vocational skills between the US and China. The Apple CEO stated, \"In the US, you could have a meeting of tooling engineers, and I’m not we could fill the room.\" In China, however, \"you could fill multiple football fields.... Hence, the vocational expertise in China is very deep”.\nWhy It Matters: The U.S.-China tariff war has put pressure on American companies to shift production back home. Earlier this month, a leading tech analyst predicted a significant price hike for Apple iPhones if manufacturing shifts to the U.S., potentially reaching around $3,500. This is due to the complexity of recreating the production ecosystem that currently exists in Asia.\nSee Also: Maker of the $60,000 foldable home has 3 factory buildings, 600+ houses built, and big plans to solve housing — this is your last chance to become an investor for $0.80 per share.\nFurthermore, experts opined that Apple’s supply chain could face major disruptions due to new reciprocal tariffs. Apple had temporarily dodged steep tariffs on Chinese-made electronics following an exemption granted by Trump.\nA recent report also suggested that Apple completed an urgent logistics operation, transporting five planeloads of iPhones and other products from manufacturing centers in India and China to the U.S. within 72 hours, in a bid to beat President Donald Trump's new 10% reciprocal tariff on imports.\nGiven these complexities, Cook’s emphasis on China’s skilled labor and advanced tooling capabilities provides a clearer understanding of Apple’s manufacturing decisions.\nApple has lost over $500 billion in market capitalization since the Apr 2 ‘Liberation Day’ tariffs. On Friday, the stock climbed 4.06% to close at $198.15, as per Benzinga Pro.\nApple holds a momentum rating of 62.11% and a quality rating of 86.50%, according to Benzinga's Proprietary Edge Rankings. For an in-depth report on more stocks and insights into growth opportunities, sign up for Benzinga Edge.\nRead Next:\nAre you rich? Here’s what Americans think you need to be considered wealthy.\nWarren Buffett once said, \"If you don't find a way to make money while you sleep, you will work until you die.\" Here’s how you can earn passive income with just $100.\nImage via Shutterstock\nDisclaimer: This content was partially produced with the help of AI tools and was reviewed and published by Benzinga editors.\nSend To MSN:  Send to MSN\nUp Next: Transform your trading with Benzinga Edge's one-of-a-kind market trade ideas and tools. Click now to access unique insights that can set you ahead in today's competitive market.\nGet the latest stock analysis from Benzinga?\nThis article When Apple's Tim Cook Revealed The Real Reason iPhones Are Made In China—And It's Not 'Low Labor Costs': 'China Stopped Being A Low-Wage Country Years Ago' originally appeared on Benzinga.com\n© 2025 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.\nWith so much uncertainty hovering over markets and the global economy, investors are clamoring for guidance from the \"Oracle of Omaha,\" Warren Buffett.  Unfortunately, Buffett recently stated he wouldn't comment on the current tariff-related negotiations and/or economic fallout until the Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B) annual meeting in early May.  While one might think the champion of free markets has a very clear stance on the market-distorting characteristics of tariffs, Buffett is also not a fan of the U.S. trade deficit.\nPresident&nbsp;Donald Trump&nbsp;has called on China to reach out to him in order to kick off negotiations to resolve the escalating trade fight between the world's two largest economies. As the US warns \"the ball is in China's court,\"&nbsp;China Southern Airlines has suspended the sale of 10 used Boeing Dreamliners. Bloomberg's White House Correspondent Kate Sullivan reports that China is expected to remain defiant in the face of an escalating trade fight.\nOn April 2, President Trump announced plans to impose tariffs on all physical products imported into America, which sent investors flocking to safe-haven assets like cash on fears of a global economic slowdown.  Shares of Nvidia and Alphabet are down by more than 20% from their all-time highs, yet most of the products they sell are either exempt from President Trump's tariffs or were never impacted to begin with.\nIt's been a rough start to 2025, with the S&P 500 having its worst quarter since 2022 followed by escalating trade tensions in April.  Investors looking for broad-based exposure to the utilities sector might want to consider an exchange-traded fund (ETF) like the Vanguard Utilities ETF (NYSEMKT: VPU).  Utilities are the second-best-performing sector year to date and one of just two sectors that are up slightly compared to the S&P 500's more than 8% drop.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 21-45_Here's Why Apple (AAPL) Fell More Than Broader Market",
    "date": "",
    "content": "Title: Here's Why Apple (AAPL) Fell More Than Broader Market\nDate: 2025-04-15 21:45\nURL: https://finance.yahoo.com/news/heres-why-apple-aapl-fell-214514111.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL) closed the latest trading day at $202.14, indicating a -0.19% change from the previous session's end. This change lagged the S&P 500's daily loss of 0.17%. Elsewhere, the Dow saw a downswing of 0.39%, while the tech-heavy Nasdaq depreciated by 0.05%.\nThe maker of iPhones, iPads and other products's shares have seen a decrease of 5.36% over the last month, surpassing the Computer and Technology sector's loss of 6.26% and falling behind the S&P 500's loss of 3.94%.\nMarket participants will be closely following the financial results of Apple in its upcoming release. The company plans to announce its earnings on May 1, 2025. The company is forecasted to report an EPS of $1.60, showcasing a 4.58% upward movement from the corresponding quarter of the prior year. Meanwhile, our latest consensus estimate is calling for revenue of $93.5 billion, up 3.03% from the prior-year quarter.\nFor the full year, the Zacks Consensus Estimates project earnings of $7.20 per share and a revenue of $404.46 billion, demonstrating changes of +6.67% and +3.43%, respectively, from the preceding year.\nFurthermore, it would be beneficial for investors to monitor any recent shifts in analyst projections for Apple. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\nOur research reveals that these estimate alterations are directly linked with the stock price performance in the near future. To utilize this, we have created the Zacks Rank, a proprietary model that integrates these estimate changes and provides a functional rating system.\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the last 30 days, the Zacks Consensus EPS estimate has moved 0.85% lower. Apple is currently sporting a Zacks Rank of #3 (Hold).\nInvestors should also note Apple's current valuation metrics, including its Forward P/E ratio of 28.12. This expresses a premium compared to the average Forward P/E of 8.99 of its industry.\nIt's also important to note that AAPL currently trades at a PEG ratio of 2.14. Comparable to the widely accepted P/E ratio, the PEG ratio also accounts for the company's projected earnings growth. As of the close of trade yesterday, the Computer - Micro Computers industry held an average PEG ratio of 1.46.\nThe Computer - Micro Computers industry is part of the Computer and Technology sector. This industry currently has a Zacks Industry Rank of 85, which puts it in the top 35% of all 250+ industries.\nThe Zacks Industry Rank evaluates the power of our distinct industry groups by determining the average Zacks Rank of the individual stocks forming the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nTo follow AAPL in the coming trading sessions, be sure to utilize Zacks.com.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nApple Inc. (AAPL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe recently compiled a list of the 14 Best American Tech Stocks To Buy Now. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against the other American tech stocks. American stocks moved up a bit on Monday, April 14 as investors focused on news about tech companies […]\nWith a better price performance and attractive valuation metrics, IBM is relatively better placed than MSFT at the moment.\nMarch retail sales jumped as consumers rushed to buy autos and Apple iPhones before the impact of Trump tariffs. The S&P 500 fell.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 08-35_Got $2,000 to Invest_ This Is 1 of the Smartest Vanguard ETFs to Buy and Hold for 20 Years.",
    "date": "",
    "content": "Title: Got $2,000 to Invest_ This Is 1 of the Smartest Vanguard ETFs to Buy and Hold for 20 Years.\nDate: 2025-04-16 08:35\nURL: https://www.fool.com/investing/2025/04/16/got-2000-to-invest-this-is-1-of-the-smartest-vangu/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=67864c4e-63a5-432f-b2d8-ddbe92b84b27&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nVanguard has made it easy for anyone to invest in the stock market. The company offers a growing list of exchange-traded funds (ETFs) that allow you to invest broadly in the stock market or focus on specific themes or types of stocks. \nOne of its many funds is the Vanguard Dividend Appreciation ETF (VIG -1.51%). It's one of the smartest funds to buy because it tracks the performance of companies that grow their dividends. Historically, dividend growth stocks have delivered the highest total returns with the lowest risk. That makes this a great fund to buy and hold for 20 years to grow your wealth. \nThe Vanguard Dividend Appreciation ETF aims to track the performance of the S&P U.S. Dividend Growers Index. The managers of that index designed it to measure the performance of U.S. companies that have consistently increased their dividends for at least the past 10 years. Of note, it excludes the top 25% highest-yielding dividend stocks because these companies typically have higher dividend payout ratios and lower growth profiles. Those characteristics put them at a higher risk of stopping growth or reducing their dividends in the future. \nThe ETF's focus on companies that grow their dividends and are at lower risk for a future reduction is worth noting, given the data on dividend stocks by their policies: \nDividend Policy\nAverage Annual Total Returns\nDividend growers and initiators\n10.2%\nDividend payers\n9.2%\nNo change in dividend policy\n6.8%\nDividend cutters and eliminators\n(0.9%)\nDividend non-payers\n4.3%\nEqual-weighted S&P 500 index\n7.7%\nData sources: Ned Davis Research and Hartford Funds. \nAs that table shows, dividend growers have produced the best returns among dividend stocks by policy while also significantly outperforming non-dividend-payers. \nThe ETF has delivered similarly strong returns throughout its history. Since its inception in 2006, the ETF has produced a 9.6% annualized return. Meanwhile, its return over the past 10 years is 11.3%. To put that into perspective, $2,000 invested into the fund at its inception nearly 20 years ago would have grown into about $12,500 today at a 9.6% average annual return. \nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nThe Vanguard Dividend Appreciation ETF currently holds 337 stocks. It has a higher weighting toward the biggest dividend growth stocks by market cap. Currently, the top 10 holdings comprise nearly 32% of its assets. \nHowever, these are the cream of the crop when it comes to dividend growth stocks. For example, the fund's top holding is tech titan Apple (AAPL -3.82%), at 4.9% of the fund. The company has increased its payout for 14 straight years while growing it at a nearly 8% annual rate over the past decade. While Apple currently offers a low dividend yield of 0.5%, that payout is extremely safe. Apple produced nearly $30 billion in cash from operating activities last quarter, easily covering its $3.8 billion dividend outlay. Meanwhile, with its earnings up 10% last quarter and growing, Apple should have no trouble continuing to increase its dividend in the future. \nApple is just one of the many high-quality dividend growth stocks among the fund's top 10 holdings. Other notable names are Visa, with 16 years of dividend increases; ExxonMobil, with 42 years of dividend growth; and Walmart, with 52 years of increasing its dividend. \nOne final thing to point out is that because the fund focuses on dividend growth and excludes higher-yielding dividend stocks, it has a lower dividend yield than some other dividend-focused ETFs: It recently yielded around 1.7%. However, the fund should still deliver attractive total returns in the future as the underlying companies grow their earnings and dividends, which should steadily increase their stock prices. \nDividend growth stocks have historically outperformed other dividend stocks and dividend non-payers over the long term. Given its focus on dividend growth stocks, buying the Vanguard Dividend Appreciation ETF is wise. The fund should deliver strong total returns over the decades, which should enable investors to meaningfully increase their wealth by buying and holding this fund. \n\n \n\nBefore you buy shares in the Vanguard Dividend Appreciation ETF, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and the Vanguard Dividend Appreciation ETF wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nMatt DiLallo has positions in Apple and Visa and has the following options: short May 2025 $275 calls on Apple. The Motley Fool has positions in and recommends Apple, Vanguard Dividend Appreciation ETF, Visa, and Walmart. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 09-14_Television could go the way of newspapers if the US economy tips into recession, analyst warns",
    "date": "",
    "content": "Title: Television could go the way of newspapers if the US economy tips into recession, analyst warns\nDate: 2025-04-16 09:14\nURL: https://finance.yahoo.com/news/television-could-go-the-way-of-newspapers-if-the-us-economy-tips-into-recession-analyst-warns-091448700.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAs recession fears mount following Trump's sweeping new tariffs, US media and internet companies face a potential multibillion-dollar hit to ad spending that could potentially deliver the death knell to traditional television advertising.\n\"Given the ongoing secular headwinds facing the linear TV ecosystem, we worry that television could mirror the fate of radio and newspapers during past recessions,\" MoffettNathanson analysts Michael Nathanson and Robert Fishman warned in a report last week.\nIf a recession were to materialize, MoffettNathanson estimates US ad spending would come in $45 billion below current forecasts.\nThat estimate would mean an 11.5 percentage point blow to top-line revenue growth across the media landscape. Digital platforms would bear the brunt, realizing $29 billion less in ad spending, with TV facing a $12 billion shortfall.\nRead more: What is a recession, and how does it impact you?\nEven before the Trump administration's April 2 announcement of a 10% baseline tariff on nearly all foreign imports, MoffettNathanson said companies were already in wait-and-see mode, holding back ad spending while trade policy remained unclear.\nRead more: The latest news and updates on Trump's tariffs\nIt's a stark reversal from the significant spending rebound the advertising industry enjoyed in 2024 on the back of record political spending, a booming economy, and lingering momentum from the post-pandemic digital and e-commerce boom.\nBut as MoffettNathanson argued, the tone has shifted from \"softly pessimistic\" to \"significantly more bearish.\"\n\"The shift is driven largely by the current administration's unorthodox and aggressive approach to addressing 'unfair' trade practices,\" the analysts said. \"The heightened uncertainty following the tariff announcement has led us to adopt a more cautious outlook for advertising.\"\nCompanies heavily reliant on advertising — like Meta (META), Snap (SNAP), and the Trade Desk (TTD) — would be hit \"disproportionately harder,\" with projected stock declines of at least 30% each, the firm estimates.\nDigital players with variable cost structures and less reliance on advertising, like Netflix (NFLX) and Alphabet (GOOG, GOOGL), are \"better positioned to weather the storm.\"\nMeanwhile, connected TV player Roku (ROKU) would see the biggest relative impact, flipping from positive earnings in 2024 to a net loss in both 2025 and 2026, according to MoffettNathanson's projections.\nParamount could also reverse recent positive earnings trends, and other traditional media names like Disney (DIS), Fox (FOX), and Warner Bros. Discovery (WBD) would likely see earnings per share (EPS) declines of around 20% to 25%.\nAs earnings season kicks off, some clarity on the outlook may emerge. But if a US recession takes hold, a drop in ad spending could send lasting ripple effects across a broad spectrum of companies, regardless of their size.\nAs a UBS analyst said in a separate client note sent Tuesday: \"Advertising is usually the first to go in an economic downturn as companies look to cut expenses.\"\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance\nThe Trump administration plans to eliminate the IRS' Direct File program, an electronic system for filing tax returns directly to the agency for free, according to two people familiar with the decision.  The program developed during Joe Biden's presidency was credited by users with making tax filing easy, fast and economical.  The program had been in limbo since the start of the Trump administration as Elon Musk and the Department of Government Efficiency have slashed their way through the federal government.\nThe spring housing season is off to a shaky start as tariff concerns rattle builder sentiment.\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nAnalysts remain optimistic about Netflix's resilience amid economic tariff-related uncertainties ahead of its Q1 earnings, putting the related ETFs in focus.\nWhat to expect from Netflix's first-quarter earnings and how will results impact Wall Street sentiment?\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Netflix, Inc. (NASDAQ:NFLX) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nStocks sold off on Wednesday as uncertainty around President Trump's policies once again prompted investor caution.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 12-08_How the U.S.-China Trade War Benefits Applied Materials Stock (AMAT)",
    "date": "",
    "content": "Title: How the U.S.-China Trade War Benefits Applied Materials Stock (AMAT)\nDate: 2025-04-16 12:08\nURL: https://finance.yahoo.com/news/u-china-trade-war-benefits-120800147.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPresident Trump’s tariffs have overshadowed Applied Materials (AMAT) stock, stirring up short-term headaches for the semiconductor equipment titan. Despite a recent rebound, shares trade ~30% below their 52-week highs, with the decline somewhat justified. Indeed, higher costs and global trade tensions could dent the company’s near-term prospects. Still, the effort to restore chip manufacturing to U.S. soil promises a lucrative payoff in the long run. Given this narrative and AMAT’s unmatched role in chip production, I’m bullish on the stock.\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities using  Tipranks' Stock Screener.\nEven with a 90-day tariff pause on semiconductors and electronics announced last Friday, it’s clear that Applied Materials faces choppy waters. The remaining 10% global tariff hike will undoubtedly damage chipmakers like Intel (INTC) and TSMC (TSM), who depend on imported wafers, gases, and components. This will squeeze their budgets, potentially freezing orders for AMAT’s high-end tools.\nTake its $20 million etching systems, for instance, or its deposition chambers, critical for cutting-edge chips. China’s retaliatory tariffs on U.S. goods further threaten AMAT’s foothold in a market that, for context, accounted for 30% of last year’s $26.5 billion in revenue.\nThe uncertainty is already biting. A single delayed fab can wipe out $500 million in AMAT orders, and with Asian chipmakers like Samsung rethinking expansion amid tariff chaos, you can see why the market might think that AMAT’s multi-billion-dollar backlog risks stalling. And then you have a story about Trump’s looming semiconductor-specific tariffs, which the market expects to hit within months. Undoubtedly, they keep customers jittery, as they are reluctant to greenlight projects when costs could spike overnight. It’s like a waiting game where hesitation makes more sense than action, leaving AMAT to tread carefully through a murky year.\nIf AMAT’s outlook wasn’t already wobbly, the company’s supply chain isn’t immune. Tariffs on niche materials, like high-purity silicon or rare-earth metals, could inflate costs, forcing the company to either absorb the hit or pass it on, risking customer pushback. So, for now, AMAT stock is facing pressure on multiple fronts.\nDespite the potential headwinds I just mentioned, investors should keep their minds open and consider that a bullish case might be hiding in the shadows. If Trump’s dream of a U.S. chipmaking renaissance pans out, maybe, just maybe, Applied Materials could be the golden goose. Tariffs are designed to lure chipmakers to American soil, and AMAT, the king of deposition and etching tools, is primed to cash in.\nNew fabs in places like Ohio or Arizona would devour AMAT’s machines, each plant potentially funneling $1 billion in orders for systems that layer and sculpt chips for AI, EVs, and defense. The CHIPS Act’s $52 billion war chest already greases the wheels, and tariffs could kneecap foreign rivals like ASML (ASML), whose scanners might face a looming 20% import tax with further increases on the table.\nBeyond fab construction, AMAT is also poised to ride the wave of state-of-the-art packaging and AI chip demand. Tariffs will likely incentivize U.S. production of complex chipsets, including Nvidia’s (NVDA) GPUs or Apple’s (AAPL) M-series, requiring AMAT’s advanced 3D stacking and hybrid bonding tools.\nIndustry projections suggest advanced packaging revenue could hit $79 billion by 2034. AMAT’s early lead in this niche could drive billions in orders as domestic firms like Intel scale up to compete globally. If tariffs lock in this shift, AMAT’s role as a tech enabler makes it a leader in America’s chip revival.\nAfter last week’s selloff, Applied Materials’ stock seems compelling, especially assuming the bullish case plays out. Down 30% from its 52-week peak, the stock trades at about 15x forward earnings. Analysts have trimmed their forecasts, yet AMAT is still set to churn out $6 billion in free cash flow this year, which is not too bad compared to last year’s ~$7 billion, considering the circumstances. Its $1.63 billion net cash pile also adds flexibility liquidity-wise, letting AMAT invest while peers might think twice about spending these days.\nOn Wall Street, analysts appear quite bullish on GM stock. The stock has a Moderate Buy consensus rating based on 16 Buy, four Hold, and one Sell ratings over the past three months. AMAT’s average price target of $203.87 implies a 41% upside potential over the next twelve months, aligning with my view that the stock is currently undervalued.\nIn the grand scheme, short-term tariff troubles may be a speed bump for Applied Materials. The industry giant’s critical role in the semiconductor production chain positions it to benefit significantly if U.S. chipmaking takes off. Yes, near-term volatility is real, with delayed fab projects, hesitance to spend, and potential cost hikes weighing on the stock.\nYet these hurdles could also fast-track a domestic manufacturing boom, funneling billions toward AMAT’s advanced tools for AI, 3D packaging, and beyond. For these reasons, I believe that AMAT remains a long-term play worth watching, especially for politically savvy tech-sector investors.\nDisclaimer & DisclosureReport an Issue\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where Applied Materials, Inc. (NASDAQ:AMAT) stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump […]\nAMD said Tuesday that some of its central-processing units for data centers will be made at Taiwan Semiconductor Manufacturing’s site in Arizona.\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Advanced Micro Devices, Inc. (NASDAQ:AMD) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-20_Retail Sales Jump Most In Two Years In Rush To Buy Autos, iPhones Before Trump Tariffs; S&P 500 Fall",
    "date": "",
    "content": "Title: Retail Sales Jump Most In Two Years In Rush To Buy Autos, iPhones Before Trump Tariffs; S&P 500 Fall\nDate: 2025-04-16 13:20\nURL: https://finance.yahoo.com/m/3267f0f7-fec6-330e-a9c2-29d08677f4bb/retail-sales-jump-most-in-two.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMarch retail sales jumped as consumers rushed to buy autos and Apple iPhones before the impact of Trump tariffs. The S&P 500 fell.\nFor now, he said in remarks prepared for delivery at the Economic Club of Chicago, the Fed could keep its benchmark interest rate steady \"to wait for greater clarity before considering any adjustments to our policy stance.\"  Repeating comments made earlier this month, the Fed chief noted that the impact of those and other policy changes \"are still evolving,\" but likely to be \"larger than anticipated.\"  When asked if there’s such a thing as a Fed put for the stock market, his answer was ‘no’.\nWASHINGTON (Reuters) -U.S. retail sales increased by the most in more than two years in March as households stepped up purchases of motor vehicles and a range of other goods to avoid higher prices from tariffs, likely barely keeping the economy afloat in the first quarter.  Economists' gross domestic product growth estimates for the January-March quarter remained stuck below a 0.5% annualized rate, keeping intact investors' fears of stagnant growth and high inflation, commonly referred to as stagflation.  Federal Reserve Chair Jerome Powell at an Economic Club of Chicago event on Wednesday acknowledged the economy appeared to have slowed last quarter, noting \"inflation is likely to go up as tariffs find their way and some part of those tariffs come to be paid by the public.\"\n(Reuters) -Federal Reserve Chair Jerome Powell suggested on Wednesday that hopes the central bank will step in to tamp down on market volatility are likely misplaced.  Asked if the Fed would intervene to counter sharp declines in the stock market, Powell said \"I'm going to say no, with an explanation.\"  \"What I think is going on in markets is markets are processing what's going on, markets are struggling with a lot of uncertainty and that means volatility,\" Powell said in an appearance in Chicago.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nStocks opened lower on Wednesday after the latest trade headlines hit Nvidia and other tech stocks. The Dow Jones Industrial Average was down 310 points, or 0.8%. The S&P 500 was down 1.4%. The Nasdaq Composite was down 2.\nThe US government's export restrictions on a chip made by Nvidia (NVDA) could be \"disruptive\" to its\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-31_Jim Cramer_ Apple Inc. (AAPL) Faces an “Existential” China Risk and Is “A Loser to Samsung”",
    "date": "",
    "content": "Title: Jim Cramer_ Apple Inc. (AAPL) Faces an “Existential” China Risk and Is “A Loser to Samsung”\nDate: 2025-04-16 13:31\nURL: https://finance.yahoo.com/news/jim-cramer-apple-inc-aapl-133149191.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other key stocks that Jim Cramer analyzes.\nIn his latest appearance on CNBC’s Squawk on the Street, Jim Cramer reacted to the partial tariff exemptions announced by the White House, interpreting them not as a full retreat, but as a strategic pause designed to avoid punishing American companies. He suggested the administration was being careful not to hand over competitive advantages to Southeast Asian rivals, particularly Samsung:\n“So what I saw today, and not to be facetious, but what I see is people saying, you know what, we’ve seen the downside. Maybe we can test it again. But the president has, I don’t want to say blink, because that’s nonsense. What the president did was say, OK, look, we’re not going to continue to punish American companies and give the green light to Korea. I don’t know if you heard Lutnick’s words. He was very specific. Southeast Asia. That’s Samsung. They didn’t want to give the ball to Samsung.”\nREAD ALSO: Jim Cramer Hints at a Bigger Agenda Behind Tariffs and Breaks Down These 7 Stocks and Jim Cramer Reacts to the Surprise Market Surge and Highlights 8 Key Stocks.\nTurning to currency dynamics, Cramer pushed back on what he sees as misplaced panic over a weakening U.S. dollar. Instead, he argued that a softer dollar actually benefits American multinationals and gives long-needed relief to CFOs who’ve spent years blaming currency strength for lost market share:\n“Well, look, I’m not so certain I’m going to do a little contrary stuff on the dollar here. When we listen to conference calls, for the last four years, all we hear about is it would have been so much better if the dollar weren’t so strong. We keep losing share, the dollar’s too strong. Suddenly the dollar’s weaker, and now we start hearing all the downside, what, the bonds? I mean, I’m almost thinking that, I’m gonna put this out there, the people who are saying that it’s the end of the world, that the dollar is weaker, I think they have to go do some work boots on the ground. […] So suddenly the dollar’s weaker and we are petrified? These are people who have an agenda. And their agenda is to say, you know what matters more than anything else? Our hegemony from a strong dollar. And I don’t get it. If you’re in our business of picking stocks, you’re sick and tired of hearing CFOs say, we are done. We’ve got to stop this dollar rise.”\nCramer also gave his opinion about the rhetoric coming from Beijing, likening it to the Cold War-era paranoia of the 1960s and ’70s. He questioned whether a diplomatic breakthrough similar to Nixon’s historic visit to China is even possible under the current tone of U.S.-China relations:\n“But when I listen to the rhetoric from China, this is the 1968-72 rhetoric. It’s the kind of rhetoric that just says there’s never going to be a meeting. Is there a way to have a Nixon to China moment? Because as far as I’m concerned, this is just right now you’re on the verge of when I was a little boy and we kept thinking, when are they going to bomb us? I mean, that was the same rhetoric. When are they going to launch their nuclear weapons? I mean, that’s why we used to live in fear. That’s why we had cubbyholes. That’s why we used to put our heads in a cubbyhole, because the Chinese were going to bomb us if the Russians didn’t bomb us. This is the same sound.”\nTo make our list of the stocks that Jim Cramer talked about, we listed down the stocks he mentioned during CNBC’s Squawk on the Street aired on April 14th.\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund holders: 166\nJim Cramer spoke extensively about Apple Inc. (NASDAQ:AAPL) in the context of escalating U.S.-China trade tensions and the existential threat tariffs pose to the company’s supply chain and margin structure. He emphasized how vulnerable Apple is compared to competitors like Samsung, especially when government policies appear to be more favorable to foreign players. Here is what he had to say:\n“Look, I can’t tell what really happened with Apple, other than the fact that if you wanted to take Apple down, you’d keep doing what they were doing. And the reason I say that, very specifically, is because Apple is a loser to Samsung. […]\nA day earlier, Jim Cramer analyzed some of the risks that Apple Inc. (NASDAQ:AAPL) faces with the current regime. Here’s what he said last time:\n“And I think that one of the things that’s happening is that people are just saying, look, it’s too crazy. I mean, Apple was up. Now, I could argue that Apple shouldn’t have ever been up, but Apple’s come down. There’s a sense that, like, OK, this thing may be for real. And if it’s real, then how can you own Apple? Why not go buy Samsung?\nOverall, AAPL ranks 10th on our list of key stocks that Jim Cramer analyzes. While we acknowledge the potential of AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\n(Bloomberg) -- Chinese stocks in Hong Kong snapped a six-day winning streak, as renewed fears of an expanding US-China trade war weighed on sentiment.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe Hang Seng China Enterprises Index closed down 2.6% to be among Asia’s worst performers on Wednesday. The mainland benchmark CSI 300 Index ended up 0.3%\nCEOs have warned on the economy because of Trump administration tariff policies. US Treasury Secretary Scott Bessent has a message for them all.\nMichael Saylor says Bitcoin is “strategy” as MicroStrategy’s 133% gain beats Tesla, Nvidia, and the Magnificent 7.\nApple stock fell more than 2% late Wednesday morning, once again putting its market capitalization below the $3 trillion mark after a brief rally.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-33_After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street",
    "date": "",
    "content": "Title: After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street\nDate: 2025-04-16 14:33\nURL: https://finance.yahoo.com/news/after-surge-to-record-highs-gold-overtakes-magnificent-7-as-the-most-crowded-trade-on-wall-street-143338618.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGold has surpassed the \"Magnificent Seven\" tech stocks as the most crowded trade on Wall Street as the precious metal surged to record highs this year amid volatile markets and an uncertain economic backdrop.\nAccording to the latest Bank of America fund managers survey published this week, nearly half of the fund managers surveyed (49%) see long gold, or bets that gold prices will rise, as the most crowded trade in the market right now. This marks the first time in two years that fund managers did not see the Magnificent Seven as Wall Street's most crowded trade, according to the survey.\nGold futures (GC=F) on Wednesday rose to an all-time high of $3,334 as investors continued to favor the safe-haven asset amid a falling US dollar (DX-Y.NYB) and tariff uncertainty.\nGold prices have surged more than 27% year to date, while the Magnificent Seven tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), Tesla (TSLA), and Nvidia (NVDA) — are down considerably.\nRead more: How to invest in gold in 4 steps\nTesla stock has led Magnificent Seven losses and is down about 38% since the start of 2025. Apple stock has fallen 21%.\nNvidia stock has also declined 21% year to date. In a regulatory filing, the AI chip giant warned of a multibillion-dollar impact from US export controls on China, which weighed on shares.\nShares of Alphabet, Microsoft, Meta, and Amazon — the remainder of the Magnificent Seven — are all down by double-digit percentages since the start of the year.\nGold's rally comes as central banks' demand hit all-time highs last year and as investors increased inflows into physical gold-backed exchange-traded funds (ETFs).\n\"The new highs in gold are signaling a shift in appetite for US assets,\" Ryan McIntyre, senior managing partner at asset manager firm Sprott, recently told Yahoo Finance.\n\"Confidence in the US has clearly been shaken, so people are looking to diversify.\"\nWall Street analysts have remained bullish on gold, upping their price forecasts on the precious metal even amid its fast ascent.\nSome 42% of fund managers expect gold will be the best-performing asset of 2025, up from 23% in March, according to Bank of America.\nThe firm's survey also showed investors have rotated out of US assets by a record amount over the past two months, with 73% of respondents saying \"US exceptionalism\" has peaked.\nInes Ferre is a Senior Business Reporter for Yahoo Finance. Follow her on X at @ines_ferre.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nSTH MVRV dropped to 0.82, signaling investor stress — while long-term holders quietly accumulate.\nSemiconductor stocks sank Wednesday after Nvidia and Advanced Micro Devices warned they would take a hit after the Trump administration moved to limit the chipmakers' exports to China.\nOppenheimer analysts on Wednesday initiated coverage of Lyft with an \"outperform\" rating, writing that they expect the company to benefit as ridesharing continues \"to challenge the rising cost of car ownership.\"\nOther companies hit hard include a medical device maker, a semiconductor firm and the maker of Vans sneakers.\nGold futures opened at $3,248.40 an ounce on Wednesday, up from Tuesday's close of $3,218.70. Gold's highest opening price in history follows ongoing uncertainty about changing U.S. tariff policies and the U.S. inflation outlook.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-44_Nvidia, Apple, Big Banks' trading revenues_ Trending Tickers",
    "date": "",
    "content": "Title: Nvidia, Apple, Big Banks' trading revenues_ Trending Tickers\nDate: 2025-04-16 14:44\nURL: https://finance.yahoo.com/video/nvidia-apple-big-banks-trading-144403821.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMadison Mills and Interactive Brokers chief strategist Steve Sosnick examine some of today's trending tickers.\nNvidia (NVDA) stock is falling after the company warned that new US chip rules on exports to China would cost the company $5.5 billion. Analysts at Bank of America, Piper Sandler, and Raymond James lowered their price targets for the chipmaker stock.\nApple's (AAPL) India suppliers shipped $2 billion worth of iPhones in March ahead of US President Trump's tariffs.\nWall Street's top financial firms, like JPMorgan Chase (JPM), Goldman Sachs (GS), and Morgan Stanley (MS), saw record-high trading revenue in the first quarter, driven by tariff-fueled market volatility.\nTo watch more expert insights and analysis on the latest market action, check out more Catalysts here.\nIt's now time for some of today's trending tickers. We are watching Nvidia, Apple, and Wall Street banks. First up, several Wall Street firms cutting their price targets on Nvidia stock after the chip maker disclosed that it anticipates a $5.5 billion charge from new chip curbs. The US government told Nvidia earlier this month it would need a special license to export certain chips to China. Analysts at BFA Global Research, Piper Sandler, and Raymond James all lowering their price targets on the news. And also, Steve, what I also thought was really interesting here is an analyst over at City talking about how it's not just about Nvidia. This could also impact Broadcom. This could also impact other chip names in the space.\nWell, you're seeing them, you're seeing them sell off today. I mean, you know, AMD announced an $800 million charge along in there. Um, you know, Broadcom was trading lower this morning as well. ASML was trading lower, although they released earnings, but, but they're all, they're all part and parcel of this. This is not good news for the chip sector, because, you know, I, I don't mean to just sound like a broken record, but this is uncertainty, and uncertainty, the markets don't love uncertainty.\nWell, speaking, speaking of uncertainty, let's get to another name we're looking at. Apple's main suppliers in India shipping roughly $2 billion worth of iPhones in March ahead of President Trump's reciprocal tariffs announcement. That is according to new customs data. Smartphones have since secured a temporary reprieve from tariffs, but persistent tensions between the US and China threaten the iPhone maker's China-focused supply chain in the longer term. The Wall Street Journal reporting Apple is investigating moving some iPhone production to the US, but the process could take years, and CEO Tim Cook has said in the past that it would be difficult to find the skilled labor in America that's needed to build the smartphones. Treasury Secretary Scott Beson dismissed that comment and concern in an interview with Yahoo Finance.\nYou don't need a PhD in mechanical engineering to assemble an iPhone. So, I, I'm not sure why Tim Cook says that the skills aren't here.\nAnd Steve, I think what analysts who cover Apple might say and investors might say is that that skilled labor does take years to build up, and it's certainly something that allows Apple to turn out these iPhones incredibly quickly.\nWell, that's it. I mean, every, you know, labor now is not just, you know, pounding a hammer or nail. There, there's, there's, there's intricacies in the supply chain. You know, I, I know that, you know, the commerce secretary with his comment, you know, we're going to have lots of people screwing tiny little screws into things. That's not what people really want. You know, we want the high-tech value-added manufacturing because, quite frankly, our cost basis is higher. So, if there's value-added stuff to be done, that's great. If it's just, if it's just bringing low-skilled labor, bringing back low-skilled jobs, that's not necessarily, you know, I understand the need for that, particularly maybe in some strategic industries, but overall, I think we want people bringing a skill set to it. You know, I saw a statistic, this was posted on, on, on Twitter by my friend Frank Luntz who I trust. Um, and he got the statistics from the Cato Institute. 80% of the people when asked, said, do you want more manufacturing in the US? 80% said yes. When asked, would you take a factory job? 75% said no. 23% said yes. The other two said I already have a factory job. So, it, it's, you know, it's one of these, it's nice in theory, but in practice, um, you know, you need skilled, the people who are going to take these jobs, by definition, are really going to be skilled labor. Not, not just, you know, people, not just, you know, automatons screwing in screws.\nYeah. Right. The price that they're requiring for their labor requires it to be skilled. All right. Finally, trading desks at some of the biggest names in banking crashed in, cashed in, rather, on market volatility in the most recent quarter. And that is not including the past two weeks, which fell outside of that reporting period. Morgan Stanley, JPMorgan, Goldman, all seeing record equity trading revenue during the quarter. Despite the blockbuster results, executives did express some caution about the current macro backdrop. JPMorgan's Jamie Dimon warning of considerable turbulence roiling the US economy. Well, Goldman's David Solomon said the prospects of a recession had increased. You couldn't pay Solomon to mention the word tariffs, but he did semi-maybe allude to it in that comment. Is this trading revenue for banks a signal of strength in your view, Steve? Or is this something that can kind of hide any economic macro concerns?\nKind of the latter. You know, I remember I spent the bulk of my career as an option trader, and I used, I loved environments like this. Um, you know, and to Jamie Dimon's comment, you know, about turbulence, you know, I always described VIX as sort of the price of a parachute when the plane hits turbulence at some level. You know, people want that protection. But here's what happens during volatility with, if you're an active trader. You widen your spreads, you shrink your sizes. So, effectively that really impairs liquidity, but if you're the person trading off those bid offs, bid-ask spreads, each trade you do is more profitable. And so, yes, that leads to the trading desks making more money, but really, you know, analysts typically discount that over time. It's actually a little odd this quarter that the analysts are very happy that the banks are making all this money trading because for years, again, as a trader at a publicly traded firm, the analysts were always very dismissive when we had a good quarter.\nYeah. Right, right, because it's potentially not a sign of continued gains for, for the banks. Steve, thank you so much for sticking with us. For our audience, you can scan the QR code below to track the best and worst performing stocks with Yahoo Finance.\nExactly. My pleasure.\nThe tech market took it on the chin on Wednesday as the trade war picked up steam and the Federal Reserve sounds like it's not going to bail out the market.  Big tech in both the U.S. and China were hit hard today.  Broadcom (NASDAQ: AVGO) fell as much as 6.7%, Alibaba Group (NYSE: BABA) dropped 5.6%, and JD.com (NASDAQ: JD) fell 6.4%.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-00_Trump's trade war unlikely to bring tech manufacturing back to the US",
    "date": "",
    "content": "Title: Trump's trade war unlikely to bring tech manufacturing back to the US\nDate: 2025-04-16 15:00\nURL: https://finance.yahoo.com/news/trumps-trade-war-unlikely-to-bring-tech-manufacturing-back-to-the-us-150053245.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPresident Trump is determined to bring tech manufacturing to the US via massive tariffs. But there's little chance companies like Apple (AAPL) will reinvent their supply chains before Trump leaves office in 2028.\nThe Trump administration hit China with a whopping 145% tariff on Chinese-made goods before announcing exemptions for tech devices ranging from smartphones to laptops on Friday. But Commerce Secretary Howard Lutnick said during an interview with Jonathan Karl of ABC News on Sunday that the move was temporary and only applied to Trump's reciprocal tariffs.\nInstead, he explained, tech products will be tariffed as part of the administration's planned duties on semiconductors, which could be announced later this week.\nStill, even the threat of sky-high tariffs won't be enough to force tech giants like Apple to pick up and move their suppliers to the US en masse.\nRead more: The latest news and updates on Trump's tariffs\n\"Anything is possible, but the setup of smartphone production in India has been a three-year process from site identification through ramped-up production, with at least another two years to achieve full supply chain integration,\" Chris Rogers, head of supply chain research at S&P Global Market Intelligence, told Yahoo Finance.\nIt's not just about timing. Companies would also need the workers to build devices.\n\"While there's a degree of automation possible and while many of the components needed are made in the US, there's still a need for tens of thousands of trained electronics assemblers willing to work long, arduous hours in highly repetitive tasks,\" he added.\nCompanies including Nvidia (NVDA), TSMC (TSM), Apple, and others have announced increased investments in the US to win over Trump and avoid tariffs. On Monday, Nvidia said it will produce $500 billion in AI infrastructure in the US over the next four years through partners including Foxconn (601138.SS), TSMC, and Wistron (3231.TW).\nApple also said it will spend $500 billion, and TSMC has said it will spend $165 billion. Many of those plans, however, were already in the works or don't necessarily go above prior spending levels. Nvidia, for example, talked up building chips in the US last year.\nAnd while that doesn't take away from the fact that the companies are pouring money into the US, it doesn't exactly support the idea that they're moving vast amounts of their manufacturing capabilities to America.\n\"We believe hardware companies will remain focused on accelerating US-bound product assembly out of China, and see India and Mexico as the most-likely incremental beneficiaries of these actions (we'd argue Vietnam and Mexico have been the biggest beneficiaries over the last 5 years),\" Morgan Stanley analyst Erik Woodring wrote in an investor note.\n\"We just don't see large volume hardware production ever reaching US shores — these plans take years to devise, the costs (capex and opex) associated with manufacturing hundreds of millions of products annually in the US are high, and most importantly, tariff exemptions on finished goods disincentivize on-shoring (and is why we didn't see onshoring after President Trump's first administration),\" he added\nEven if companies brought their manufacturing bases to the US, they'd still have to deal with a host of headwinds ranging from worker salaries to the need to continue importing certain parts from abroad.\nAccording to Bank of America's Wamsi Mohan, while Apple may be able to find enough laborers in the US to build its iPhones, importing the company's entire supply chain will still take some time.\n\"This is because, while it may be possible to move final assembly to the US, moving the entire iPhone supply chain would be a much bigger undertaking and would likely take many years, if even possible.\"\nIt's not just Apple that's contending with these issues. Everything from laptop makers to display producers would face the same problems if they were to move to the US. That doesn't even take into account the potential price increases associated with manufacturing tech products in the US.\nAccording to some estimates, prices on devices could jump by hundreds of dollars, resulting in demand destruction as consumers seek out less expensive options or hold onto their existing smartphones and computers for longer periods.\nWhile it's unlikely manufacturing is coming back to the US, there's still plenty of uncertainty about how tech companies and consumers navigate the next four years of tariff shocks.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\nCEOs have warned on the economy because of Trump administration tariff policies. US Treasury Secretary Scott Bessent has a message for them all.\nApple stock fell more than 2% late Wednesday morning, once again putting its market capitalization below the $3 trillion mark after a brief rally.\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nAfter expanding into internet search and exploring consumer gadgets, the company is now reportedly working on a social network.\nHere's why your water bill is going up.\nASML (NASDAQ: ASML) stock saw a big valuation pullback in Wednesday's trading.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) fell 2.2%, and the Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 3.1%.  ASML reported its first-quarter results before the market opened this morning and posted earnings that actually came in far better than the market's expectations.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nWall Street private equity giant Blackstone is teaming up with Vanguard and Wellington Management to get more private assets into the portfolios of everyday investors.\n(Bloomberg) -- OpenAI is in talks to acquire Windsurf, an artificial intelligence-assisted coding tool formerly known as Codeium, for about $3 billion, according to a person familiar with the matter. Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-26_Is Apple Inc. (NASDAQ_AAPL) the Best NASDAQ Stock to Buy So Far in 2025_",
    "date": "",
    "content": "Title: Is Apple Inc. (NASDAQ_AAPL) the Best NASDAQ Stock to Buy So Far in 2025_\nDate: 2025-04-16 15:26\nURL: https://finance.yahoo.com/news/apple-inc-nasdaq-aapl-best-152609421.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other NASDAQ stocks to buy in 2025.\nOn April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact of current tariffs and compared the situation to an economic armageddon. If the current tariffs remain in place, Ives thinks it would lead to a 15% to 20% demand reduction across the board. He thinks that investor anxiety is much higher considering how things were in the March 2020 COVID-19 crash earlier. The analyst thinks that investors should now focus on the likelihood of tariff adjustments from comments about negotiations, the impact on consumer-focused companies, and the potential for demand destruction. He even thinks that companies may refuse to provide guidance in the first-quarter earnings calls due to the persistent tariff uncertainty.\nIves thinks that a lot of tech companies will not be able to absorb high tariff increases and rather this cost will be passed on to the consumers which will lead to significant margin erosion and even potential sales declines. He indicated that tech stocks are currently pricing in a 10% to 15% cut to numbers. He suggests that investors should now look at companies with strong long-term potential as he believes earnings may normalize in 2025 and 2026. The analyst also addressed the defensive performance of defense contractors. While acknowledging the relative stability here, Ives cautioned that even these even such sectors are not immune to tariffs. He noted the significant foreign component, specifically 40% to 50% in some instances, in hardware and other sectors.\nOur Methodology\nWe sifted through the financial media reports to compile a list of the top NASDAQ stocks to buy for 2025. We then selected the 13 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 900 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) designs and manufactures smart devices. It offers smartphones under the iPhone line, personal computers under the Mac line, and multi-purpose tablets, under the iPad line. It also offers other accessories and wearables, like the AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also offers AppleCare support and cloud services.\nErik Woodring from Morgan Stanley lowered his iPhone shipment estimates for 2025-2026 by 1% to 5% because of delayed releases at the company. This is because of quality issues and malfunction rates that exceed 80%. Since June 2024, many features planned for release in April with iOS 18.4 2025 have been postponed. The company now aims to fix these issues by 2026, but the investors are already concerned about the competitiveness of its AI development.\nWoodring has also reduced his price target on Apple Inc. (NASDAQ:AAPL) from $275 to $252 due to the lack of an AI-driven iPhone upgrade cycle. The company is generally best known for its iPhone product cycle, with 52% of its revenue coming from this product line. The company has over 2.2 billion devices on sale and the next target is now to integrate AI for strengthening these service offerings.\nColumbia Seligman Global Technology Fund is optimistic about the company due to iPhone 17’s AI potential. It stated the following regarding Apple Inc. (NASDAQ:AAPL) in its Q4 2024 investor letter:\n“The fund maintained a position in Apple Inc. (NASDAQ:AAPL) throughout the quarter through the release of the company’s new iPhone 16 in September. Company leaders were excited about the release of the new model, as this is the first model that will feature enhanced AI capabilities through the Apple Intelligence features. Sales for the first few weeks in October and November trailed behind year over year sales from the iPhone 15, as availability of Apple Intelligence was not compatible with all iPhone models. Apple announced a partnership with OpenAI that has allowed the integration of ChatGPT into the Apple ecosystem, separate from the core Apple Intelligence features. This partnership highlights continued progress from Apple to introduce AI capabilities into its products and we expect the iPhone 17 to have even more expansive AI capabilities, increasing potential demand for the new model that is on track to be released in 2025.”\nOverall, AAPL ranks 6th on our list of the best NASDAQ stocks to buy so far in 2025. While we acknowledge the growth potential of AAPL, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveThe five-year note led\nTo the relief of anyone with an aging iPhone, the Trump administration exempted smartphones, computers, and other tech products from its punishing tariffs on Chinese imports over the weekend.  While Apple (NASDAQ: AAPL) has geographically diversified its supply chain, the company still relies heavily on Chinese manufacturing partners for its devices.  Absent any special treatment, prices in the U.S. on Apple products would have likely risen substantially due to the tariffs.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-30_‘It’s going to be the small stuff’_ Trump’s tariffs could make cheap tech gadgets not so cheap",
    "date": "",
    "content": "Title: ‘It’s going to be the small stuff’_ Trump’s tariffs could make cheap tech gadgets not so cheap\nDate: 2025-04-16 15:30\nURL: https://www.cnn.com/2025/04/16/tech/trump-tariffs-china-tech-products-price?.tsrc=rss\nContent:\nMarkets \n\n\n\nHot Stocks \n\n\n\nFear & Greed Index \n\n\n\n\n            Latest Market News \n\n\n\n\n            Hot Stocks \n\n\n\nFollow:\n\n            Those shopping for a new smartphone or computer may be spared from tariff-induced sticker shock. At least, for now.\n    \n\n            President Donald Trump issued a memorandum on April 11 saying certain electronics — including computers, smartphones and some components — won’t be subject to the reciprocal tariffs imposed on imports from China. While tariffs on virtually all other products from China are now at least 145%, prices of smartphones and certain other devices should avoid completely skyrocketing, at least for a little while.\n    \n\n            But with comments from the Trump administration indicating an upcoming wave of tariffs on semiconductors — a critical part of the chips that power electronic devices — it’s still unclear if and when tech products could get more expensive in the US. Plus, the current exclusions aren’t expected to cover many everyday tech products that consumers are likely to buy more frequently than new phones — such as some charging cables and earbuds.\n    \n\n            That makes it challenging for shoppers to know what to expect, but also for tech companies to adjust their supply chains and shipments as demand potentially fluctuates due to tariff-induced price swings — all while keeping prices reasonable.\n    \n\n            “It’s completely impossible for any company to plan,” said Francisco Jeronimo, vice president of client devices for the International Data Corporation, a firm that tracks global shipments of tech devices. “So the best, the only thing they can do at the moment is… ship as many products as they can while the exemption lasts to the US.”\n    \n\n            Some reports indicate that companies may be doing just that. Apple’s India-based suppliers shipped a record number of iPhones to the US in March, nearly $2 billion worth, according to Reuters. PC shipments grew by 12.6% in the US during the first quarter of 2025 as vendors increased shipments ahead of potential tariffs, market research firm Gartner said in a press release Monday.\n    \n\n            The exception is a major win for Apple, which relies on iPhone sales for most of its revenue — about $69 billion of its roughly $124 billion in its first fiscal quarter of 2025 — and has much of its smartphone supply chain located in China. But the Trump administration has indicated that more tech tariffs are coming.\n    \n\n            Trump wrote in a Truth Social post on Sunday that “NOBODY is getting ‘off the hook,’” when it comes to tariffs, adding that “there was no tariff exception” announced and these products are still subject to a 20% tariff on Chinese imports.\n    \n\n            The excepted products will be moved to a “different tariff bucket” as the administration examines the “whole electronics supply chain,” the post said. The Trump administration on Monday began investigating semiconductor imports to set the stage for tariffs.\n    \n\n            Kevin Hassett, national economic council director, said when speaking with CNN’s Jake Tapper on Sunday that “it was always the case” that semiconductors would be covered under a separate action rather than reciprocal tariffs.  \n\n\n            The exception came after Trump’s tariff policies resulted in a whirlwind couple of weeks for the stock market, with the S&P 500 having its worst week since 2020 earlier this month.\n    \n\n            But the stock market saw massive gains last week when Trump announced a 90-day pause on most reciprocal tariffs, a sign that investors were seeking a reprieve from his levies.\n    \n\n            The exclusions specifically mention smartphones, computers (described as “automatic data processing machines”), monitors, storage devices and various components that power those devices, including integrated circuits and transistors.\n    \n\n            But a host of other tech products don’t appear to be included in the exceptions, such as USB charging cables, portable battery packs, headphones and video game consoles, a public affairs officer for the US International Trade Commission said in response to a CNN inquiry about whether these products fall under the exceptions.\n    \n\n            But it’ll likely depend on which components are inside these devices and how they’re categorized.\n    \n\n            The US ITC also said computer mice and keyboards are covered under the exceptions, but added that US Customs and Border Protection has the final say on how imported goods are classified and whether they’re exempted from tariffs.\n    \n\n            “It’s a gray area,” said Dave Marcotte, a senior vice president and analyst with market research and consultancy firm Kantar. “This is where you get creative about describing your products when you move to Customs. If you look at the scheduling and say, ‘Okay, well, I have, I have peripherals. Are peripherals covered? Or (are) computer cables covered?’ Well, they’re the same thing.”\n    \n\n            Even before Trump specified these exclusions, some analysts had expected smaller items like charging cables and headphones to be among those most heavily impacted by tariffs.\n    \n\n            “I think the first things you’re going to see (are) the stuff we don’t really pay attention to, like… USB chargers and batteries and stuff that’s less than, say, $20, $25,” Marcotte said last week ahead of Trump’s exception on smartphones and other select tech products. “It’s going to be the small stuff.”\n    \n\n            Smaller companies don’t have the supply chain flexibility of a stalwart like Apple, for example, and the margins on cheaper items such as charging cables are much lower. That means these firms don’t have as much flexibility to absorb additional tariff costs and would likely have to pass it down to consumers to turn a profit.\n    \n\n            And many of these ancillary tech gadgets appear to be from China.\n    \n\n            When CNN searched Amazon for earbuds under $50, iPhone charging cables and portable battery packs, many of the top five results for each product either had China listed as the country of origin, or mentioned a manufacturer based in China. Some of the results didn’t name a country of origin, but other product pages from the same sellers listed products as coming from China.\n    \n\n            Trump also got rid of the “de minimis exemption,” which allowed packages valued at less than $800 to enter the US tax-free — another change that’s expected to impact the prices cheap goods from China.\n    \n\n            Price hikes on these smaller, cheaper items could feel more impactful to consumers in some cases since the difference in price may feel more drastic.\n    \n\n            “A $40 increase to an $80 increase looks a lot worse for a consumer than, say, a $1,200 to $1,500,” said Jack Leathem, an analyst at market research firm Canalys.\n    \n\n            Although some tech products got a break on certain reciprocal levies, new tariffs on semiconductors are expected to arrive in the “next month or two,” Commerce Secretary Howard Lutnick told ABC News on Sunday. It’s part of the Trump administration’s broader effort to reduce US reliance on China while reshoring manufacturing.\n    \n\n            But tariffs or not, the chances of an American-made iPhone seem slim. White House press secretary Karoline Leavitt said Trump believes iPhone production could move to the US, but higher labor costs and the logistics of shifting Apple’s massive production network to the other side of the world — further away from Asia, where many components would likely still be sourced — present major challenges.\n    \n\n            And it’s not just the components. Finding workers would be an issue, too.\n    \n\n            “It’s very hard to find skilled labor in the numbers they need,” Jeronimo said.\n    \n\n            Apple in February announced a $500 billion investment to expand its US operations. But that commitment is largely focused on building production facilities for Apple Intelligence servers and boosting education in manufacturing, not building iPhones. And while several tech leaders like chipmaking giants TSMC and Nvidia have announced major US expansions, the tech supply chain is largely expected to remain in China, says Jeronimo.\n    \n\n            Companies are more likely to shift some production to other regions, like the Middle East, Africa and Latin America, according to Jeronimo.\n    \n\n            Trump’s tariff policy is already seems to be impacting some tech product launches and shipments. The US smartphone market grew more than 5% in the first quarter of 2025, according to the IDC, partially driven by a “sense of urgency to buy before potential price increases,” the IDC’s research director for client devices Anthony Scarsella said in a Monday press release.\n    \n\n            Nintendo also postponed US preorders for its new Switch 2 game console in early April as it assesses the tariff situation.\n    \n\n            “You stockpile during a hurricane because it happens for five days,” said Dipanjan Chatterjee, vice president and principal analyst at market research firm Forrester. “There is no pantry in the world that’s large enough where you can stockpile four years’ worth of trade policy uncertainty.”\n    \nMost stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited.\n© 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.\nIf you switch this toggle to “no,” we will not sell or share your personal information with third parties for advertising targeted to this device. Please see our Privacy Center for additional preferences.\nThese cookies are necessary for the website to function and cannot be switched off in our systems. You can set your browser to block or alert you about these cookies, but some parts of the site will not work."
  },
  {
    "title": "2025-04-16 16-00_Apple market cap falls back below $3 trillion as 'relief rally' fades amid new tariff uncertainty",
    "date": "",
    "content": "Title: Apple market cap falls back below $3 trillion as 'relief rally' fades amid new tariff uncertainty\nDate: 2025-04-16 16:00\nURL: https://finance.yahoo.com/news/apple-market-cap-falls-back-below-3-trillion-as-relief-rally-fades-amid-new-tariff-uncertainty-160003888.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL) stock fell nearly 4% on Wednesday, sending the iPhone maker's market capitalization back below $3 trillion as tariff pressures continue to weigh on the company after shares had enjoyed what some analysts called a \"relief rally\" earlier in the week.\nApple stock surged to start the week, leading the \"Magnificent Seven\" stocks higher as investors cheered the Trump administration's temporary tariff exemptions for tech products announced over the weekend.\nThe \"relief rally,\" as Citi's Atif Malik put it, briefly put Apple's value back above the $3 trillion mark after falling to its lowest value in almost a year last week at just under $2.6 trillion.\nApple is still the world's most valuable company, ahead of Microsoft (MSFT).\nUS Customs and Border Protection issued regulations late Friday exempting consumer electronics — and almost all of Apple's products — from reciprocal tariffs.\nOn April 2, Trump announced global reciprocal tariffs that would go into effect on April 9.\nRead more: The latest news and updates on Trump's tariffs\nThe president instead announced a 90-day pause on the reciprocal tariff plan last Wednesday — with the exception of a 145% reciprocal tariff on Chinese imports, a development cheered by Apple investors. Some 90% of Apple's iPhones are made in China.\nApple had shed more than $770 billion from its market cap between April 2 and April 8.\nApple's decline on Wednesday comes after Nvidia (NVDA) disclosed late Tuesday that the Trump administration had effectively banned exports of its H20 chips to China.\nNvidia's disclosure followed reports that Trump had been set to back off plans to restrict Nvidia's chips designed for China to comply with US trade rules.\nTo Jefferies analyst Edison Lee, these developments show that there are “many conflicting opinions within Trump's team on the issue of tariffs, strategies against China and US tech restrictions.\"\n\"The concern about Apple is that it will become harder to avoid the crossfire between the US and China as tariffs and restrictions come into play,\" DA Davidson analyst Gil Luria told Yahoo Finance in an email.\n\"The [export] restrictions on chips that came out from NVIDIA represent an escalation in the trade dispute.\"\nTech stocks fell across the board Wednesday, with the Nasdaq (^IXIC) dropping 3%.\nFellow Magnificent Seven stocks Meta (META) and Microsoft (MSFT) also sank, falling nearly 4%, while Nvidia plummeted almost 7%.\nTrump also set the stage to tariff semiconductors this week — the Commerce Department opened a probe into computer chips Tuesday under Section 232 of the Trade Expansion Act of 1962, which grants the president the ability to impose levies on imports due to national security. And Trump has promised that most electronics will still get wrapped up in his tariffs, which could hurt Apple.\n\"We are taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations,\" he posted Sunday.\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveThe five-year note led\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nTSMC, the main global producer of advanced chips used in artificial intelligence applications, is set to report a 57% leap in first-quarter profit on Thursday, though it is also likely to flag risks from U.S. President Donald Trump's trade policies.  Taiwan Semiconductor Manufacturing Co is expected to report a net profit of T$354.6 billion ($10.92 billion) for the three months ended March 31, according to a LSEG SmartEstimate drawn from 18 analysts.\nTom Lee, the Head of Research at Fundstrat Global Advisors, isn’t buying this narrative of “America in decline” or the “end of American exceptionalism” that is gaining steam in recent weeks. What Happened: Lee said on Monday that he is not in the same camp as those who believe that “U.S. exceptionalism is over.” During an interview with CNBC’s “Squawk Box,” Lee was asked about the potential worst-case scenario involving a weakening dollar, rising yields, and foreign capital pulling out of U.S. a\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nDow Jones restaurant giant McDonald's, along with Netflix stock and MercadoLibre, are among the best stocks to watch Tuesday.\nTrump's Treasury secretary wants business owners to relax. That's hard to do when Trump's tariffs are pushing costs higher and profits lower and threatening a recession.\nThe dollar resumed its fall on Wednesday with both safe-havens and risk-sensitive currencies outperforming the greenback as traders waited to see if U.S. President Donald Trump’s administration reaches new trading agreements with partners.  The dollar tumbled last week on concerns over the economic impact of new tariffs and as investors shifted allocations overseas due to uncertainty on the erratic implementation of the trade levies.  The United States is in discussions with countries including Japan, while tensions between China and the U.S. are intensifying.\nNvidia stock sank after a surprise disclosure it would take a hit north of $5 billion following new chip export restrictions.\n(Reuters) -The ripple effects of Donald Trump's global trade war are increasingly being felt across numerous industries all at once and on Wednesday were once again exerting pressure on U.S. stock markets that have been roiled for weeks by his erratic trade policies.  Stocks fell broadly, with tech stocks hit particularly hard after bellwethers like Nvidia that are highly tied into the world's supply chain warned of hits to their bottom line.  Meanwhile, airlines said they are bracing for an uncertain summer travel season, and the head of the Federal Reserve noted slowing economic activity - but also cast a wary eye on the threat that tariffs pose to its goal of lowering inflation.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-05_How to invest in Nvidia successfully during Trump tariff turmoil",
    "date": "",
    "content": "Title: How to invest in Nvidia successfully during Trump tariff turmoil\nDate: 2025-04-16 16:05\nURL: https://finance.yahoo.com/news/how-to-invest-in-nvidia-successfully-during-trump-tariff-turmoil-160535638.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nListen and subscribe to Opening Bid on Apple Podcasts, Spotify, YouTube or wherever you find your favorite podcasts.\nNot too long ago, Nvidia (NVDA) seemed unstoppable.\nIf recent market woes and the Nvidia pullback have investors down, they should consider the bigger picture, according to Lawrence \"Larry\" McDonald, founder of the Bear Traps Report.\n\"You can make a lot of money by investing in the power infrastructure plays,\" he told Yahoo Finance Executive Editor Brian Sozzi for an episode of the Opening Bid podcast (see the video above or listen below).\nHe added that Nvidia's forecasts include $3 trillion in growth and that copper has a bright future related to it. \"If you really, really listen to Jensen [Huang] and the Nvidia gods, the only way they get to their growth trajectory is with a lot more copper.\"\n\"If you look at the copper or oil names, they're down 30, sometimes, 25% off the highs,\" he said. \"The future looks great for them because the valuation setup is so skewed.\"\nMcDonald is no stranger to helping the average investor through turbulent market moments.\nAmong other things, the Bear Traps Report aims to demystify political policy risk for investors and related investment strategies. McDonald is also the author of two books, including 2024's \"How to Listen When Markets Speak.\"\nPlenty of speculation and concern had gripped investors related to Trump's tariffs and their impact on technology. Markets have responded accordingly.\nRead more: The latest news and updates on Trump's tariffs\nThe boost to 145% tariffs earlier this month on Chinese goods resulted in consumers bracing for sticker-shock prices on items such as iPhones. Meanwhile, Apple (AAPL) reportedly flew $2 billion worth of iPhones from India in March just before the first round of tariffs took hold.\nNvidia had to take a $5.5 billion charge this week because of fresh restrictions on its AI chip exports to China.\n\nIn an April 10 note, Citi analyst Atif Malik maintained a Buy rating on Nvidia but lowered estimates \"to align with our revised hyperscaler capex model of +35%/+15% spend reflecting mostly lower Microsoft capex concerns and higher risk of pause in enterprise investments amid uncertainty around the global economy due to ongoing trade war,\" he wrote.\nMcDonald said despite his interest in copper as a way to play AI, Nvidia remains poised for AI greatness. It may just take a bit for the stock to work higher again.\n\"You can make a lot of money by investing in the power infrastructure plays,\" he said.\nMcDonald also noted that there are many ETF opportunities for investors looking to get into the space. \"You're investing in a basket of companies that are going to power AI for the next 30 years,\" he said.\nThree times each week, Yahoo Finance Executive Editor Brian Sozzi fields insight-filled conversations and chats with the biggest names in business and markets on Opening Bid. You can find more episodes on our video hub or watch on your preferred streaming service.\nGrace Williams is a writer for Yahoo Finance.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staf\n(Reuters) -Global chip stocks were battered on Wednesday on fresh evidence of how U.S. President Donald Trump's shifting trade policy was complicating the outlook for semiconductor and computing giants, including AI pioneer Nvidia and its rival AMD.  Attempts to reorient global trade through tariffs and export curbs have started to show the effect as Nvidia warned of a $5.5 billion hit after Washington restricted exports of its AI processor tailored for China, while Dutch chip-making tools giant ASML raised doubts about its outlook.  The U.S. restriction, which also hit the MI308 processor of Advanced Micro Devices, marked the latest blow for the AI chip trade that is losing steam after a two-year rally as tariff threats and fears over Big Tech's spending weigh on sentiment.\nNetflix is slated to report first-quarter results after markets close Thursday, and options markets suggest traders are expecting a stock price big move in the following days.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nNvidia stock sank after a surprise disclosure it would take a hit north of $5 billion following new chip export restrictions.\nBJ's (BJ) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #2 (Buy).\nMeta Platforms CEO Mark Zuckerberg testified this week at a high-stakes trial in Washington where the U.S. Federal Trade Commission is seeking to unwind Meta's acquisitions of prized assets Instagram and WhatsApp.  Zuckerberg in 2018 floated the idea of spinning off Instagram amid mounting pressure on Big Tech from antitrust regulators, in a sign of how seriously he took the threat of precisely the type of claims Meta now faces.  Seeking to explain messages in which he worried that Instagram was a competitive threat, Zuckerberg said the app's camera was simply better than camera features Meta had developed.\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-21_Big Tech’s China Risks Go Far Beyond Nvidia",
    "date": "",
    "content": "Title: Big Tech’s China Risks Go Far Beyond Nvidia\nDate: 2025-04-16 19:21\nURL: https://finance.yahoo.com/m/2692b5d6-c2b2-3433-a74f-4e243c1ab630/big-tech%E2%80%99s-china-risks-go-far.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWithin the largest companies in the sector, the players least affected by China risk are Alphabet and Meta Platforms.\nApple (AAPL) will effectively develop Apple Intelligence, while “new form factors” will boost the tech giant’s 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network. Zino has a $235 price target and a Buy rating on the shares. Apple’s Positive Catalysts The development of Apple Intelligence, which […]\nWhile analysts remain bullish overall on Amazon (AMZ) stock, several Wall Street firms have cut their price targets for the tech giant's shares ahead of its first quarter earnings report. Concerns about the impact of President Donald Trump's tariff plan have weighed on Amazon shares in recent weeks. Amazon stock had sold off on a Q4 earnings report that included...\nThe chip maker will take a $5.5 billion charge in the current quarter for H20 inventory and canceled sales.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staf\nDara Khosrowshahi said studying engineering and liberal arts in college was an “absolute necessity” to being a leader.\nChina tells domestic airlines not to place new orders for Boeing jets, adding new pressure to the struggling American plane maker.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-26_Magnificent Seven Stocks Sell Off_ Nvidia Plunges; Apple, Tesla Dive",
    "date": "",
    "content": "Title: Magnificent Seven Stocks Sell Off_ Nvidia Plunges; Apple, Tesla Dive\nDate: 2025-04-16 19:26\nURL: https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-sell.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nDubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first three months of 2025, however, performance for these mega-cap stocks has been negative thus far.\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveThe five-year note led\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staf\nNissan will cut Japanese production of its top-selling U.S. model, the Rogue SUV, over May-July, said a person familiar with the matter, becoming the latest global automaker to alter manufacturing plans in response to new U.S. import tariffs.  U.S. President Donald Trump's decision to slap a 25% levy on cars built overseas has upended the global automotive supply chain.  Nissan, Japan's third-largest carmaker, is more exposed than some rivals.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries. Get Heard on the ...\nApple (AAPL) will effectively develop Apple Intelligence, while “new form factors” will boost the tech giant’s 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network. Zino has a $235 price target and a Buy rating on the shares. Apple’s Positive Catalysts The development of Apple Intelligence, which […]\nThe automaker joins a growing list of companies tapping the EV segment leader’s fast-charging technology.\n(Bloomberg) -- Hertz Global Holdings Inc. shares had their biggest gain ever after CNBC reported that Pershing Square Capital Management had amassed a position of almost 20% in the beleaguered car rental company.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Age\nTaiwan Semiconductor Manufacturing (NYSE: TSM) stock got hit with significant sell-offs in Wednesday's trading.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) and Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 2.2% and 3.1% in the session, respectively.  TSMC's valuation moved lower today in conjunction with news of new export restrictions on Nvidia's processors, higher tariffs on China, and cautious commentary from Federal Reserve Chairman Jerome Powell.\n↘️ Nvidia (NVDA): The chip maker warned it will take a $5.5 billion charge after the U.S. said it will need a license to export H20 processors to certain countries. Shares slid 7% early Wednesday. ↘️ Advanced Micro Devices (AMD): AMD stock fell nearly 7%.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-03_Trading Day_ When the chips are down",
    "date": "",
    "content": "Title: Trading Day_ When the chips are down\nDate: 2025-04-16 21:03\nURL: https://finance.yahoo.com/news/trading-day-chips-down-210332040.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Jamie McGeever\nORLANDO, Florida (Reuters) - TRADING DAY\nMaking sense of the forces driving global markets\nBy Jamie McGeever, Markets Columnist\nTariffied once again\nThe respite was too good to last, and sure enough, it didn't. World stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.\nThe Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.\nIf U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast. More on that and more below, but first, a round-up of the day's main market moves. I'd love to hear from you, so please reach out to me with comments at . You can also follow me at @ReutersJamie and @reutersjamie.bsky.social.\nIf you have more time to read today, here are a few articles I recommend to help you make sense of what happened in markets.\n1. In a fog of uncertainty, Fed policy storm could beapproaching 2. WTO slashes 2025 trade growth forecast, warns of deeperslump 3. US-China decoupling is crossing a Rubicon 4. EXCLUSIVE-Nvidia kept some China customers in the darkabout new US chip clampdown, sources say 5. Record gold crowded by one mega player: Mike Dolan\nToday's Key Market Moves\n* Wall Street falls, dragged lower by tech - Nasdaq -3%,S&P 500 -2.2%, Dow -1.7%. The Philadelphia semiconductor indexand the Roundhouse 'Magnificent 7' ETF both fall 4%. * Nvidia falls nearly 7% - at one stage it was down 10% -wiping some $175 billion off its market cap. AMD shares fall7.4%. * Chinese tech shares listed in Hong Kong fall 3.7%. * Safe-haven gold surges 3.4% to a new high of $3,342/oz,and the Swiss franc is the biggest gainer in the G10 FX space,rallying 1% against the dollar. * The dollar index falls 0.9%, back down to last week'sthree-year low. * The Canadian dollar underperforms, gaining only 0.6% eventhough the Bank of Canada paused its easing cycle and held ratessteady at 2.75% in what traders and economists had said was aclose call. * Nikkei and DAX futures point to falls of around 0.2% and0.5%, respectively, at the open in Japan and Germany onThursday. * Oil rises nearly 2% on supply concerns after the U.S.issues new sanctions targeting Chinese importers of Iranian oil.\nWhen the chips are down, really down\nAfter a few days of relative calm, investors buckled up on Wednesday as the Trump administration's latest trade war salvo sent world markets reeling again, with the big loser being Big Tech.\nThe Trump administration clearly has China in its sights but it is U.S. firms - including the biggest cash generators Wall Street has ever seen, like Apple and Nvidia - that are being caught in the crossfire.\nLast week it was Apple, and the White House backed down. Will the damage done to Nvidia and others on Wednesday prompt a similar rethink?\nEconomic signals from China and the U.S. on Wednesday were surprisingly positive, with U.S. retail sales in March and first quarter Chinese GDP growth beating forecasts. But these are rear-view mirror indicators, and if anyone needed it, Wednesday's news is a reminder that the outlook is pretty bleak.\nEconomists at Morgan Stanley and UBS this week cut their Chinese 2025 GDP outlooks to 4.2% and 3.4%, respectively. Anything close to the UBS forecast would be particularly alarming for Beijing, which is targeting growth of around 5%.\nMorgan Stanley's economists estimate tariffs will knock 90 basis points off growth relative to their original forecast, which will only be partially offset by 60 bps of additional stimulus.\nAlthough U.S. growth is slowing, Fed Chair Jerome Powell signaled on Wednesday the central bank will wait for \"greater clarity\" before deciding its next move on rates. He also said markets have been orderly and downplayed the risk of Fed intervention.\nMassive selling of long-dated Treasuries last week raised fears that part of the bond market wasn't functioning smoothly. There was no sign of that on Wednesday, however, as bonds' 'safe haven' qualities pushed yields down as much as 5 basis points at the short end.\nIn Europe, eyes will turn to Frankfurt where the European Central Bank on Thursday will announce its latest policy decision and ECB President Christine Lagarde will offer her outlook. Market pricing suggests a 25 basis point cut is all but certain, with at least another two coming later this year.\nAnd after Wednesday's rout, the focus in Asia on Thursday will stay on tech as Taiwan's TSMC reports first-quarter earnings. The world's largest contract chipmaker is expected to report a 34.2% increase in revenue to $25.318 billion from $18.87 billion a year ago, according to the mean estimate from five analysts based on LSEG data.\nTech and tariffs - a potent mix which roiled markets on Wednesday and will likely do so again sooner rather than later.\nUS Big Tech swaps 'safe haven' sheen for trade war target\nTreasuries are not the only 'safe haven' U.S. asset getting the cold shoulder as investors around the world rethink their enthusiasm for all things America. The shadow over 'Big Tech' is darkening and lengthening too.\nIn recent weeks, the global trade war, the Trump administration's 'America First' agenda and its apparent disdain for the post-war world order have dramatically slowed inflows into U.S. markets, and in some cases, reversed them. What used to be considered some of the safest shelters from crisis are now looking a little flimsy.\nIt might seem a stretch to put shares of U.S. technology and chip companies, such as Nvidia, Apple, and Amazon, on par with IOUs of the federal government, but these cash-generating emblems of 'U.S. exceptionalism' certainly seemed like sure things up until recently.\nAs these firms' global dominance spread over the past decade and their market footprint reached an unprecedented size, they effectively become ATMs for shareholders, generating record profits running into the hundreds of billions of dollars.\nIn the fourth quarter of last year, the 'Magnificent Seven' - Nvidia, Apple, Amazon, Meta, Alphabet, Microsoft and Tesla - accounted for a record 35% of the S&P 500's market cap, with a combined valuation of around $17.5 trillion. Credit ratings on some, like Apple, are the same as the U.S. sovereign rating, and yields have even traded below Treasury yields on occasion.\nInvestors of all stripes wanted in, from domestic to foreign, retail to official.\nAnd who could blame them? The 'Mag 7' appeared to offer the best of both investment worlds: a high income-generating asset and a safe-haven. So much so that the Swiss National Bank has a quarter of its $150 billion equity holdings in Apple, Nvidia, Microsoft and Amazon, and half of the $1.8 trillion Norwegian wealth fund's record $222 billion profit last year came from U.S. tech.\nREALITY CHECK\nBut that sweet spot is gone. The 'American exceptionalism' narrative has been undermined, as the U.S. economy looks set to slow and America's AI invincibility has been shattered by China's DeepSeek. And now tech companies find themselves on the front line of the global trade war.\nWashington is issuing new export licensing requirements for Nvidia's H20 AI chips to China. Nvidia said it faces $5.5 billion in charges, and its shares tumbled 9% on Wednesday, wiping nearly $250 billion off its market value and dragging the broader semiconductor index down 4%.\nTo be sure, U.S. tech has been getting slammed since mid-February, as investors have begun to re-evaluate the sunny outlook they had for the industry under a Trump presidency. The semiconductor index is now deep in a bear market. It has lost 30% in just two months and valuations have come down much more than the wider S&P 500.\nU.S. Big Tech is suddenly vulnerable on multiple fronts. Tariffs and trade restrictions from Washington will bite, as will retaliatory moves from China. And if Europe really wants to hit America where it hurts, tech is an obvious target.\nWHAT GOES UP...\nBut it's also worth remembering how much Big Tech outperformed on the way up. They were - and remain - incredibly profitable. According to LSEG figures, the Mag 7's net profit margin hit a record 25.8% in the fourth quarter, nearly double the S&P 500's 13.4%.\nNvidia's value rose 10-fold in two years to more than $3.5 trillion, Mag 7 stocks more than doubled between October 2023 and last December, and these companies accounted for almost all of the market's profit growth in 2023.\nWhile that halved last year and is expected to decline further this year to around a third, there is still a lot of air left to come out of the balloon. According to Bank of America's latest global fund manager survey, 'long Mag 7' was the most crowded trade for 23 consecutive months until April.\nAnd what was it replaced with? Long gold, one 'safe haven' that isn't giving up its title.\nWhat could move markets tomorrow?\n* TSMC earnings (Q1) * Japan trade (March) * Bank of Korea interest rate decision * European Central Bank interest rate decision * Germany producer price inflation (March) * U.S. weekly jobless claims * U.S. 5-year TIPs auction * U.S. Treasury Secretary Scott Bessent meets Japan EconomyMinister Ryosei Akazawa\nOpinions expressed are those of the author. They do not reflect the views of Reuters News, which, under the Trust Principles, is committed to integrity, independence, and freedom from bias.\nTrading Day is also sent by email every weekday morning. Think your friend or colleague should know about us? Forward this newsletter to them. They can also sign up here.\n(By Jamie McGeever, editing by Nia Williams)\nASML Holding, NVIDIA and Taiwan Semiconductor Manufacturing Company are included in this Analyst Blog.\nTrump wants to bring tech manufacturing to the US. There's little chance it will happen.\nNike initiated, GM downgraded: Wall Street's top analyst calls\nWe recently published a list of Energy Stocks that are Losing This Week. In this article, we are going to take a look at where Par Pacific Holdings, Inc. (NYSE:PARR) stands against other energy stocks that are crashing this week. After an encouraging start to the year, the energy industry is now trailing just behind the […]\nThese are today's mortgage and refinance rates. The 30-year fixed rate is down eight basis points, and most interest rates have dropped. Lock in your rate today.\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where Applied Materials, Inc. (NASDAQ:AMAT) stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump […]\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-08_Why Apple Inc. (AAPL) Is One of the Best Blue Chip Stocks to Buy According to Billionaires",
    "date": "",
    "content": "Title: Why Apple Inc. (AAPL) Is One of the Best Blue Chip Stocks to Buy According to Billionaires\nDate: 2025-04-16 21:08\nURL: https://finance.yahoo.com/news/why-apple-inc-aapl-one-210846590.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best blue chip stocks to buy according to billionaires.\nThe US stock market is showing volatility after President Donald Trump’s recent announcement of sweeping 10% tariffs on all US trading partners and higher tariffs on countries with a trade deficit with the US.\nEconomists and investors believe President Trump’s tariff policies could potentially lead to a trade war with America’s trading partners, propelling inflation even higher. These two factors could plunge the US into an economic slowdown, and the markets could potentially sell off quickly if a recession materializes among its looming threats.\nOn April 10, CNBC reported that stock prices rose sharply a day before after declining for four days straight following President Trump’s announcement of a pause in a significant part of his tariff plan. The White House said that Democratic lawmakers were indulged in partisan games by inquiring if any stock market purchases conducted in recent days were undertaken with prior knowledge of the fact that President Trump would authorize a pause in his tariff plans. Trump announced higher tariffs on China even after he announced a 90-day pause for steeper-than-baseline rates for several other countries.\nREAD ALSO: 10 Best Medical Stocks to Buy According to Billionaires and 10 Best Organic Food Stocks to Buy According to Billionaires.\nOn April 11, Erica York, economist and the vice president of federal tax policy at the Tax Foundation’s Center for Federal Tax Policy, talked to CNBC’s “The Exchange” about the ongoing scenario and said that the imposition of around 145% total tariff on Chinese goods would result in a suspension of most trade between the US and China. She said:\n“It depends on how narrowly the tariff is applied or how broadly it’s applied, but generally, if you get north of a triple-digit tariff, you are cutting off most trade.”\nShe further opined that:\n“There may still be some things without any substitutes that companies just have to foot the bill, but for the most part, that cuts it off.”\nThe economist said that Trump’s new China tariffs, along with the others he implemented, would raise the average tariff rate to record highs the country hasn’t seen since the 1940s. The current market volatility has created numerous remarkable investment opportunities, so let’s look at the 15 best blue chip stocks to buy according to billionaires.\nWe reviewed financial media reports and ETFs to compile an initial list of blue chip stocks and selected stocks that have a 5-year revenue growth rate of at least 10%. We have also considered the popularity of these stocks among billionaire investors. These billionaires are founders or managers of some of the world’s leading hedge funds and companies. We also added the number of hedge fund holders for each stock as of fiscal Q4 2024, and sourced the hedge fund sentiment data from Insider Monkey’s database.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA wide view of an Apple store, showing the range of products the company offers.\nNumber of Billionaire Investors: 21\nNumber of Hedge Fund Holders: 166\nApple Inc. (NASDAQ:AAPL) designs, manufactures, and sells smartphones, personal computers, wearables, accessories, and related products and services worldwide. The company’s stock is facing turbulence and skepticism after Trump imposed 125% tariffs on China, which is where much of Apple Inc.’s (NASDAQ:AAPL) products come from.\nMorgan Stanley analyst Erik Woodring released a note on April 10, speculating that Apple Inc. (NASDAQ:AAPL) could experience a $7 billion to $8 billion drop on next year’s iPhone sales even if the company manages to reroute around 60% of its production to India. The analyst maintained an overweight rating on the stock and set a one-year price target of $220 per share, based on the expectations that it would route around 50% of the tariff costs to suppliers, lowering the effect on its EPS.\nApart from these circumstances, Apple Inc. (NASDAQ:AAPL) holds a significant premium brand and market position, supported by highly in-demand hardware devices. It is also a financially sound company, generating a notable $36.3 billion in net income in fiscal Q1 2025, resulting in a sizable free cash flow. Analysts are bullish on the stock, and its median price target of $198.15 implies an upside of 26.17% from current levels.\nOverall, AAPL ranks 13th on our list of the best blue chip stocks to buy according to billionaires. While we acknowledge the potential for AAPL as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than AAPL but trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nPresident Donald Trump’s tariffs, which are expected to slow economic growth, could cause companies to reduce their technology budgets in the face of uncertain demand and profits.  Already, chief information officers surveyed by Morgan Stanley software analyst Keith Weiss have indicated they expect to grow their budgets by just over 3% this year on average, down from an expectation of just over 4% before Trump’s tariff announcements.\nApple (AAPL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nTreasury Secretary Scott Bessent sat down exclusively with Yahoo Finance as  economic uncertainty from Trump administration's tariffs continues to weigh on investors.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nDubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first three months of 2025, however, performance for these mega-cap stocks has been negative thus far.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-14_Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial",
    "date": "",
    "content": "Title: Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial\nDate: 2025-04-16 22:14\nURL: https://finance.yahoo.com/news/meta-saw-tiktok-highly-urgent-221403450.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nOver a marathon three days of testimony, the Meta Platforms Inc. co-founder and chief executive officer clearly articulated how the social media market has evolved rapidly over time — which, if the judge agrees, could make it more difficult for the FTC to prove Meta dominates it.\nZuckerberg was composed, but occasionally evasive, when challenged to explain past emails and other private messages indicating a concerted effort to muscle out competitors.\nThose old messages and emails, gathered during the pre-trial discovery process, were more damning than his present-day testimony. The messages, often between Zuckerberg and other top Meta executives, painted a picture of an executive who was paranoid about his rivals and willing to buy competitors whenever possible.\nThe FTC is seeking to force Meta to sell off Instagram and WhatsApp, arguing that the two acquisitions have given Meta an illegal monopoly over parts of the social networking industry. Emails and documents presented at trial show that Meta, then called Facebook Inc., struggled to compete in the mobile app boom in the early 2010s, buying up successful competitors. The FTC said Meta bought the companies to eliminate direct competitive threats.\nMultiple Competitors\nZuckerberg and Meta’s lawyers, meanwhile, argued that Meta faces a wide array of competitors that fight for user attention, including ByteDance Ltd.’s TikTok, Google’s YouTube, Apple Inc.’s iMessage and Microsoft Corp.’s LinkedIn. On Wednesday, Zuckerberg said that TikTok, in particular, posed a “highly urgent” competitive threat when it sprang up in 2018.\n“We observed that our growth slowed down dramatically,” as TikTok gained popularity, Zuckerberg said Wednesday. “It was highly urgent, this has been a top priority for the company for several years.” Meta eventually rolled out a direct competitor, called Reels, that now drives a significant amount of video traffic for the company.\nZuckerberg was at times vague over his three days in court, and regularly disputed the FTC’s interpretations of his prior emails. As a leader, the way he communicated with staff was often blunt or harsh, and he spent time on the stand trying to add more nuance to what was written by his younger self. He occasionally clashed with the FTC’s lead lawyer, Daniel Matheson, who objected at one point that Zuckerberg wasn’t answering his questions.\nWhat’s unclear is how much weight those emails will ultimately have as US District Judge James Boasberg, who is presiding over the case, makes his decision. Meta has argued that the intent behind the purchases doesn’t matter, only whether those deals lead to consumer harm, which it disputes.\nBoasberg previously said the FTC will have a difficult time. Despite allowing the bulk of the case to proceed last November, Boasberg struck a skeptical tone about the FTC’s chances at trial. “Prevailing here, however, does not obscure the fact that the Commission faces hard questions about whether its claims can hold up in the crucible of trial,” the judge said. “Indeed, its positions at times strain this country’s creaking antitrust precedents to their limits.”\nBoasberg also said in a ruling shortly before the trial that the FTC must prove Meta is harming competition in the present day.\nSheryl Sandberg, the company’s former chief operating officer, followed Zuckerberg on the witness stand, facing sharp questioning from FTC lawyer Susan Musser.\nIf the FTC prevails, a spinoff of Instagram and WhatsApp would undo years of integration between the apps, disrupt two of the most popular digital consumer products in the world and potentially erase hundreds of billions of dollars in Meta’s market value. It would also raise serious questions about how the government evaluates and approves deals because the government allowed the transactions to go through at the time.\n‘Network Effects’\nPart of the FTC’s case involves the technical concept of “network effects,” meaning that the more users a company like Meta has, the more likely they are to retain a dominant position, because people are unlikely to switch to a service used by few people.\nBoasberg has remained largely silent during the questioning, but interjected during Zuckerberg’s testimony Wednesday to ask if network effects still really matter.\n“How much does it matter if your friends are on a particular platform if you can send content out of that platform? Why does it matter if your friends are there?” the judge said.\nZuckerberg said it doesn’t. “These apps now serve primarily as discovery engines,” he said. “People can take that content to messaging engines.”\nBigger Company\nUnder questioning by Meta lawyer, Mark Hansen, Zuckerberg refuted the FTC’s argument that Meta bought Instagram to bury a competitor. Instagram would not likely have been able to grow to the extent it has had it remained independent, he said. “Instagram has been built out into a much more vibrant service” as a result of the deal, Zuckerberg said.\nTaking a small online platform to a billion users and beyond is unlikely to happen without the backing of a larger company, he said. “Every company that has this level of scale is owned by a bigger company,” he said, citing TikTok and YouTube as examples.\nEarlier in the trial, it was revealed that Snap Inc.’s Evan Spiegel turned down a $6 billion acquisition offer from Facebook in 2013 for its Snapchat app. Zuckerberg said that the app would have grown more rapidly had it joined his company.\nZuckerberg sought to walk back some statements that he made in previous internal communications. He acknowledged that he sent a 2013 email saying that Facebook blocked advertising for messaging apps WeChat, Kakao and Line, in which he wrote the apps were “trying to build social networks to replace us.” On the stand this week, however, he said “it’s hard for me to characterize what their intent was.”\nMatheson also sought to show that Meta was aware of its antitrust risk years ago, including a possible breakup.\nHe displayed an email from 2018 in which Zuckerberg suggested that Meta should consider spinning off Instagram into a standalone company. “As calls to break up the big tech companies grow, there is a non-trivial chance that we will be forced to spin out Instagram and perhaps WhatsApp in the next 5-10 years anyway,” he wrote.\nAt one point, Zuckerberg was asked by Hansen to describe how he was evaluating the competitive threat posed by Instagram and others at the time of the deals. He referenced a quote from former Intel Corp. CEO Andy Grove: “Only the paranoid survive.”\n(Updates with color on Zuckerberg testimony starting in the first paragraph)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveAdjusted first-quarter profit fell to 4 cen\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveInterior Secretary Doug Burgum ordered the pause on\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nA federal judge’s decision, which stated agencies lacked authority to pause funding, follows the president’s executive order to freeze the money on his first day in office.\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nAll is not lost when it comes to investing in Nvidia. Here's what Lawrence McDonald of the Bear Traps Report has to say.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]