[
  {
    "title": "2025-04-15 12-14_Wall Street banks reap $37bn from Trump trading boom",
    "date": "",
    "content": "Title: Wall Street banks reap $37bn from Trump trading boom\nDate: 2025-04-15 12:14\nURL: https://finance.yahoo.com/news/wall-street-banks-reap-37bn-121416945.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWall Street’s biggest banks reaped almost $37bn in trading revenues in the first quarter of the year — their best performance in more than\nJPMorgan Chase & Co. (JPM) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nHere's what is still in effect after this week's 90-day pause on \"reciprocal\" tariffs.\nLowe's (LOW) agreed to acquire interior finishes solutions provider Artisan Design Group from privat\nJohnson & Johnson (JNJ) lifted its full-year operational and reported sales outlook on Tuesday as th\nGrowth in oil demand is expected to slow sharply this year because of the negative impact of US tariffs on trade, the International Energy Agency...\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\n(Bloomberg) -- China’s economy showed surprising strength in early 2025 thanks to consumer subsidies and a rush of export shipments to beat tariffs, although an impasse with Donald Trump over the trade war is darkening its outlook and fueling calls for stimulus.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsChina’s gross domestic product grew 5.4% in\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where The Goldman Sachs Group, Inc. (NYSE:GS) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the […]\nSpeaking on the company’s earnings call, Goldman Sachs (GS) CEO David Solomon said in part: “I would I would say the level of uncertainty is up significantly and it’s partially up because growth was slowing down before we got to the implementation of trade policy” and the implementation of trade policy reset the prospect of forward growth “pretty significantly all over the world.” Solomon added: “I would say that when you get outside of the U.S. and I listened to CEOs, I hear a greater sense of\nAbbott Laboratories (NYSE:ABT) will release its first-quarter earnings results before the opening bell on Wednesday, April 16. Analysts expect the company to report quarterly earnings at $1.07 per share, up from 98 cents per share in the year-ago period. According to data from Benzinga Pro, Abbott Laboratories projects quarterly revenue at $10.41 billion, compared to $9.96 billion a year earlier. On March 10, Bank of America Securities analyst Travis Steed maintained Abbott with a Buy rating and\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 13-00_JPMorgan Chase & Co. (JPM) Is a Trending Stock_ Facts to Know Before Betting on It",
    "date": "",
    "content": "Title: JPMorgan Chase & Co. (JPM) Is a Trending Stock_ Facts to Know Before Betting on It\nDate: 2025-04-15 13:00\nURL: https://finance.yahoo.com/news/jpmorgan-chase-co-jpm-trending-130012113.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJPMorgan Chase & Co. (JPM) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this company have returned +0.3%, compared to the Zacks S&P 500 composite's -3.9% change. During this period, the Zacks Financial - Investment Bank industry, which JPMorgan Chase & Co. falls in, has lost 4.4%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, JPMorgan Chase & Co. is expected to post earnings of $4.44 per share, indicating a change of +0.9% from the year-ago quarter. The Zacks Consensus Estimate has changed -2.3% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $18.06 points to a change of -8.6% from the prior year. Over the last 30 days, this estimate has changed -0.3%.\nFor the next fiscal year, the consensus earnings estimate of $19.31 indicates a change of +6.9% from what JPMorgan Chase & Co. is expected to report a year ago. Over the past month, the estimate has changed -0.9%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, JPMorgan Chase & Co. is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor JPMorgan Chase & Co. the consensus sales estimate for the current quarter of $42.91 billion indicates a year-over-year change of -14.5%. For the current and next fiscal years, $173.59 billion and $178.19 billion estimates indicate -2.2% and +2.7% changes, respectively.\nJPMorgan Chase & Co. reported revenues of $45.31 billion in the last reported quarter, representing a year-over-year change of +8.1%. EPS of $5.07 for the same period compares with $4.63 a year ago.\nCompared to the Zacks Consensus Estimate of $43.23 billion, the reported revenues represent a surprise of +4.82%. The EPS surprise was +9.74%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nJPMorgan Chase & Co. is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about JPMorgan Chase & Co. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWall Street’s biggest banks reaped almost $37bn in trading revenues in the first quarter of the year — their best performance in more than a...\nHere's what is still in effect after this week's 90-day pause on \"reciprocal\" tariffs.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\n(Bloomberg) -- China’s economy showed surprising strength in early 2025 thanks to consumer subsidies and a rush of export shipments to beat tariffs, although an impasse with Donald Trump over the trade war is darkening its outlook and fueling calls for stimulus.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsChina’s gross domestic product grew 5.4% in\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where The Goldman Sachs Group, Inc. (NYSE:GS) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the […]\nMorgan Stanley (MS) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nSpeaking on the company’s earnings call, Goldman Sachs (GS) CEO David Solomon said in part: “I would I would say the level of uncertainty is up significantly and it’s partially up because growth was slowing down before we got to the implementation of trade policy” and the implementation of trade policy reset the prospect of forward growth “pretty significantly all over the world.” Solomon added: “I would say that when you get outside of the U.S. and I listened to CEOs, I hear a greater sense of\nScotiabank raised the firm’s price target on AngloGold Ashanti (AU) to $42 from $34 and keeps a Sector Perform rating on the shares. The firm is updating its price targets on stocks in the Gold & Precious Minerals sector, the analyst tells investors. The firm is expecting flat margins quarter-over-quarter given Q1 is a weaker operating quarter for most companies, with stronger operating performance in the second half of the year. Commentary on potential tariff impact will be a focus for most com\nScotiabank analyst Tanya Jakusconek raised the firm’s price target on Agnico Eagle (AEM) to $126 from $105 and keeps an Outperform rating on the shares. The firm is updating its price targets on stocks in the Gold & Precious Minerals sector, the analyst tells investors. The firm is expecting flat margins quarter-over-quarter given Q1 is a weaker operating quarter for most companies, with stronger operating performance in the second half of the year. Commentary on potential tariff impact will be\n(Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. sold a combined $14 billion of US investment-grade bonds Tuesday, matching the day-earlier total from peers Morgan Stanley and JPMorgan Chase & Co.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingWells Fargo is issuing $8\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 13-03_Is JPMorgan Chase (JPM) Among The Top Goldman Sachs Value Stocks_",
    "date": "",
    "content": "Title: Is JPMorgan Chase (JPM) Among The Top Goldman Sachs Value Stocks_\nDate: 2025-04-15 13:03\nURL: https://finance.yahoo.com/news/jpmorgan-chase-jpm-among-top-130343529.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other Goldman Sachs value stocks to invest in.\nAs we recently discussed in another article, growth stocks are massively overvalued and trading at significant premiums, which is why investment firms advise investors to concentrate on value stocks. Near the end of March 2025, artificial intelligence stocks that had taken the market over by storm faced losses, while undervalued stocks gained momentum. Similarly, hedge fund managers believe that now is the time to invest in value stocks, with cheap equities available across all industries. Banks, energy, consumer durables, healthcare, and media companies offer lucrative investment opportunities.\nSo, what is value investing? Matthew Fine, portfolio manager at Third Avenue Management, describes it as identifying companies trading at a notable discount to a conservative estimate of their true value. These opportunities often arise when a business, industry, or region faces challenges that cause investors to overreact and assume current difficulties will persist long-term. This pessimism creates chances to invest at attractive valuations. While broader equity markets currently appear overvalued, largely driven by the United States, Third Avenue sees overlooked value in many individual companies. Despite a rocky economy, the fund manager believes many quality businesses have become even cheaper, offering compelling opportunities for patient investors. However, the key is to avoid buying a company that seems cheap just because it has temporary advantages that might not last.\nWarren Buffett is the king of value investing, and back in 2023, he commented in his annual shareholder meeting that “what gives you opportunities is other people doing dumb things”. Buffett’s Berkshire picks up stocks when others are panic-selling their holdings, and although the Oracle of Omaha understands that the world is rapidly changing, he still sees several value investing opportunities.\nOverall, the stock market is in mayhem because of the uncertainty brought on by US trade wars and tariffs. However, institutional investors like Goldman Sachs align with the market perspective and have a thriving $634 billion portfolio. So, let’s take a look at the top Goldman Sachs value stocks.\nA group of business people discussing plans around a boardroom table adorned with a financial services company logo.\nTo compile our list of Goldman Sachs' top value stock picks, we searched the investment firm’s Q4 2024 portfolio, starting from the top and assessing the PE ratios as of April 11. From there, we chose the top 12 stocks with PE ratios of 25 or under as Goldman Sachs' value picks. We have also mentioned the Q4 2024 hedge fund sentiment around the holdings for further insight. The list is ranked in ascending order of Goldman Sachs’ stake value.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nGoldman Sachs' Q4 2024 Stake Value: $4,870,962,238\nP/E Ratio as of April 11: 10.98\nNumber of Hedge Fund Holders: 123\nJPMorgan Chase & Co. (NYSE:JPM), a New York-based financial services giant, comes in third on our list of the best Goldman Sachs value stocks. Goldman owns 20.3 million JPM shares as of the fourth quarter of 2024, valued at $4.8 billion and representing 0.76% of the total portfolio.\nOn March 12, Truist Securities maintained a Hold rating on JPM with a price target of $268. Truist noted that most of JPMorgan’s customers have good credit and have stayed steady during the ups and downs in the economy. The bank also has solid financials, shown by its consistent dividend policy.\nJPMorgan’s Q1 2025 profit went up 9% to $14.64 billion, or $5.07 a share. Even without a one-time gain from the First Republic deal, earnings stood at $4.91 per share. The company’s revenue rose 8% to $46.01 billion, supported by solid results in asset management, investment banking, and a notable 48% increase in equities trading. On March 18, 2025, JPMorgan Chase & Co. (NYSE:JPM) declared a $1.40 per share quarterly dividend, a 12% jump from the prior dividend of $1.25. The dividend is payable on April 30, to shareholders on record as of April 4.\nAmong the hedge funds tracked by Insider Monkey, 123 funds reported owning stakes in JPMorgan Chase & Co. (NYSE:JPM) at the end of Q4 2024, compared to 105 funds in the preceding quarter. Andreas Halvorsen’s Viking Global was the leading stakeholder of the company, with 7.46 million shares worth $1.78 billion.\nOverall, JPM ranks 3rd among the Goldman Sachs Value Stocks: Top 12 Stock Picks. While we acknowledge the potential of value stocks, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than JPM but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nBofA analyst Michael Ryskin raised the firm’s price target on Quest Diagnostics (DGX) to $198 from $190 and keeps a Buy rating on the shares. Sentiment for Life Sciences and Diagnostic Tools and Contract Research Organizations is “particularly negative” heading into earnings given that these companies “sit at the intersection of a number of policy changes from the Trump Administration,” including headwinds from NIH budget cuts and global tariffs, as well as broader macro concerns, especially aro\nInvestment management company Vulcan Value Partners recently released its first-quarter 2025 investor letter. A copy of the letter can be downloaded here. The first quarter experienced the return of volatility. The companies’ management teams expressed a more cautious view following the recent election. Optimism has given way to uncertainty about tariffs and potential impacts on earnings, inflation, and […]\nTo use your car as collateral for a loan, you must have equity in it.\nCleanSpark's holdings now exceed 12,000 BTC, worth just over $1 billion at current prices.\nWall Street’s biggest banks reaped almost $37bn in trading revenues in the first quarter of the year — their best performance in more than a...\nHere's what is still in effect after this week's 90-day pause on \"reciprocal\" tariffs.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\n(Bloomberg) -- China’s economy showed surprising strength in early 2025 thanks to consumer subsidies and a rush of export shipments to beat tariffs, although an impasse with Donald Trump over the trade war is darkening its outlook and fueling calls for stimulus.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsChina’s gross domestic product grew 5.4% in\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where Berkshire Hathaway Inc. (NYSE:BRK-B) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading at […]\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where The Home Depot, Inc. (NYSE:HD) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 13-23_Trump Tariffs_ Here's What JPMorgan Investors Need to Know",
    "date": "",
    "content": "Title: Trump Tariffs_ Here's What JPMorgan Investors Need to Know\nDate: 2025-04-15 13:23\nURL: https://www.fool.com/investing/2025/04/15/trump-tariffs-heres-what-jpmorgan-investors-need-t/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=cf6fe2df-4dd3-463b-a16a-4eb93ea05faa&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nDespite recent stock market volatility, JPMorgan Chase (JPM -1.47%) shares are down just 1% year to date, outperforming the 9% decline in the S&P 500 (^GSPC -2.24%) at the time of writing. The banking giant continues to benefit from its fortress-like balance sheet and global diversification, making it well-positioned to navigate any economic environment.\nThat was the message from CEO Jamie Dimon presenting the bank's first-quarter earnings report (for the period ended March 31). JPMorgan topped Wall Street estimates, with revenue climbing 8% year over year, while earnings per share (EPS) of $5.07 was up 14% from the prior-year quarter.\nYet the results arrived with a tone of caution. Jamie Dimon also said the U.S. economy faces \"considerable turbulence\" amid the looming impact of trade tariffs being implemented by the Trump administration.\nLet's discuss what tariffs and a trade war might mean for JPMorgan and its stock price outlook now.\nJPMorgan started the fiscal 2025 year off strongly, with all three of its business segments delivering revenue growth.\nThe flagship Commercial & Investment Bank group saw excellent momentum, driven by optimism about the economic outlook at the beginning of the year and record market levels that propelled trading activity and deal-making. In the Consumer & Community Banking division, card services and auto lending have been growth drivers, reflecting resilient consumer spending. Asset & Wealth Management has also been a bright spot as continued net inflows boosted fee income.\nSome of the key financial metrics that stood out in the first quarter include a 2% year-over-year increase in average loans and deposits, while JPMorgan's book value per share rose 12% compared to Q1 2024, reaching $119.24.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nAlthough it may have been business as usual for the bank in the first quarter, the outlook has grown increasingly uncertain. Officially, the bank is guiding for full-year net interest income of $94.5 billion, a 1% increase from last year. However, this number isn't etched in stone, since it depends on the rapidly changing macroeconomic environment. For now, the escalating trade tensions present an operational and financial headwind.\nIn recent weeks, the Trump administration announced a major U.S. trade policy overhaul, implementing a 10% baseline tariff on most imports, with significantly steeper tariffs on specific countries like China. Although Trump has since rolled back some steps, pausing higher reciprocal tariffs for 90 days for most countries and allowing for some exceptions, experts warn that the measures may still cause economic disruptions. JPMorgan's chief U.S. economist Michael Feroli now estimates a 50% recession probability, indicating that the bank is taking the risks seriously.\nWhile it's too early to fully assess the effects of the tariffs, the widespread market confusion as companies across all sectors adjust to the new environment has several implications for JPMorgan's outlook.\nImage source: Getty Images.\nThere are already indications that mergers and acquisitions have stalled, with dealmakers taking a wait-and-see approach. Companies are likely to reassess hiring plans or push back on major capital investments. For JPMorgan, this means a potential slowdown in its core investment banking business and commercial lending.\nIf a recession does materialize, the consumer banking side of the business would be particularly hard-hit, as loan defaults rise, adding to credit losses. Even with some areas of the bank, such as trading, possibly benefiting from the market volatility across equities and fixed income to offset declines in fees elsewhere, the risk to earnings is tilted to the downside.\nAll this is happening while shares of JPMorgan don't necessarily stand out as a great bargain. Across multiple metrics including the stock's price-to-earnings (P/E) ratio of 11.6 and price-to-book (P/B) value of 2.0, JPMorgan continues to trade at a premium relative to its average valuation multiples over the past five years. One interpretation is that if conditions deteriorate, the stock has room to fall further.\nJPM PE Ratio data by YCharts.\nAmong bank stocks, few rival JPMorgan's strong fundamentals and disciplined capital management, offering shareholders a source of portfolio stability even in a severe economic downturn. A swift de-escalation of trade tensions through clearer policies or negotiations could catalyze a stock rebound. For now, I'm not convinced shares are a buy, and a cautious wait-and-see approach remains prudent.\nThe Motley Fool Stock Advisor service has more than quadrupled the performance of the S&P 500 since its inception in 2002*, and the analyst team knows when to double down. They have re-recommended a handful of stocks in the past, and some of those stocks have produced tremendous returns.\nOpportunity is knocking again. Want to open the door?\nContinue ›\n*Stock Advisor returns as of 04/16/2025\nJPMorgan Chase is an advertising partner of Motley Fool Money. Dan Victor has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends JPMorgan Chase. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-15 13-37_Where Trump Tariffs Stand Now",
    "date": "",
    "content": "Title: Where Trump Tariffs Stand Now\nDate: 2025-04-15 13:37\nURL: https://finance.yahoo.com/m/156e45c2-31f9-3770-98d8-1517935d8c2b/where-trump-tariffs-stand-now.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHere's what is still in effect after this week's 90-day pause on \"reciprocal\" tariffs.\nWall Street’s biggest banks reaped almost $37bn in trading revenues in the first quarter of the year — their best performance in more than a...\nJPMorgan Chase & Co. (JPM) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\n(Bloomberg) -- China’s economy showed surprising strength in early 2025 thanks to consumer subsidies and a rush of export shipments to beat tariffs, although an impasse with Donald Trump over the trade war is darkening its outlook and fueling calls for stimulus.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsChina’s gross domestic product grew 5.4% in\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where The Goldman Sachs Group, Inc. (NYSE:GS) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the […]\nSpeaking on the company’s earnings call, Goldman Sachs (GS) CEO David Solomon said in part: “I would I would say the level of uncertainty is up significantly and it’s partially up because growth was slowing down before we got to the implementation of trade policy” and the implementation of trade policy reset the prospect of forward growth “pretty significantly all over the world.” Solomon added: “I would say that when you get outside of the U.S. and I listened to CEOs, I hear a greater sense of\n(Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. sold a combined $14 billion of US investment-grade bonds Tuesday, matching the day-earlier total from peers Morgan Stanley and JPMorgan Chase & Co.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingWells Fargo is issuing $8\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 18-41_Trump Ally Marjorie Taylor Greene Bought Tesla, Amazon, Blackstone Before Rally",
    "date": "",
    "content": "Title: Trump Ally Marjorie Taylor Greene Bought Tesla, Amazon, Blackstone Before Rally\nDate: 2025-04-15 18:41\nURL: https://finance.yahoo.com/news/trump-ally-marjorie-taylor-greene-184112118.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Representative Marjorie Taylor Greene sold US Treasuries and bought stakes in Amazon.com Inc., Blackstone Inc. and Tesla Inc. the day before President Donald Trump put a 90-day pause on retaliatory tariffs and prompted a market rally.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nEven Oslo Has an Air Quality Problem\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\n$15 Million Fund Bets Leadership Training Can Improve Chicago Policing\nGreene, the Georgia Republican who’s a close ally of Trump, revealed the transactions in a financial disclosure last week.\nGreene’s trades were executed over two days, April 8 and 9. On the morning of the 9th, Trump posted on social media that it was a “great time to buy.” About four hours later, he announced he was suspending tariffs, propelling the S&P 500 index to a 9.5% gain, its biggest rally since 2008.\nGreene’s office did not immediately respond to a request for comment.\nGreene, one of the first lawmakers to file a disclosure since Trump announced his tariffs, is an active trader in stocks, filing eight disclosures so far this year. She’s been particularly bullish on the semiconductor and tech industries. Her sale of Treasuries, though, was the first time she’s sold after buying more than $500,000 of the government-backed securities since the beginning of 2025.\nCongressional Democrats have urged investigations into whether people connected to Trump profited from the timing of the tariff announcements.\nIn a letter to the Securities and Exchange Commission, Senator Elizabeth Warren of Massachusetts said she did not know which officials may have had advance knowledge, but called it “unconscionable” that insiders may have profited from the market volatility.\nThe disclosure reports only require members to list values of transactions in broad ranges, and do not contain specific times of execution or cost basis, so it’s unclear precisely how many of Greene’s trades happened before Trump broke the news of the tariff pause.\nBut at least $11,011 to $165,000 in purchases came on April 8. As of 11:20 a.m. Tuesday in New York, shares of Blackstone, JPMorgan Chase & Co. and Tesla traded higher than at any point on that day.\nOver the two days, her stock purchases totaled $21,021 to $315,000. She sold $50,001 to $100,000 of US Treasuries on April 8.\nAmong the other names in Greene’s purchases were chipmakers Nvidia Corporation, Advanced Micro Devices Inc. and Qualcomm Inc., along with apparel companies Lululemon Athletica Inc. and Nike Inc.\n(Updates with Greene’s trading history in fifth paragraph)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nThe Beauty Salon Recession Indicator\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nTrade Tensions With China Clear Path for Salt-Powered Batteries\n©2025 Bloomberg L.P.\nThe chairman of the Federal Reserve has warned that Donald Trump’s trade war will fuel inflation and keep interest rates higher for longer, triggering a steep sell-off on Wall Street.\nLululemon (LULU) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nThe stock market has been crashing this year and if you're a long-term investor, it can be a good time to invest in companies at discounted valuations.  Three stocks that are in a free fall right now that I still wouldn't bother buying today are Tesla (NASDAQ: TSLA), Tilray Brands (NASDAQ: TLRY), and Rigetti Computing (NASDAQ: RGTI).  Shares of electric vehicle maker Tesla are down 37% year to date, and there is no shortage of reasons to explain why the stock is struggling.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-33_JPMorganChase Declares Preferred Stock Dividends",
    "date": "",
    "content": "Title: JPMorganChase Declares Preferred Stock Dividends\nDate: 2025-04-15 20:33\nURL: https://finance.yahoo.com/news/jpmorganchase-declares-preferred-stock-dividends-203300642.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNEW YORK, April 15, 2025--(BUSINESS WIRE)--JPMorgan Chase & Co. (NYSE: JPM) (\"JPMorganChase\" or the \"Firm\") has declared dividends on the outstanding shares of the Firm’s Series DD, EE, GG, JJ, KK, LL, MM and NN preferred stock. Information can be found on the Firm’s Investor Relations website at https://www.jpmorganchase.com/ir/news.\nJPMorgan Chase & Co. (NYSE: JPM) is a leading financial services firm based in the United States of America (\"U.S.\"), with operations worldwide. JPMorganChase had $4.4 trillion in assets and $351 billion in stockholders’ equity as of March 31, 2025. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250415823606/en/\nContacts\nInvestor Contact:Mikael Grubb212-270-2479Media Contact:Joseph Evangelisti212-270-7438\nBeyond analysts' top -and-bottom-line estimates for Comerica (CMA), evaluate projections for some of its key metrics to gain a better insight into how the business might have performed for the quarter ended March 2025.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nDespite recent stock market volatility, JPMorgan Chase (NYSE: JPM) shares are down just 1% year to date, outperforming the 9% decline in the S&P 500 (SNPINDEX: ^GSPC) at the time of writing.  The banking giant continues to benefit from its fortress-like balance sheet and global diversification, making it well-positioned to navigate any economic environment.  JPMorgan topped Wall Street estimates, with revenue climbing 8% year over year, while earnings per share (EPS) of $5.07 was up 14% from the prior-year quarter.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nGoldman Sachs JPMorgan Chase  and  Morgan Stanley  all said a surge in trading revenue helped lift their profits in the first quarter and beat expectations.  Bank trading desks have been collecting more fees from investors scrambling to reduce or dial up the risk in their portfolios on any new clue about how  President Trump’s  tariffs might ultimately play out.  Combined, the three banks earned more than $12 billion in fees in their equities businesses, the desks that run stock-market related activities for clients.\nMorgan Stanley (MS) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to […]\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nAccretive oil and gas prices are likely to have aided upstream operations of BP and SLB in the first quarter of 2025.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-35_JPMorganChase 2025 Annual Meeting of Shareholders",
    "date": "",
    "content": "Title: JPMorganChase 2025 Annual Meeting of Shareholders\nDate: 2025-04-15 20:35\nURL: https://finance.yahoo.com/news/jpmorganchase-2025-annual-meeting-shareholders-203500250.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNEW YORK, April 15, 2025--(BUSINESS WIRE)--As previously announced, the JPMorgan Chase & Co. (NYSE: JPM) (\"JPMorganChase\" or the \"Firm\") annual meeting of shareholders will be held on Tuesday, May 20, 2025 at 10:00 a.m. (Eastern). The meeting will be held virtually.\nAttending the annual meeting\nTo participate in the virtual meeting, visit http://www.virtualshareholdermeeting.com/JPM2025 and enter the 16-digit control number included on your proxy card, voting instruction form or notice you previously received.\nShareholders may submit questions either before the meeting, from April 23, 2025 through May 14, 2025, or during a portion of the meeting. If you wish to submit a question before the meeting, you may log into www.proxyvote.com using your 16-digit control number and follow the instructions to submit a question. Alternatively, if you wish to submit a question during the meeting, log into the virtual meeting platform at http://www.virtualshareholdermeeting.com/JPM2025 using the 16-digit control number and follow the instructions to submit a question. Questions pertinent to meeting matters will be answered during the meeting, subject to time limitations.\nAccess for the general public\nA live audio webcast of the event will also be available at www.jpmorganchase.com under Investor Relations, Events & Presentations.\nThe general public can also listen to the meeting by dialing (877) 358-7301 in the U.S. and Canada or +1 (213) 992-4623 for international participants. Please dial in 10 minutes prior to the start of the meeting.\nJPMorgan Chase & Co. (NYSE: JPM) is a leading financial services firm based in the United States of America (\"U.S.\"), with operations worldwide. JPMorganChase had $4.4 trillion in assets and $351 billion in stockholders’ equity as of March 31, 2025. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing and asset management. Under the J.P. Morgan and Chase brands, the Firm serves millions of customers in the U.S., and many of the world’s most prominent corporate, institutional and government clients globally. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250415525429/en/\nContacts\nInvestor Contact: Mikael Grubb, 212-270-2479\nMedia Contact: Joseph Evangelisti, 212-270-7438\nDespite recent stock market volatility, JPMorgan Chase (NYSE: JPM) shares are down just 1% year to date, outperforming the 9% decline in the S&P 500 (SNPINDEX: ^GSPC) at the time of writing.  The banking giant continues to benefit from its fortress-like balance sheet and global diversification, making it well-positioned to navigate any economic environment.  JPMorgan topped Wall Street estimates, with revenue climbing 8% year over year, while earnings per share (EPS) of $5.07 was up 14% from the prior-year quarter.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nWe recently published a list of 12 Best Gambling Stocks to Buy According to Analysts. In this article, we are going to take a look at where Caesars Entertainment, Inc. (NASDAQ:CZR) stands against other best gambling stocks to buy according to analysts. Gambling stocks include companies that own, run, or manage lawful gambling activities and […]\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nAccretive oil and gas prices are likely to have aided upstream operations of BP and SLB in the first quarter of 2025.\nWe recently published a list of 12 Best Gambling Stocks to Buy According to Analysts. In this article, we are going to take a look at where Las Vegas Sands Corp. (NYSE:LVS) stands against other best gambling stocks to buy according to analysts. Gambling stocks include companies that own, run, or manage lawful gambling activities […]\nThe U.S. government ”indicated that the license requirement addresses the risk that the covered products may be used in, or diverted to, a supercomputer in China,” Nvidia said.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 21-05_Goldman, Wells Fargo Lead $17 Billion Bank Borrowing Spree",
    "date": "",
    "content": "Title: Goldman, Wells Fargo Lead $17 Billion Bank Borrowing Spree\nDate: 2025-04-15 21:05\nURL: https://finance.yahoo.com/news/goldman-wells-fargo-lead-17-210503053.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. sold a combined $14 billion of US investment-grade bonds Tuesday, matching the day-earlier total from peers Morgan Stanley and JPMorgan Chase & Co.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\n$15 Million Fund Bets Leadership Training Can Improve Chicago Policing\nWells Fargo is issuing $8 billion of bonds in four parts, while Goldman sold $6 billion in three parts, according to people with knowledge of the matter. The market’s third borrower Tuesday, Japanese financial firm Mitsubishi UFJ Financial Group Inc., priced $3 billion of notes.\nThe longest portion of Wells’ offering, an 11-year security, yields 1.28 percentage point above Treasuries, said one of the people, who asked not to be identified as the details are private. Goldman’s longest portion, a six-year tranche, yields 1.25 percentage point above Treasuries, a separate person said.\nMorgan Stanley, JPMorgan Lead $16.5 Billion Bank Borrowing Spree\nIt’s common for the biggest US banks to sell debt shortly after releasing quarterly results. But there were some questions this go-around after the primary market froze earlier this month in the wake of an evolving global trade war.\nTuesday’s deals received orders 3.3 times the amount of bonds sold, according to Bloomberg’s Brian Smith, compared with 3.8 times on Monday.\n“Clearly there’s appetite for sizable bank issuances,” said Peter Simon, an analyst who covers the sector at research firm CreditSights. “We don’t see much evidence that the market is overly concerned with these banks, which makes sense given their results have been solid this quarter.”\nGoldman reported record revenue in the first quarter, while Wells Fargo’s report pointed to soft loan demand amid the ongoing tariff uncertainty. Wells’ net interest income, the difference between what it makes from lending and pays for deposits, fell short of analysts’ projections. Still, non-interest expenses were better than forecast as Chief Executive Officer Charlie Scharf works to cut costs.\nIn the high-grade market, banks have underperformed in recent weeks, with TD Securities credit strategist Hans Mikkelsen writing that was likely due to expectations of new debt sales. The average bank bond spread widened 24 basis points this month through Monday, more than investment-grade notes overall while yields for the latter briefly hit 11-month highs last week.\nThat has lured yield buyers into the market, setting things up well to digest the banks’ debt sales, said Samuel Wilson, a portfolio manager at Voya Investment Management.\nBank of America Corp. and Citigroup Inc. are candidates to issue debt after they released first-quarter results Tuesday.\nComing into earnings season, JPMorgan strategists Kabir Caprihan and Vincent Barretta predicted the six big US banks could might issue about $32 billion of bonds. That compares with an average $23 billion this time each year from 2014 through 2024. The four deals completed so far have raised $28 billion.\n(Updates throughout.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nThe Beauty Salon Recession Indicator\nTrump Is Firing the Wrong People, on Purpose\nTrade Tensions With China Clear Path for Salt-Powered Batteries\n©2025 Bloomberg L.P.\nApple, NVIDIA, Advanced Micro Devices, Amazon.com and Alphabet are included in this Analyst Blog.\n(Reuters) -     U.S. bank PNC Financial  (PNC) reported a rise in first-quarter profit on Tuesday, helped by a boost in interest income.\n(Bloomberg) -- Gold edged toward the record high set on Monday, as the Trump administration pressed ahead with probes that could broaden the US’s sweeping trade war.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceEven Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingBullion rose to top $3,230 an ounc\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, […]\nCitigroup shares rose in early trading Tuesday after the bank reported better-than-expected first-quarter results as volatile markets boosted equities trading.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where The Goldman Sachs Group, Inc. (NYSE:GS) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the […]\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWith consumers and businesses alike worried about tariffs, economists are looking to see if “soft data” like recent weak consumer sentiment surveys will feed into “hard data” reports like retail sales and inflation.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where JPMorgan Chase & Co. (NYSE:JPM) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 05-42_1 Wall Street Analyst Thinks JPMorgan Chase Stock Is Going to $260. Is It a Buy_",
    "date": "",
    "content": "Title: 1 Wall Street Analyst Thinks JPMorgan Chase Stock Is Going to $260. Is It a Buy_\nDate: 2025-04-16 05:42\nURL: https://www.fool.com/investing/2025/04/16/1-wall-street-analyst-thinks-jpmorgan-chase-stock/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=77c5ffbb-7816-4755-9828-685f468d7f02&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nOne analyst believes JPMorgan Chase (JPM -1.47%) stock isn't the bargain it once was. He substantially lowered his price target on the \"Big Four\" U.S. bank last week, yet he remains bullish on its prospects. Here's a detail or several about his new take on the company, and whether his positive outlook is warranted.\nCFRA's Kenneth Leon published an update on JPMorgan Chase following the bank's unveiling of its first-quarter results Friday morning. As in preceding quarters the lender did well, posting solid year-over-year growth on both the top and bottom lines, and topping the consensus analyst estimates for both. \nYet like the rest of the world's businesses, JPMorgan Chase is currently sailing in unfamiliar waters. This was the crux of Leon's price target reduction, according to reports. The analyst wrote that he was narrowing his equity risk premium on the stock due to the currently high level of global uncertainty around U.S. trade policy. \nNevertheless, Leon was very complimentary about the bank's trailing performance. In his view, all of JPMorgan Chase's businesses demonstrated robust health during the quarter, with its commercial and investment bank division especially benefiting from recent market volatility.\nWith all this considered, Leon cut his price target to $260 per share, from his former $310. As that's nearly 12% higher than the company's most recent closing level; but he maintained his buy recommendation.\nIt can be tough to stay bullish on a business so exposed to the whims of the global economy. JPMorgan Chase, though, has a very solid balance sheet and a management team that knows how to earn coin in even the most turbulent times. I think maintaining a bullish stance is the smart move with this stock, and I'd be a buyer at the current discount price.\n\n \n\nBefore you buy stock in JPMorgan Chase, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and JPMorgan Chase wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nJPMorgan Chase is an advertising partner of Motley Fool Money. Eric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends JPMorgan Chase. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 08-00_Big banks maintain 'the sky is not falling' amid Trump tariff turmoil. So far.",
    "date": "",
    "content": "Title: Big banks maintain 'the sky is not falling' amid Trump tariff turmoil. So far.\nDate: 2025-04-16 08:00\nURL: https://finance.yahoo.com/news/big-banks-maintain-the-sky-is-not-falling-amid-trump-tariff-turmoil-so-far-080012863.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBig banks are offering the latest view of how their customers are faring amid President Trump's tariff turmoil, and it's not all bad — at least for now.\n\"The message has really been that the sky is not falling,\" Saul Martinez, a bank analyst for HSBC, told Yahoo Finance on Tuesday.\nFive of the country's largest banks over the past week posted first quarter rises in profits and revenue, driven in part by trading operations that benefited from the market volatility triggered by the initial rollout of Trump's first tariffs in February and March.\nRead more: The latest news and updates on Trump's tariffs\nCollectively, net profits at JPMorgan Chase (JPM), Bank of America (BAC), Citigroup (C), Morgan Stanley (MS), and Goldman Sachs (GS) amounted to $35 billion, a 13% increase from the year-ago quarter. Revenue also rose at all of these banks. Trading revenue alone jumped 17% to more than $36 billion.\nMany banks said their consumer customers were still spending, defaults were still manageable, and businesses were not experiencing distress despite the uncertainty about the months ahead. None of the institutions with big Wall Street footprints updated their earnings outlooks for the rest of the year, either.\nWhat these results didn't include, however, was the volatile period that followed Trump's April 2 \"Liberation Day\" tariff announcement, which took place two days after the quarter ended. Stocks and bonds plunged and have yet to fully recover, ushering in new uncertainty about the economy and the safety of US assets.\n\"We're surprised about the degree of ongoing firmwide strength at all 5 big banks ... and the more than expected upbeat views,\" said Wells Fargo banking analyst Mike Mayo in a Tuesday note.\n\"To us, it all says that events since Apr 2 can still be little more than a speed bump, so long as policy moves faster to help ease most of the uncertainty,\" he added, in reference to promised deregulation of the banking industry expected from the Trump administration.\nNot that banks and their top executives were entirely upbeat. Goldman Sachs CEO David Solomon said that the prospect of a recession \"has increased.\" JPMorgan CEO Jamie Dimon said the economy faces \"considerable turbulence,\" with a recession as a \"likely outcome.\"\nIn such a scenario, he added, \"earnings won't be great and the stocks will go down.\"\nBut many bankers were noticeably more optimistic. The word \"recession\" did not come up once on Citigroup's Tuesday earnings calls with analysts. Jane Fraser, CEO of Citigroup, also offered an optimistic vision of the current turmoil.\n\"When all is said and done, and longstanding trade imbalances and other structural shifts are behind us, the U.S. will still be the world's leading economy,\" she said in a statement with the bank's Tuesday earnings release.\nBrian Moynihan, CEO of Bank of America, went out of his way on Tuesday to note that his bank's research team doesn't see a recession happening in 2025.\nRead more: What is a recession, and how does it impact you?\nUS consumers, he added, keep \"pushing money into the economy,\" and the lender's business clients \"remain profitable, liquid and have strong results.\"\nBut \"nobody has a perfect crystal ball,\" Moynihan acknowledged, noting that \"we potentially face a changing economy in the future.\"\nSome banks even showed a rise in investment banking income during the first quarter, defying predictions of a slowdown. Executives acknowledged some deals were now on hold due to uncertainties, but many described the pullbacks as temporary rather than long-lasting.\n\"I'm saying pause versus delete,\" Morgan Stanley CEO Ted Pick told analysts of the current investment banking environment. \"We don't know whether the economy is going to contract.\"\nEven amid the optimism, there were signs that banks are preparing for harder times. JPMorgan, Bank of America, Citigroup, and Wells Fargo (WFC) added $8.4 billion in provisions to account for future loan losses.\nThe figure was 29% higher than the year-ago period and 9% higher than the previous quarter.\n\"We're still in a cloudy period. It's going to be choppy from here, and it's exhausting,” Ken Leon, an analyst for CFRA Research, told Yahoo Finance.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nDon’t be fooled by the calm. There’s still great uncertainty about tariffs and the economy. It could take months for things to shake out.\nMorgan Stanley analyst Kristine Liwag updated her defense sector view to “Attractive” from “In-line.” Northrop Grumman stock is her “top pick.”\nFederal Reserve Chairman Jerome Powell sent stocks lower when he commented about the impact of President Trump's tariffs and how it may affect inflation and a potential rate cut.\nNEW YORK (Reuters) -Oil prices were little changed on Tuesday as investors digested the latest headlines on U.S. President Donald Trump's on-again, off-again tariffs and tried to figure how much the U.S.-China trade war could reduce global economic growth and oil demand.  Brent crude futures fell 21 cents, or 0.3%, to settle at $64.67 per barrel, while U.S. West Texas Intermediate (WTI) crude fell 20 cents, or 0.3%, to settle at $61.33.  The International Energy Agency followed on Tuesday with its projection that global oil demand in 2025 will grow at its slowest rate for five years due to worries about economic growth from Trump’s trade tariffs.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-00_Big banks were counting on American prosperity, but volatility works too_ Morning Brief",
    "date": "",
    "content": "Title: Big banks were counting on American prosperity, but volatility works too_ Morning Brief\nDate: 2025-04-16 10:00\nURL: https://finance.yahoo.com/news/big-banks-were-counting-on-american-prosperity-but-volatility-works-too-morning-brief-100049217.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThis is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\nThe chart of the day\nWhat we're watching\nWhat we're reading\nEconomic data releases and earnings\nThe American growth trade as we know it — juiced by AI might, hopes of a soft landing, and coming deregulation — may have fallen away. But an outgrowth of shifting tariff policies has sparked another lucrative exchange on Wall Street: the volatility trade.\nA surge in trading activity has shuttled billions of dollars to the nation’s largest banks as investors have attempted to protect their money or deploy it in the face of market gyrations.\nBy subscribing, you are agreeing to Yahoo's \n                        \n                            Terms\n                        \n                     and \n                        \n                            Privacy Policy\n                        \n\nEarnings reports from the big five banks in recent days revealed they collectively raked in nearly $37 billion in trading revenue this past quarter, touting record sales from equities changing hands.\nWarren Buffett famously urged investors to “be fearful when others are greedy and greedy when others are fearful.” A corollary for the financial institutions facilitating those trades is to sit back in any environment and collect fees.\nWall Street wants stocks to go up, sure, but most importantly, it just wants stocks to move.\nThe big banks' trading may mostly be for hedge funds, pensions, and large companies — big institutional investors. But everyone's rolling up their sleeves at the volatility and tinkering with their portfolios, looking to optimize or take advantage of the moment.\nAs my colleague Josh Schafer reports, everybody's trading. Dip-buying flows following the week of “Liberation Day” reached record levels, according to data from VandaTrack, including $3 billion in net purchases on April 3. That was the largest daily total since VandaTrack began collecting the data in 2014.\nBuying at recent lows and FOMO trading explained much of the heightened activity. But another interpretation is that an entire class of retail investor has been trained to throw their cash into stocks in a continuation of a pandemic-era shift in personal finance.\nYou are probably better off not looking at your diminished 401(k) account when the market is convulsing. But pushing an order on a trading app has become something of a pastime for an increasingly large American demographic, the foundation for group chats among young people, and the basis for an entire genre of aspirational lifestyle content.\nThat big banks' big shot clients are doing this too is a great \"stars, they're just like us\" moment. But it's also part and parcel of the same volatility that's been a hallmark of the 2025 stock market and a lesson in the importance of a diversified portfolio of banks' business lines.\nThat these banks can up their profitability amid economic uncertainty and a lack of an anticipated IPO boom isn’t unique to volatile trading. A similar dynamic was at play earlier this year, when a major market narrative was whether the Fed would continue to ease rates. (The Fed cut rates in September, November, and December but has since paused.)\nFurther rate cuts would have curtailed banks’ lending margins, which were supercharged by the central bank’s years-long tightening campaign. But the big banks could have done just fine in a low-rate environment because they can lean on other commercial operations to cover revenue losses elsewhere.\nThe diversified nature of financial services allows the nation's biggest banks to profit even when the outlook grows darker. It's not clear how the American exceptionalism trade will unfold in the months ahead. Tax cuts and other business-friendly deregulatory efforts are in the offing.\nIn the meantime, as long as money is still moving and greasing the trading gears, at least one part of Wall Street will be happy.\nHamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on X @hshaban.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nAR, ALYAF and KBCSY made it to the Zacks Rank #1 (Strong Buy) momentum stocks list on April 16, 2025.\nThe effects of the White House’s tariff policy on inflation could be less transitory and more “persistent,” said Powell on Wednesday.  “Tariffs are highly likely to generate at least a temporary rise in inflation,” the Fed chief said, but their “effects could also be more persistent.”  Powell himself said at the last Fed meeting that his base case is for transitory inflation.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nJP Morgan took the leading position in terms of deal value by advising on transactions totalling $127.3bn.\nMeta CEO Mark Zuckerberg on Monday took the stand during the first day of a trial he hoped to avoid as the tech giant faces off against President Trump's antitrust cops in a case that threatens the $1.3 trillion empire Zuckerberg built.\nThe bank has also sent letters to more than 1,000 Chase patrons since October asking for funds to be returned.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-00_Trump energy boss’s company plunging 40% is a warning for US oil production",
    "date": "",
    "content": "Title: Trump energy boss’s company plunging 40% is a warning for US oil production\nDate: 2025-04-16 10:00\nURL: https://finance.yahoo.com/news/trump-energy-boss-company-plunging-100000589.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nEnergy Secretary Chris Wright says Donald Trump’s administration is giving the “green light” to more US oil production, but the signal from the fracking company he used to run is flashing bright red.\nLiberty Energy Inc. (LBRT), which Wright led until his appointment to Trump’s cabinet, has tumbled 43% this year, one of the most precipitous declines among US energy stocks. The value of Wright’s stake in Liberty has fallen by nearly half to about $30 million over that period.\nLiberty’s rout is a warning that all is not well in America’s shale patch, despite Trump’s pledge to achieve “energy dominance.” Oil field servicers often provide the first indication of an industry downturn because they’re the ones hired to drill and frack new wells. After the trade war and OPEC’s recent decision to hike production knee-capped crude prices, investors expect US shale producers to avoid pumping more barrels into an oversupplied market.\nA drop in spending on services means US oil production could stall, or even decline this year, for the first time since the pandemic. So far, servicers are getting the brunt of the impact from tariff fears: An index of the companies has slid 28% this year, compared with 7% for oil and gas producers.\n“It’s just going to be painful,” said Dan Pickering, chief investment officer at energy-focused financial services firm Pickering Energy Partners. “What comes next, and we’ve already heard whispers of this, it will be slowing down of drilling activity, releasing frack crews.”\nLiberty is due to kick off earnings season for oil field servicers on Wednesday after the market closes, with larger rivals Halliburton Co. (HAL), Baker Hughes Co. (BKR) and SLB (SLB) to follow next week.\nOil field service companies are largely dependent on producer spending on drilling and fracking new wells for their income, leaving them uniquely vulnerable to downturns. Producers like Diamondback Energy Inc. and Devon Energy Corp., by contrast, can continue to earn revenue from their existing wells. Plus, they have the option of hedging oil prices and renegotiating for lower-cost drilling contracts.\nEven before tariffs, servicers had been suffering from lower demand as shale producers become more efficient, which means fewer drilling days and workers to do the same job. Investors will find out soon if further cuts are coming as contracts inked before the trade war expire and producers respond to the slump in crude prices.\nWest Texas Intermediate crude oil, the US benchmark, closed at $61.33 on Tuesday, down 14% this year.\n“We would not be surprised to see US oil output decline” if low prices persist, Barclays Plc analysts led by Amarpreet Singh wrote in a note to clients on Friday.\nA representative for Liberty declined to comment, citing a mandated quiet period ahead of the company’s earnings release. Wright didn’t immediately respond to requests for comment. The energy secretary did, however, put a positive spin on the market in an interview with Bloomberg TV on April 11. Trump’s election gave a “green light” to increase production, with pledges to roll back regulation and expand oil lease sales and permitting, he said.\n“Now there is extra fear of world economic growth in the next few months among the tariffs dialogue,” he said. “The marketplace may be discounting the wrong answer here. We will see very positive economic growth in the next few years.”\nInvestors and analysts aren’t convinced. US revenue for the five biggest frack providers is expected to drop by almost $1 billion this year, a 5% decline and the second consecutive annual drop, according to data compiled by Bloomberg. Last week, producers idled oil rigs in US shale fields at the fastest pace in almost two years.\nUS shale is on the brink of major cutbacks, according to JPMorgan Chase & Co (JPM). The industry will cut 50 oil rigs at a sustained $60 a barrel WTI price, reducing production by half a million barrels a day, analysts led by Arun Jayaram wrote in a note this week. If prices drop to $55 a barrel, the impact doubles, the analysts said.\nPrices falling below $60 “will create softness that’s going to cost us jobs,” said T.M. “Roe” Patterson, co-founder and managing partner at private equity fund Marauder Capital. “We’re going stack rigs and we’re going to see an industry pullback,” Patterson said.\nStill, oil field servicers are unlikely to go bankrupt in droves like they did during the 2014 and 2020 downturns. Balance sheets are much healthier after the pandemic as companies focus on capital discipline, said Jeff Krimmel, owner of energy strategy consulting firm Krimmel Strategy Group.\n“It’s not like you’re going to see huge swaths of the sector struggling with liquidity, struggling to pay their bills,” Krimmel said. “For the ones that are best differentiated with technology, this might actually be an opportunity for them to make a more compelling case even than they have to this point.”\nFor his part, Wright wants the oil patch to focus on the benefits he says the Trump administration will bring over the long term. Trump has been clear about his desire for more crude output and lower prices, which will help bring “prosperity at home and peace abroad,” Wright said.\nPredictions “of the demise of demand growth for oil are older than I am,” he said in the Bloomberg TV interview. “A long-term growth rate of oil has been going on for decades. I don’t see any big change in that in the foreseeable future.”\nBut concerns about demand are riding high in an industry that overwhelmingly supported Trump with cash and votes in his run for the White House.\n“I would like to see the administration do a little more to put some consistency in their messaging around crude oil and to backstop pricing a little bit,” Patterson said. “Frankly, everything they’re saying right now is kind of counterintuitive.”\n©2025 Bloomberg L.P.\nIt's been a rough start to 2025, with the S&P 500 having its worst quarter since 2022 followed by escalating trade tensions in April.  Investors looking for broad-based exposure to the utilities sector might want to consider an exchange-traded fund (ETF) like the Vanguard Utilities ETF (NYSEMKT: VPU).  Utilities are the second-best-performing sector year to date and one of just two sectors that are up slightly compared to the S&P 500's more than 8% drop.\nWell-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL). Brown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet’s core internet search business. Details About Brown’s Decision and His Motivation After selling half of his GOOG […]\nIncome investors can look at the proverbial glass of water as half-full amid intense stock market volatility.  Energy Transfer LP (NYSE: ET) is on the bubble to qualify for this list.  This midstream energy leader's business should hold up quite well even if President Trump's steep tariffs remain in place.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nSimple tools are often the best when it comes to researching growth stocks. To speed up your analysis, use the Composite Rating.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 11-41_JP Morgan, Houlihan Lokey lead M&A advisory rankings in North America for Q1 2025",
    "date": "",
    "content": "Title: JP Morgan, Houlihan Lokey lead M&A advisory rankings in North America for Q1 2025\nDate: 2025-04-16 11:41\nURL: https://www.privatebankerinternational.com/news/jp-morgan-houlihan-lokey/?.tsrc=rss\nContent:\nJP Morgan took the leading position in terms of deal value by advising on transactions totalling $127.3bn.\nJP Morgan and Houlihan Lokey have emerged as the leading mergers and acquisitions (M&A) financial advisers in North America for the first quarter of 2025, according to GlobalData’s latest financial advisers league table.\nThis ranking evaluates financial advisers based on the value and volume of M&A transactions they have facilitated.\n\n                                The gold standard of business intelligence.\n                            \n\n                                    Find out more\n                                    \n\n\n\n\nAccording to GlobalData’s Deals Database, JP Morgan secured its top position in terms of deal value, advising on transactions worth a total of $127.3bn.\nHoulihan Lokey led in deal volume, successfully advising on 54 transactions during the same period.\nGlobalData lead analyst Aurojyoti Bose said: “Both JP Morgan and Houlihan Lokey were the top advisers by value and volume in Q1 2024 and retained their respective leadership positions in Q1 2025 as well. Houlihan Lokey was the only adviser to have advised on more than 50 deals during Q1 2025. Meanwhile, JP Morgan was among the only two advisers that managed to surpass the $100bn mark in total deal value during the review period, but still it was comfortably ahead of the firm occupying the second position by value.\n“More than half of the deals advised by JP Morgan during Q1 2025 were billion-dollar deals* and involvement in these big-ticket deals helped it secure the top position by value. During Q1 2025, it advised on 25 billion-dollar deals that also included four mega deals valued more than or equal to $10bn.”\nThe analysis further indicates that Goldman Sachs ranked second in terms of value, advising on $110.9bn worth of deals, followed by Morgan Stanley with $89bn, Citi with $76.5bn, and Barclays with $66.7bn.\nIn terms of deal volume, JP Morgan held the second position with 43 transactions, followed by Goldman Sachs with 36 deals, Morgan Stanley with 31 deals, and Piper Sandler with 25 deals.\nGlobalData’s league tables are based on the real-time tracking of thousands of company websites, advisory firm websites and other reliable sources available on the secondary domain. A dedicated team of analysts monitors all these sources to gather in-depth details for each deal, including adviser names.\nTo ensure further robustness to the data, the company also seeks submissions of deals from leading advisers.\n\n\n\n                The gold standard of business intelligence.\n            \n\n\n                    Find out more\n                    \n\n\n\n\nGive your business an edge with our leading industry insights.\nGive your business an edge with our leading industry insights. \n\n\n\n\n\n                                                                                                                                Private Banker In Brief                                                                                                                         \n\n\n\n\n\n\n\n\n                                                                                                                        Private Banker International : Private Banker International Focus (monthly)                                                                                                                        \n\n\n\n\n\n\n\n\n                                                                                                                                Thematic Take (monthly)                                                                                                                        \n\n\n\n\n\n\n                                                    I consent to Verdict Media Limited collecting my details provided via this form in accordance with  Privacy Policy\n\n\nView all newsletters from across the GlobalData Media network.\n\n\n\n\t\t\t\tPowered by\n\t\t\t\t\n\n© Verdict Media Limited 2025\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance.\n\nAs part of GlobalData's extensive network of websites, this site is dedicated to protecting your privacy. We may store and access personal data such as cookies, device identifiers or other similar technologies on your device and process such data to enhance site navigation,  personalize ads and content when you visit our sites, measure ad and content performance, gain audience insights, analyze our site traffic as well as develop and improve our products and services.  Further information on the cookies we use and their purpose can be found on our website privacy policy accessiblehere.\n\nWe use necessary cookies to make our site work.  Necessary cookies enable core functionality such as security, network management, and accessibility. You may disable these by changing your browser settings, but this may affect how the website functions.  We'd also like to set optional cookies to help us improve our website and help improve your experience whilst on our website. \n\nBy clicking ‘Accept All Cookies’ you agree to us enabling all optional cookies for these purposes. Alternatively, you can set which optional cookies you wish to enable (and update your preferences including withdrawing your consent) at any time, by clicking ‘Cookie Settings’."
  },
  {
    "title": "2025-04-16 12-14_Big banks push for simpler mortgage rules as housing market slows",
    "date": "",
    "content": "Title: Big banks push for simpler mortgage rules as housing market slows\nDate: 2025-04-16 12:14\nURL: https://finance.yahoo.com/news/big-banks-push-for-simpler-mortgage-rules-as-housing-market-slows-121402040.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBig banks are urging the Trump administration to simplify regulations relating to mortgage loan origination, servicing, and securitization in the hope that these reforms may lower costs and boost lending activity in the struggling US housing market.\n\"In terms of mortgages, reducing unnecessary regulations would decrease homeownership costs,\" JPMorgan Chase (JPM) CEO Jamie Dimon wrote in his annual shareholder letter.\n\"Streamlining loan origination and servicing standards, reducing capital requirements and simplifying securitization rules would reduce the cost of mortgages without making them riskier. These simple reforms could lower the cost of mortgages by 70–80 basis points.\"\nThis push for reform comes as JPMorgan's mortgage volume fell to $11.2 billion in the first quarter ending March 31, down from $14.2 billion in the fourth quarter of 2024. Meanwhile, home lending from the bank's retail channel fell to $9.4 billion from $12.1 billion in the fourth quarter of 2024.\nOther banks have also struck a similar tone during recent conference calls following quarterly earnings.\nBank of America (BAC) CEO Brian Moynihan told investors during the company’s first quarter earnings call this week that he is hopeful for change as new policymakers take office.\n\"It’s critically important that we get this rebalance,\" Moynihan said. \"Sometimes the regulation gets in the way of that.” At Bank of America, home lending held steady at $254 billion in the first quarter, unchanged from the previous quarter.\nWells Fargo (WFC) CEO Charles Scharf echoed Dimon’s sentiment, telling analysts last week that the bank supports the administration’s deregulatory push. Scharf said the proposed changes would allow \"more loans, take more deposits, and provide more liquidity to the markets while preserving robust regulatory oversight.\"\nWells Fargo’s mortgage volume fell to $4.4 billion in the first quarter ending March 31, down from $5.9 billion the previous quarter, further underscoring the broader slowdown in housing financing activity.\nData from the National Association of Realtors showed pending home sales, a forward looking indicator of home sales based on contract signings, grew 2% in February. However, pending transactions are down 3.6% year over year, underscoring the ongoing challenges in the housing market.\nThe average rate on a 30-year fixed mortgage stood at 6.92% as of last week, not far from the highest levels seen over the last several years.\nRead more: Best low- and no-down-payment mortgage lenders of 2025\nThe banking industry has long been lobbying for a scaled-back version of the “Basel Endgame” capital rule, which requires financial institutions to hold significantly more capital as part of a broader post-2008 effort to strengthen the financial system.\nBanks argue that higher capital requirements restrict their ability to offer mortgages, car loans, credit cards, and small business loans.\nPresident Trump's Treasury Secretary, Scott Bessent, in a speech last week before the American Bankers Association, called for \"modernizing\" capital requirements but said the latest proposal \"is not, in my opinion, the right starting point for our modernization effort.\"\nBessent added, \"Modernizing regulatory capital likely would mean reduced capital requirements for mortgage loans and some other exposures that are core to the community bank model.\"\nMeanwhile, Trump officials are also revisiting efforts to privatize Fannie and Freddie, a major policy goal that first Trump administration couldn't pull off. Bessent said the decision to release the two companies will come down to the trajectory of mortgage rates.\nIn his annual letter, JPMorgan's Dimon cited data from the Urban Institute estimating that mortgage market reforms could boost mortgage originations by 1 million annually, particularly helping lower-income borrowers and first-time homebuyers targeting homes in the $150,000-$300,000 range.\nRead more: 2025 housing market: Is it a good time to buy a house?\nAccording to Zillow, the average US home value sits at $361,263, up 2.1% over the past year.\n“Buying a home, still a pillar of the American Dream, is simply the best way for individuals to start building household wealth,” Dimon wrote.\nDani Romero is a reporter for Yahoo Finance. Follow her on X @daniromerotv.\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finance\nUK homeowners may soon see some relief on their mortgage bills. Although average rates on fixed mortgage deals remain above 5%, growing expectations of interest rate cuts by the Bank of England could push borrowing costs lower — possibly as low as ...\nWith a better price performance and attractive valuation metrics, IBM is relatively better placed than MSFT at the moment.\nRussia’s rouble has become the world’s best-performing global currency as Donald Trump’s tariff war upends financial markets.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nIt can be a smart strategy, provided you understand what you’re risking.\nHere’s how inheriting an annuity works and what to do with it.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 12-16_Treasury Secretary Scott Bessent to America's biggest CEOs_ Stop worrying",
    "date": "",
    "content": "Title: Treasury Secretary Scott Bessent to America's biggest CEOs_ Stop worrying\nDate: 2025-04-16 12:16\nURL: https://finance.yahoo.com/news/treasury-secretary-scott-bessent-to-americas-biggest-ceos-stop-worrying-121627070.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUS Treasury Scott Bessent has a message to powerful public company CEOs: Stop worrying about tariffs, and get back to business.\n\"We're going to have a lot more clarity on the way forward [on tariffs] over the next 90 days,\" Bessent told Yahoo Finance in an interview on Tuesday (video above).\nBessent was responding to a question about CEOs voicing concerns about the Trump administration's trade policy. Some top leaders have expressed to me that the tariffs are putting their businesses into a state of chaos.\nBessent added, \"They'll [CEOs] also have clarity on tax and on deregulation. I remember in 2017 I heard a lot of the same things because the tax deal wasn't done until right before Christmas in 2017. And it was the same thing. We can't plan. We can't do this. We need clarity. So, you know, we're going to have clarity on tax. We're going to have clarity on deregulation.\"\nRead more: What Trump's tariffs mean for the economy and your wallet\nCorporate America has sounded the alarm on the state of the economy amid the tariff turmoil.\nJPMorgan (JPM) CEO Jamie Dimon said in a recent TV interview that a recession is likely. Goldman Sachs (GS) CEO David Solomon told analysts on his earnings call on Monday that the prospect of a recession has increased.\nBessent's hedge fund mentor Stanley Druckenmiller has weighed in on X that he doesn't support tariffs above 10%.\n\"Well, the consumer is concerned about a number of things ... the pricing and costs of things, inflation,\" Constellation Brands (STZ) CEO Bill Newlands told me on Yahoo Finance's Catalysts. \"They're concerned about immigration, particularly consumers that have had friends or family who have been involved with issues around immigration. How that's translating is that people are spending less. They're out less in restaurants. They're spending less on consumer goods and consumables.\"\nThe Corona and Modelo beer maker has seen beer sales go flat amid the economic uncertainty.\nBessent said about the recession concerns from Dimon and Solomon: \"Look, that's their job is to be concerned. But again, I think that there is all this chatter on tariffs and what we're worried about. And, you know, I come from Wall Street, I think Wall Street can continue to do great, but we are focused on Main Street.\"\nThe concerns from CEOs have been well placed.\nOn April 9, the Trump administration announced a 90-day pause on all reciprocal tariffs, with the exception being China. The tariffs on China, one of the US's most important trading partners, now stand at 145%.\nA 10% across-the-board tax is still being applied to all imports to the US.\nThe administration further refined its tariff plans on April 11.\nThe White House issued a rule that spared smartphones, computers, semiconductors, and other electronics from reciprocal tariffs — especially the harsher ones on Chinese goods. The US Customs and Border Patrol said that the goods would be excluded from Trump's 10% global tariff on most countries and the much more significant 145% tariffs on Chinese imports.\nBessent suggested a trade deal with China remains in the distance.\nTrump quickly downplayed that he was reversing course on tariffs, noting electronics would still get hit.\n\"There was no Tariff ‘exception’,\" Trump said in a social media post on Sunday. \"These products are subject to the existing 20% Fentanyl Tariffs, and they are just moving to a different Tariff 'bucket.'\"\nThe administration is working on a semiconductor tariff, according to Commerce Secretary Howard Lutnick.\nThe S&P 500 (^GSPC) has recovered to a decline of 4.67% beneath its level at the April 2 tariff announcement, but a decline is still a decline. The index is off by 12% from its mid-February peak.\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on X @BrianSozzi, Instagram, and LinkedIn. Tips on stories? Email brian.sozzi@yahoofinance.com.\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\nRead the latest financial and business news from Yahoo Finance\nTreasury Secretary Scott Bessent sat down exclusively with Yahoo Finance as  economic uncertainty from Trump administration's tariffs continues to weigh on investors.\n(Reuters) -Californians further soured on Tesla in the first quarter, pulling down the electric-vehicle maker's registrations by 15% as backlash against Elon Musk's company intensified in the state that has embraced EVs most across the United States.  There have been relentless protests in many cities in California - echoing the backlash in other countries - against Musk's involvement in U.S. President Donald Trump's administration and his embrace of far-right politics in Europe, a key factor behind Tesla's 13% drop in first-quarter deliveries globally.\nMiddle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]\nLuxury electric vehicle (EV) maker Lucid Group (NASDAQ: LCID) launched its fully electric Gravity SUV to the public last year and began accepting registrations from interested customers.  A company executive also announced that plans to launch a new, midsize SUV next year are on track.  Maybe more important for Lucid investors are plans to launch a new, lower-priced, midsize SUV next year.\nFord Motor may raise prices on its new vehicles if U.S. President Donald Trump's auto tariffs continue, according to a memo sent to dealers on Wednesday that was reviewed by Reuters.  The Dearborn, Michigan, automaker offered deep discounts across its lineup starting earlier this month through June 2.  The program will continue, but pricing on new models produced in May and beyond may change, the memo said.\nStruggling to make your monthly credit card payment? Your issuer can help you find a payment plan that gets you out of credit card debt faster. Here’s how.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nMortgage applications for refinancing and purchases dropped last week after rates rose 20 basis points, reflecting market turbulence from President Trump's tariffs.\nHere's why your water bill is going up.\nTrump wants to bring tech manufacturing to the US. There's little chance it will happen.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-29_Big Banks Step Up Stock Buybacks. Goldman and BofA Stand Out.",
    "date": "",
    "content": "Title: Big Banks Step Up Stock Buybacks. Goldman and BofA Stand Out.\nDate: 2025-04-16 13:29\nURL: https://finance.yahoo.com/m/b16d9f33-f55b-3a45-9218-ea45e2e1faeb/big-banks-step-up-stock.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nCanadian bank RBC cut its price target on Bank of America (BAC) stock to $45 from $50 but maintains a positive view of the shares. BAC reported its first-quarter financial results yesterday. Why RBC Cut Its Price Target on BAC But Remains Bullish RBC lowered its price target on BAC to $45 from $50 due […]\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, […]\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nSays “largely complete” on goals of Simplification: Focus on five core interconnected businesses; exit 14 international consumer markets; simplify the organization and management structure; and Culture and Talent: build a winning culture; invest in talent; deliver One Citi (C). Says main priorities for 2025 and 2026 are goals of Transformation: #1 priority; relentless execution; regulatory remediation; modernize infrastructure; data enhancements; and Enhance Business Performance: Maximize unique\nDespite uncertainty employment remains healthy, and consumers have proven resilient, BofA finds.\nBAC's Q1 earnings gain from solid equity trading income, higher NII and decent advisory and debt underwriting performance amid higher provisions and expenses.\nCiti's wealth division saw a nearly five-fold increase in new investment assets in the first quarter. CEO Jane Fraser said the firm has \"real horsepower and firepower in our investment capabilities.\"\nSees non-interest income ex-markets up 2%-3% year-over-year. Sees expenses slightly below $53.4B. Sees Cards NCL rates around the top of the 2024 ranges for both businesses, with higher losses in 1H, consistent with seasonal patterns, subject to changing conditions. Says ACL build will be a function of macroeconomic environment and business volumes. Says repurchased $1.75B of common shares in 1Q25; targeting a similar level of share repurchases in 2Q25. Says remains committed to continuing to im\nThe parent company of U.S. Bank posted a profit of $1.71 billion, or $1.03 a share, above analysts expectations of 98 cents a share.\nNews of the day for April 15, 2025\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-44_Nvidia, Apple, Big Banks' trading revenues_ Trending Tickers",
    "date": "",
    "content": "Title: Nvidia, Apple, Big Banks' trading revenues_ Trending Tickers\nDate: 2025-04-16 14:44\nURL: https://finance.yahoo.com/video/nvidia-apple-big-banks-trading-144403821.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMadison Mills and Interactive Brokers chief strategist Steve Sosnick examine some of today's trending tickers.\nNvidia (NVDA) stock is falling after the company warned that new US chip rules on exports to China would cost the company $5.5 billion. Analysts at Bank of America, Piper Sandler, and Raymond James lowered their price targets for the chipmaker stock.\nApple's (AAPL) India suppliers shipped $2 billion worth of iPhones in March ahead of US President Trump's tariffs.\nWall Street's top financial firms, like JPMorgan Chase (JPM), Goldman Sachs (GS), and Morgan Stanley (MS), saw record-high trading revenue in the first quarter, driven by tariff-fueled market volatility.\nTo watch more expert insights and analysis on the latest market action, check out more Catalysts here.\nIt's now time for some of today's trending tickers. We are watching Nvidia, Apple, and Wall Street banks. First up, several Wall Street firms cutting their price targets on Nvidia stock after the chip maker disclosed that it anticipates a $5.5 billion charge from new chip curbs. The US government told Nvidia earlier this month it would need a special license to export certain chips to China. Analysts at BFA Global Research, Piper Sandler, and Raymond James all lowering their price targets on the news. And also, Steve, what I also thought was really interesting here is an analyst over at City talking about how it's not just about Nvidia. This could also impact Broadcom. This could also impact other chip names in the space.\nWell, you're seeing them, you're seeing them sell off today. I mean, you know, AMD announced an $800 million charge along in there. Um, you know, Broadcom was trading lower this morning as well. ASML was trading lower, although they released earnings, but, but they're all, they're all part and parcel of this. This is not good news for the chip sector, because, you know, I, I don't mean to just sound like a broken record, but this is uncertainty, and uncertainty, the markets don't love uncertainty.\nWell, speaking, speaking of uncertainty, let's get to another name we're looking at. Apple's main suppliers in India shipping roughly $2 billion worth of iPhones in March ahead of President Trump's reciprocal tariffs announcement. That is according to new customs data. Smartphones have since secured a temporary reprieve from tariffs, but persistent tensions between the US and China threaten the iPhone maker's China-focused supply chain in the longer term. The Wall Street Journal reporting Apple is investigating moving some iPhone production to the US, but the process could take years, and CEO Tim Cook has said in the past that it would be difficult to find the skilled labor in America that's needed to build the smartphones. Treasury Secretary Scott Beson dismissed that comment and concern in an interview with Yahoo Finance.\nYou don't need a PhD in mechanical engineering to assemble an iPhone. So, I, I'm not sure why Tim Cook says that the skills aren't here.\nAnd Steve, I think what analysts who cover Apple might say and investors might say is that that skilled labor does take years to build up, and it's certainly something that allows Apple to turn out these iPhones incredibly quickly.\nWell, that's it. I mean, every, you know, labor now is not just, you know, pounding a hammer or nail. There, there's, there's, there's intricacies in the supply chain. You know, I, I know that, you know, the commerce secretary with his comment, you know, we're going to have lots of people screwing tiny little screws into things. That's not what people really want. You know, we want the high-tech value-added manufacturing because, quite frankly, our cost basis is higher. So, if there's value-added stuff to be done, that's great. If it's just, if it's just bringing low-skilled labor, bringing back low-skilled jobs, that's not necessarily, you know, I understand the need for that, particularly maybe in some strategic industries, but overall, I think we want people bringing a skill set to it. You know, I saw a statistic, this was posted on, on, on Twitter by my friend Frank Luntz who I trust. Um, and he got the statistics from the Cato Institute. 80% of the people when asked, said, do you want more manufacturing in the US? 80% said yes. When asked, would you take a factory job? 75% said no. 23% said yes. The other two said I already have a factory job. So, it, it's, you know, it's one of these, it's nice in theory, but in practice, um, you know, you need skilled, the people who are going to take these jobs, by definition, are really going to be skilled labor. Not, not just, you know, people, not just, you know, automatons screwing in screws.\nYeah. Right. The price that they're requiring for their labor requires it to be skilled. All right. Finally, trading desks at some of the biggest names in banking crashed in, cashed in, rather, on market volatility in the most recent quarter. And that is not including the past two weeks, which fell outside of that reporting period. Morgan Stanley, JPMorgan, Goldman, all seeing record equity trading revenue during the quarter. Despite the blockbuster results, executives did express some caution about the current macro backdrop. JPMorgan's Jamie Dimon warning of considerable turbulence roiling the US economy. Well, Goldman's David Solomon said the prospects of a recession had increased. You couldn't pay Solomon to mention the word tariffs, but he did semi-maybe allude to it in that comment. Is this trading revenue for banks a signal of strength in your view, Steve? Or is this something that can kind of hide any economic macro concerns?\nKind of the latter. You know, I remember I spent the bulk of my career as an option trader, and I used, I loved environments like this. Um, you know, and to Jamie Dimon's comment, you know, about turbulence, you know, I always described VIX as sort of the price of a parachute when the plane hits turbulence at some level. You know, people want that protection. But here's what happens during volatility with, if you're an active trader. You widen your spreads, you shrink your sizes. So, effectively that really impairs liquidity, but if you're the person trading off those bid offs, bid-ask spreads, each trade you do is more profitable. And so, yes, that leads to the trading desks making more money, but really, you know, analysts typically discount that over time. It's actually a little odd this quarter that the analysts are very happy that the banks are making all this money trading because for years, again, as a trader at a publicly traded firm, the analysts were always very dismissive when we had a good quarter.\nYeah. Right, right, because it's potentially not a sign of continued gains for, for the banks. Steve, thank you so much for sticking with us. For our audience, you can scan the QR code below to track the best and worst performing stocks with Yahoo Finance.\nExactly. My pleasure.\nThe tech market took it on the chin on Wednesday as the trade war picked up steam and the Federal Reserve sounds like it's not going to bail out the market.  Big tech in both the U.S. and China were hit hard today.  Broadcom (NASDAQ: AVGO) fell as much as 6.7%, Alibaba Group (NYSE: BABA) dropped 5.6%, and JD.com (NASDAQ: JD) fell 6.4%.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 17-32_JPMorgan is going after even more customers who allegedly cashed in on the ‘infinite money glitch’ s",
    "date": "",
    "content": "Title: JPMorgan is going after even more customers who allegedly cashed in on the ‘infinite money glitch’ s\nDate: 2025-04-16 17:32\nURL: https://finance.yahoo.com/news/jpmorgan-going-even-more-customers-173217323.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJPMorgan Chase is continuing to pursue legal action against customers who allegedly took advantage of an “infinite money glitch” as a result of ATM technical malfunctions last year. The bank has filed five new lawsuits on the state level after winning four federal suits filed last October. Chase recouped about $580,000 of the $660,000 it sought out in the original batch of litigation.\nJPMorgan Chase is continuing efforts to recover hundreds of thousands of dollars lost after an ATM “glitch” went viral, leading customers to steal funds from the bank during the malfunction.\nJPMorgan is pursuing legal action on the state level, suing customers who allegedly stole $75,000 or less from the company, CNBC first reported. Last October, the bank filed four federal lawsuits, and, as of Monday, has won them all, recouping about $580,000 of the $660,000 it sought out, with dollar amounts not finalized for all cases.\nLast August, social-media users uploaded videos explaining a “glitch” stemming from ATM malfunctions, which would allow Chase bank customers to write a fake check, deposit it into an ATM, and withdraw cash over the course of a week when some of the deposited funds become immediately available, but before the check bounces. The practice, known as check-kiting, is illegal.\nAccording to a Tuesday court filing in Gwinnett County, Georgia, seen by CNBC, one “masked man” deposited a $73,000 check in the defendant’s Chase bank account. Per the lawsuit, the check bounced six days later, but not before the defendant made a series of cash withdrawals worth $82,000. The defendant allegedly owes Chase nearly $58,000 and has not complied with requests to return the cash.\nJPMorgan has filed five total lawsuits on the state level: one each in New York, Florida, Georgia, and two in Texas, the company confirmed to Fortune. Since October, when JPMorgan first pursued litigation on the issue, the company has sent out more than 1,000 letters to customers asking them to repay the funds.\n“We’re still investigating cases of fraud and cooperating with law enforcement—and we’ll do that for as long as it takes to hold fraudsters accountable,” JPMorgan Chase spokesperson Drew Pusateri told Fortune in a statement.\nChase’s ATM woes aren’t unique. In August 2023, Bank of Ireland customers took advantage of an ATM glitch that allowed them to pull large sums of money from their accounts and transfer up to €1,000 (~$1,090) to other accounts, even if the funds were more than what was available in their accounts, leading them to mistakenly think they were getting “free money.”\nThe bank warned customers they would be liable for the money they withdrew and should return the cash, should they not be prepared to have the money debited from their accounts.\nJPMorgan has been clear in its views on schemes such as the one some took advantage of last year.\n“Chase takes its responsibility to combat fraud seriously and prioritizes protecting the firm and its customers to make the banking system safer,” the bank said in an October court filing. “Part of that responsibility is to hold people accountable when they commit fraud against Chase and its customers. Simply put, engaging in bank fraud is a crime.”\nWhile legal consequences for check fraud vary by state and the amount of money taken, repercussions can be steep. In New York, it can result in up to 25 years in prison, Adam H. Rosenblum, an attorney and founder of Rosenblum Law, told Fortune in September. Individuals can avoid steep punishment if they took out smaller sums of money, and if they return the funds and work with an attorney.\n“Very often, these consequences can be mitigated and minimized if things are handled in the right way,” he said.\nThis story was originally featured on Fortune.com\nCEOs have warned on the economy because of Trump administration tariff policies. US Treasury Secretary Scott Bessent has a message for them all.\nJP Morgan took the leading position in terms of deal value by advising on transactions totalling $127.3bn.\nThe infrastructure provider underpins tokenized funds by BlackRock, Franklin Templeton and Republic facilitating stablecoin settlements across 22 blockchains.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\n- TOPC is the first S&P 500 ETF with 3% company weight cap, addressing market concentration. - The ETF aims to provide balanced exposure to the largest US companies. - It joins the iShares Build ETF toolkit with $18 billion in managed assets.\nFacilitating and financing trades is proving to be a winning proposition for big banks in a chaotic market.\nThe youngest population of workers want more control over their career trajectory.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-00_Treasuries Rally as Fed’s Powell Focuses on Price Stability",
    "date": "",
    "content": "Title: Treasuries Rally as Fed’s Powell Focuses on Price Stability\nDate: 2025-04-16 20:00\nURL: https://finance.yahoo.com/news/treasuries-rally-fed-powell-focuses-200030165.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nThe five-year note led gains in the US government debt market on Wednesday, with yields down seven basis points to 3.9% as Powell said the central bank was “well positioned to wait for more clarity” on how President Donald Trump’s evolving trade policy impacts price pressures. The moves in yields accelerated as equities slumped more than 2%.\nThe “bond market is comforted by Powell’s sanguine outlook on funding conditions and reserve abundance, but the equity market is getting anxious as investors are looking for the Powell put — which is not there yet,” said Tracy Chen, a portfolio manager at Brandywine Global Investment Management. “There is no sense of urgency to act from Powell. He is in a wait-and-see mode given all the uncertainty in tariff standoff.”\nThe rally in bonds also followed a solid $13 billion sale of 20-year bonds, which was awarded at 4.81% compared with a 4.814% when-issued yield at the 1 p.m. New York time bidding deadline.\nEarlier, data showed US retail sales rose substantially in March on a jump in car purchases and other goods such as electronics, suggesting consumers were scrambling to get ahead of tariffs.\nIn sharp contrast with the state of market a week ago, when Trump’s about-face on tariffs shook investors, futures volumes on Wednesday were well below recent levels. By about 3 p.m. New York time, Treasury contracts were running at about 60% of 20-day average, with SOFR futures at a similar level.\nTo Gregory Faranello, head of US rates trading and strategy for AmeriVet Securities, the Treasury market is now trading more cleanly than it was earlier in the month as the risk of global tariffs raised threats to the economy, undermining Treasuries’ reputation as the world’s safest asset.\n“Positions feel better balanced, so back to a risk-off” market, he said. Faranello favors five-year notes “if the Fed is going to be reactionary versus preemptive.”\nPowell’s Message\nPowell’s comments, delivered at the Economic Club of Chicago, were in sharp focus across Wall Street after a bout of volatility in the $29 trillion Treasury market.\nThe Fed chief acknowledged that tension was building between the central bank’s dual mandates of ensuring US growth while keeping inflation checked.\nStill, he echoed Cleveland Fed President Beth Hammack, who’d pointed out that there’s good reason for officials to hold interest rates at current levels until there is more clarity on how tariffs and other policy changes will impact the economy.\nTraders were pricing in about 90 basis points of easing by the end of the year, implying a minimum of three quarter-point reductions starting in July. At JPMorgan Chase & Co., economist Michael Feroli said that Powell’s comments were consistent with the bank’s view that the first cut of the year will actually come in September.\nPowell said that despite recent volatility, the market was functioning, so there wasn’t a need for the Fed to step in now. The remark jolted US equity markets, and helped fuel a further advance in bonds.\nThe dollar, meanwhile, held tight to its losses — bringing its year-to-date decline to 6.4%, according to a Bloomberg gauge.\nHe also said the Fed’s recent decision to slow the pace of its balance-sheet runoff — known as quantitative tightening — and the fact that reserves remain abundant mean the central bank can continue QT longer.\n--With assistance from James Hirai.\n(Updates prices, adds comments throughout.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nApple stock fell more than 2% late Wednesday morning, once again putting its market capitalization below the $3 trillion mark after a brief rally.\nFederal Reserve Chairman Jerome Powell said in prepared remarks in Chicago that the central bank would wait for more data before changing interest rates.\nMarch retail sales jumped as consumers rushed to buy autos and Apple iPhones before the impact of Trump tariffs. The S&P 500 fell.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\nTrump's Treasury secretary wants business owners to relax. That's hard to do when Trump's tariffs are pushing costs higher and profits lower and threatening a recession.\nReady to start planning for retirement? Here’s what you should know.\n(Reuters) -The ripple effects of Donald Trump's global trade war are increasingly being felt across numerous industries all at once and on Wednesday were once again exerting pressure on U.S. stock markets that have been roiled for weeks by his erratic trade policies.  Stocks fell broadly, with tech stocks hit particularly hard after bellwethers like Nvidia that are highly tied into the world's supply chain warned of hits to their bottom line.  Meanwhile, airlines said they are bracing for an uncertain summer travel season, and the head of the Federal Reserve noted slowing economic activity - but also cast a wary eye on the threat that tariffs pose to its goal of lowering inflation.\nTech stocks are leading Wall Street lower as new export restriction take the U.S-China trade war to a new and damaging level.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]