[
  {
    "title": "2025-04-14 17-31_Top 3 Dividend Stocks To Consider For Your Portfolio",
    "date": "",
    "content": "Title: Top 3 Dividend Stocks To Consider For Your Portfolio\nDate: 2025-04-14 17:31\nURL: https://finance.yahoo.com/news/top-3-dividend-stocks-consider-173143573.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAmid recent market volatility driven by tariff news and fluctuating tech stock performances, investors are keenly observing how these developments impact broader economic growth. In such an environment, dividend stocks can offer a measure of stability and income potential, making them a compelling consideration for those looking to navigate uncertain times.\nName\nDividend Yield\nDividend Rating\nColumbia Banking System (NasdaqGS:COLB)\n6.91%\n★★★★★★\nInterpublic Group of Companies (NYSE:IPG)\n5.37%\n★★★★★★\nDouglas Dynamics (NYSE:PLOW)\n5.24%\n★★★★★★\nFirst Interstate BancSystem (NasdaqGS:FIBK)\n7.73%\n★★★★★★\nOceanFirst Financial (NasdaqGS:OCFC)\n5.42%\n★★★★★★\nRegions Financial (NYSE:RF)\n7.51%\n★★★★★★\nPeoples Bancorp (NasdaqGS:PEBO)\n5.96%\n★★★★★★\nSouthside Bancshares (NYSE:SBSI)\n5.43%\n★★★★★★\nDillard's (NYSE:DDS)\n8.36%\n★★★★★★\nCitizens & Northern (NasdaqCM:CZNC)\n6.11%\n★★★★★★\nClick here to see the full list of 176 stocks from our Top US Dividend Stocks screener.\nWe're going to check out a few of the best picks from our screener tool.\nSimply Wall St Dividend Rating: ★★★★★☆\nOverview: Bunge Global SA is an agribusiness and food company with operations worldwide, and it has a market cap of approximately $10.22 billion.\nOperations: Bunge Global SA generates revenue through its key segments: Agribusiness ($45.90 billion), Refined and Specialty Oils ($13.02 billion), Milling ($1.64 billion), and Sugar & Bioenergy ($130 million).\nDividend Yield: 3.6%\nBunge Global's dividend payments have been consistently stable and growing over the past decade, with a current yield of 3.56%. The company recently proposed a US$2.80 per share cash dividend in four installments, highlighting its commitment to returning value to shareholders. Despite lower profit margins and sales compared to last year, dividends remain well-covered by earnings (payout ratio: 33.6%) and cash flows (cash payout ratio: 69.5%). Bunge also completed significant share buybacks totaling US$1.90 billion since October 2021, enhancing shareholder value further.\nClick to explore a detailed breakdown of our findings in Bunge Global's dividend report.\nOur expertly prepared valuation report Bunge Global implies its share price may be lower than expected.\nSimply Wall St Dividend Rating: ★★★★★☆\nOverview: Eastman Chemical Company is a specialty materials company operating in the United States, China, and internationally with a market cap of approximately $9.04 billion.\nOperations: Eastman Chemical Company's revenue is primarily derived from its Advanced Materials segment at $3.05 billion, followed by Additives & Functional Products at $2.86 billion, Chemical Intermediates at $2.13 billion, and Fibers at $1.32 billion.\nDividend Yield: 4.2%\nEastman Chemical's dividend payments have been stable and growing over the past decade, with a recent quarterly dividend of US$0.83 per share. The dividends are well-covered by earnings (payout ratio: 42%) and cash flows (cash payout ratio: 55.7%). Despite a high level of debt, the company trades at good value relative to peers, with shares priced 35.9% below fair value estimates. Recent share buybacks totaling US$3.06 billion further underscore a commitment to shareholder returns.\nDelve into the full analysis dividend report here for a deeper understanding of Eastman Chemical.\nIn light of our recent valuation report, it seems possible that Eastman Chemical is trading behind its estimated value.\nSimply Wall St Dividend Rating: ★★★★☆☆\nOverview: Halliburton Company provides products and services to the energy industry worldwide, with a market cap of approximately $18.29 billion.\nOperations: Halliburton's revenue is primarily derived from its Drilling and Evaluation segment, which generated $9.69 billion, and its Completion and Production segment, which brought in $13.25 billion.\nDividend Yield: 3.2%\nHalliburton's dividend yield of 3.23% is below the top quartile of US dividend payers, but its low payout ratios (24% earnings, 24.4% cash flow) indicate strong coverage. Despite a volatile dividend history, recent affirmations and strategic advancements—like the Petrobras contract and innovative drilling solutions—highlight operational growth potential. The stock trades at a significant discount to fair value estimates, suggesting attractive relative valuation despite high debt levels and past revenue declines.\nGet an in-depth perspective on Halliburton's performance by reading our dividend report here.\nThe valuation report we've compiled suggests that Halliburton's current price could be quite moderate.\nClick here to access our complete index of 176 Top US Dividend Stocks.\nHave a stake in these businesses? Integrate your holdings into Simply Wall St's portfolio for notifications and detailed stock reports.\nJoin a community of smart investors by using Simply Wall St. It's free and delivers expert-level analysis on worldwide markets.\nExplore high-performing small cap companies that haven't yet garnered significant analyst attention.\nFuel your portfolio with companies showing strong growth potential, backed by optimistic outlooks both from analysts and management.\nFind companies with promising cash flow potential yet trading below their fair value.\n This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include NYSE:BG NYSE:EMN and NYSE:HAL.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\nEconomic forecasters are raising the odds that we could experience a recession in the coming quarters.  Goldman Sachs has hiked its recession probability a few times in recent weeks, bumping it from 20% all the way to 45%.  Its recession model sees a nearly 80% chance the economy goes into a recession, up from 60% not long ago.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nChubb (CB) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBeyond analysts' top -and-bottom-line estimates for East West Bancorp (EWBC), evaluate projections for some of its key metrics to gain a better insight into how the business might have performed for the quarter ended March 2025.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nCVB Financial (CVBF) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where 3M Company (NYSE:MMM) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the end of […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 18-00_Exclusive_ Halliburton's E-Fleets Lower Haynesville Completions Costs",
    "date": "",
    "content": "Title: Exclusive_ Halliburton's E-Fleets Lower Haynesville Completions Costs\nDate: 2025-04-14 18:00\nURL: https://finance.yahoo.com/news/exclusive-halliburtons-e-fleets-lower-180000207.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAll right, welcome. I'm Richard Stubbe, Hart Energy’s senior technology editor. I'm here with Neil Modeland, who is the senior business technology development manager for Halliburton. We've been talking about the Haynesville Shale and some of the things that Halliburton brings to it and some of the difficulties that the shale brings here. So Neil, do you want to talk a little bit about what Halliburton is doing in the shale and why it's difficult here?\nNeil Modeland, senior business technology development manager, Halliburton: Yeah, I think if you look at the Haynesville in general, we've talked about earlier going to longer laterals and more profit intensity than really any other play in North American land. Take a step back and look at what we're doing at Halliburton. We're really trying to minimize some of the costs associated with doing those huge completions in the Haynesville. So what can we do as a frac service provider to pull out some of those costs? One of those things is electrification. So we've got our ZEUS e-fleet [electric fleet] portfolio, and 40% of our fleets in North America are actually running e-fleets.\nRS: And you said that's going up.\nNM: Yes, and in 2025 we actually expect that to end the year with 50% on that. And really all of our dedicated fleets in the Haynesville currently are e-fleets. That's really helped on driving out some of the costs on a couple of different fronts.\nOne [is] just replacing diesel with natural gas, right? You have got a lower cost commodity, and in the Haynesville we have field gas that we can actually burn to create the power generation to power the e-fleets. And that's going to be your total lowest total cost of ownership of any power generation is just burning the field gas. So we have that plentiful in the Haynesville, so that's going to lower the cost. But also the maintenance schedule and just the simplicity of the maintenance is better with our ZEUS fleet. In fact, last month our ZEUS fleets or electric fleets pumped 11% more horsepower hours on average than any of our diesel fleets. That comes because of more simplistic maintenance and just more uptime pumping these jobs and being able to do that better.\nRS: More uptime and less maintenance, that sounds like something I would also want for my car or something like that. But Halliburton is also doing a lot of work with automation, right?\nNM: Yeah. And really the e-fleets have been a good platform for that. Just the simplicity of control and then the full fleet control through our OCTIV platform has allowed us to step into automation. So last year we commercialized Auto Frac, which is really kind of push-button frac. We upload a typical frac schedule an operator would give us. We then sit down with the operator and talk through ‘what parameters, what target pressure would you like, max rate, target rate, how would you like to ramp up the stage, how would you like to bring down the stage?’ Then once all that's loaded in, it's kind of press button and here you go. So there's your automated frac. If you're riding top pressure, as your pressure breaks down, your rate will increase. That's very common in the Haynesville that we'll see that. We actually commercialized the Auto Frac in the Haynesville last year as well. To put it in perspective, the time savings we're seeing through that automation versus a manual operator, we're seeing about 10 minutes on average. In fact, the Bossier Shale versus the Haynesville Shale is a little more finicky. We actually see a closer to 15 minutes saved per stage pumping time versus a manual operator versus what we're doing with automation.\nRS: And we talked about 15 minutes, but it's 15 minutes plus 15 minutes plus times, times, times.\nNM: Yeah. 15 minutes times a hundred stages of, well, a two well pad and then several pads throughout the year, all of a sudden you have enough time to actually have that frac fleet go pump another well or two right by the end of the year.\nRS: Well fantastic. Thank you for being here and talking with us, and I really appreciate you just being part of the program.\nNM: My pleasure. Thanks for having.\nRS: Thank you.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nEQT (EQT) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where 3M Company (NYSE:MMM) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the end of […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 12-30_Halliburton and Nabors Bring Drilling Automation to the Forefront in the Middle East",
    "date": "",
    "content": "Title: Halliburton and Nabors Bring Drilling Automation to the Forefront in the Middle East\nDate: 2025-04-15 12:30\nURL: https://finance.yahoo.com/news/halliburton-nabors-bring-drilling-automation-123000539.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe closed-loop drilling execution earned both companies the 2025 Digital Enabler of the Year Award and represents a step forward in automation in the region.\nHOUSTON, April 15, 2025--(BUSINESS WIRE)--Halliburton (NYSE: HAL) and Nabors Industries (NYSE: NBR) achieved the first fully automated surface and subsurface execution of rotary and slide drilling operations in Oman. The integration of the companies’ digital solutions delivered land-based, closed-loop drilling solutions to improve operational efficiency, consistency, and real-time decision-making capabilities.\nHalliburton’s LOGIX™ automation and remote operations solutions, and Nabors SmartROS® rig operating system enabled seamless orchestration of drilling parameters, real-time data analytics, integrated experience management, and remote control of operations.\n\"We delivered operational efficiency, consistency, and reliability,\" said Steve Haden, senior vice president, Project Management, Halliburton. \"The wells were delivered ahead of plan with a higher average rate of penetration and lower non-productive time. This milestone demonstrates our leadership in drilling automation.\"\n\"The success we are seeing in Oman is a testament to the power of collaboration as we work together to drive automation across the industry to improve safety and efficiency. This is just the beginning, and we are excited to continue to push the boundaries of innovation to achieve autonomous drilling,\" said Subodh Saxena, senior vice president, Canrig and Nabors Drilling Solutions.\nThis collaboration between Halliburton and Nabors in the Middle East led to drilling performance optimization and reduction of well construction time.\nAbout Halliburton\nHalliburton is one of the world’s leading providers of products and services to the energy industry. Founded in 1919, we create innovative technologies, products, and services that help our customers maximize their value throughout the life cycle of an asset and advance a sustainable energy future. Visit us at halliburton.com; connect with us on LinkedIn, YouTube, Instagram, and Facebook.\nAbout Nabors\nNabors Industries (NYSE: NBR) is a leading provider of advanced technology for the energy industry. With presence in more than 20 countries, Nabors has established a global network of people, technology and equipment to deploy solutions that deliver safe, efficient and responsible energy production. By leveraging its core competencies, particularly in drilling, engineering, automation, data science and manufacturing, Nabors aims to innovate the future of energy and enable the transition to a lower-carbon world. Learn more about Nabors and its energy technology leadership Nabors.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20250415352719/en/\nContacts\nFor Investors: David Colemaninvestors@halliburton.com 281-871-2688\nFor Media Relations: Milka Horstpr@halliburton.com 281-318-9676\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nHere are our top picks for the best online brokers for bonds.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 13-20_Sector Update_ Energy Stocks Decline Premarket Tuesday",
    "date": "",
    "content": "Title: Sector Update_ Energy Stocks Decline Premarket Tuesday\nDate: 2025-04-15 13:20\nURL: https://finance.yahoo.com/news/sector-energy-stocks-decline-premarket-132049312.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nEnergy stocks declined premarket Tuesday with the Energy Select Sector SPDR Fund (XLE) down 0.2% rec\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nJohnson & Johnson (JNJ) lifted its full-year operational and reported sales outlook on Tuesday as th\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nGoldman Sachs secured the top position by deal value, by advising on transactions worth a total of $17.6bn.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nDespite recent stock market volatility, JPMorgan Chase (NYSE: JPM) shares are down just 1% year to date, outperforming the 9% decline in the S&P 500 (SNPINDEX: ^GSPC) at the time of writing.  The banking giant continues to benefit from its fortress-like balance sheet and global diversification, making it well-positioned to navigate any economic environment.  JPMorgan topped Wall Street estimates, with revenue climbing 8% year over year, while earnings per share (EPS) of $5.07 was up 14% from the prior-year quarter.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 14-00_Analysts Estimate Halliburton (HAL) to Report a Decline in Earnings_ What to Look Out for",
    "date": "",
    "content": "Title: Analysts Estimate Halliburton (HAL) to Report a Decline in Earnings_ What to Look Out for\nDate: 2025-04-15 14:00\nURL: https://finance.yahoo.com/news/analysts-estimate-halliburton-hal-report-140040526.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHalliburton (HAL) is expected to deliver a year-over-year decline in earnings on lower revenues when it reports results for the quarter ended March 2025. This widely-known consensus outlook gives a good sense of the company's earnings picture, but how the actual results compare to these estimates is a powerful factor that could impact its near-term stock price.\nThe earnings report, which is expected to be released on April 22, 2025, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.\nWhile the sustainability of the immediate price change and future earnings expectations will mostly depend on management's discussion of business conditions on the earnings call, it's worth handicapping the probability of a positive EPS surprise.\nThis provider of drilling services to oil and gas operators is expected to post quarterly earnings of $0.60 per share in its upcoming report, which represents a year-over-year change of -21.1%.\nRevenues are expected to be $5.26 billion, down 9.4% from the year-ago quarter.\nThe consensus EPS estimate for the quarter has been revised 0.7% lower over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\nInvestors should keep in mind that an aggregate change may not always reflect the direction of estimate revisions by each of the covering analysts.\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. Our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction) -- has this insight at its core.\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\nFor Halliburton, the Most Accurate Estimate is lower than the Zacks Consensus Estimate, suggesting that analysts have recently become bearish on the company's earnings prospects. This has resulted in an Earnings ESP of -0.03%.\nOn the other hand, the stock currently carries a Zacks Rank of #3.\nSo, this combination makes it difficult to conclusively predict that Halliburton will beat the consensus EPS estimate.\nAnalysts often consider to what extent a company has been able to match consensus estimates in the past while calculating their estimates for its future earnings. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\nFor the last reported quarter, it was expected that Halliburton would post earnings of $0.70 per share when it actually produced earnings of $0.70, delivering no surprise.\nOver the last four quarters, the company has beaten consensus EPS estimates just once.\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\nHalliburton doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nHalliburton Company (HAL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nBaker Hughes (BKR) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nAbbott, Taiwan Semiconductor, American Express, ManpowerGroup and D.R. Horton are included in this Analyst Blog.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-00_Trump energy boss’s company plunging 40% is a warning for US oil production",
    "date": "",
    "content": "Title: Trump energy boss’s company plunging 40% is a warning for US oil production\nDate: 2025-04-16 10:00\nURL: https://finance.yahoo.com/news/trump-energy-boss-company-plunging-100000589.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nEnergy Secretary Chris Wright says Donald Trump’s administration is giving the “green light” to more US oil production, but the signal from the fracking company he used to run is flashing bright red.\nLiberty Energy Inc. (LBRT), which Wright led until his appointment to Trump’s cabinet, has tumbled 43% this year, one of the most precipitous declines among US energy stocks. The value of Wright’s stake in Liberty has fallen by nearly half to about $30 million over that period.\nLiberty’s rout is a warning that all is not well in America’s shale patch, despite Trump’s pledge to achieve “energy dominance.” Oil field servicers often provide the first indication of an industry downturn because they’re the ones hired to drill and frack new wells. After the trade war and OPEC’s recent decision to hike production knee-capped crude prices, investors expect US shale producers to avoid pumping more barrels into an oversupplied market.\nA drop in spending on services means US oil production could stall, or even decline this year, for the first time since the pandemic. So far, servicers are getting the brunt of the impact from tariff fears: An index of the companies has slid 28% this year, compared with 7% for oil and gas producers.\n“It’s just going to be painful,” said Dan Pickering, chief investment officer at energy-focused financial services firm Pickering Energy Partners. “What comes next, and we’ve already heard whispers of this, it will be slowing down of drilling activity, releasing frack crews.”\nLiberty is due to kick off earnings season for oil field servicers on Wednesday after the market closes, with larger rivals Halliburton Co. (HAL), Baker Hughes Co. (BKR) and SLB (SLB) to follow next week.\nOil field service companies are largely dependent on producer spending on drilling and fracking new wells for their income, leaving them uniquely vulnerable to downturns. Producers like Diamondback Energy Inc. and Devon Energy Corp., by contrast, can continue to earn revenue from their existing wells. Plus, they have the option of hedging oil prices and renegotiating for lower-cost drilling contracts.\nEven before tariffs, servicers had been suffering from lower demand as shale producers become more efficient, which means fewer drilling days and workers to do the same job. Investors will find out soon if further cuts are coming as contracts inked before the trade war expire and producers respond to the slump in crude prices.\nWest Texas Intermediate crude oil, the US benchmark, closed at $61.33 on Tuesday, down 14% this year.\n“We would not be surprised to see US oil output decline” if low prices persist, Barclays Plc analysts led by Amarpreet Singh wrote in a note to clients on Friday.\nA representative for Liberty declined to comment, citing a mandated quiet period ahead of the company’s earnings release. Wright didn’t immediately respond to requests for comment. The energy secretary did, however, put a positive spin on the market in an interview with Bloomberg TV on April 11. Trump’s election gave a “green light” to increase production, with pledges to roll back regulation and expand oil lease sales and permitting, he said.\n“Now there is extra fear of world economic growth in the next few months among the tariffs dialogue,” he said. “The marketplace may be discounting the wrong answer here. We will see very positive economic growth in the next few years.”\nInvestors and analysts aren’t convinced. US revenue for the five biggest frack providers is expected to drop by almost $1 billion this year, a 5% decline and the second consecutive annual drop, according to data compiled by Bloomberg. Last week, producers idled oil rigs in US shale fields at the fastest pace in almost two years.\nUS shale is on the brink of major cutbacks, according to JPMorgan Chase & Co (JPM). The industry will cut 50 oil rigs at a sustained $60 a barrel WTI price, reducing production by half a million barrels a day, analysts led by Arun Jayaram wrote in a note this week. If prices drop to $55 a barrel, the impact doubles, the analysts said.\nPrices falling below $60 “will create softness that’s going to cost us jobs,” said T.M. “Roe” Patterson, co-founder and managing partner at private equity fund Marauder Capital. “We’re going stack rigs and we’re going to see an industry pullback,” Patterson said.\nStill, oil field servicers are unlikely to go bankrupt in droves like they did during the 2014 and 2020 downturns. Balance sheets are much healthier after the pandemic as companies focus on capital discipline, said Jeff Krimmel, owner of energy strategy consulting firm Krimmel Strategy Group.\n“It’s not like you’re going to see huge swaths of the sector struggling with liquidity, struggling to pay their bills,” Krimmel said. “For the ones that are best differentiated with technology, this might actually be an opportunity for them to make a more compelling case even than they have to this point.”\nFor his part, Wright wants the oil patch to focus on the benefits he says the Trump administration will bring over the long term. Trump has been clear about his desire for more crude output and lower prices, which will help bring “prosperity at home and peace abroad,” Wright said.\nPredictions “of the demise of demand growth for oil are older than I am,” he said in the Bloomberg TV interview. “A long-term growth rate of oil has been going on for decades. I don’t see any big change in that in the foreseeable future.”\nBut concerns about demand are riding high in an industry that overwhelmingly supported Trump with cash and votes in his run for the White House.\n“I would like to see the administration do a little more to put some consistency in their messaging around crude oil and to backstop pricing a little bit,” Patterson said. “Frankly, everything they’re saying right now is kind of counterintuitive.”\n©2025 Bloomberg L.P.\nDividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does ACNB (ACNB) have what it takes? Let's find out.\nIncome investors can look at the proverbial glass of water as half-full amid intense stock market volatility.  Energy Transfer LP (NYSE: ET) is on the bubble to qualify for this list.  This midstream energy leader's business should hold up quite well even if President Trump's steep tariffs remain in place.\nOil prices have tumbled this year.  Lower crude prices will impact oil company cash flows.  Three oil companies that can still thrive in the current environment are Devon Energy (NYSE: DVN), ConocoPhillips (NYSE: COP), and Chevron (NYSE: CVX).\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nSimple tools are often the best when it comes to researching growth stocks. To speed up your analysis, use the Composite Rating.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nHere’s how inheriting an annuity works and what to do with it.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 11-02_Halliburton & Nabors Unveil First Automated Drilling in Oman",
    "date": "",
    "content": "Title: Halliburton & Nabors Unveil First Automated Drilling in Oman\nDate: 2025-04-16 11:02\nURL: https://finance.yahoo.com/news/halliburton-nabors-unveil-first-automated-110200709.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHalliburton HAL and Nabors Industries Ltd. NBR have reached a breakthrough by completing the first fully automated surface and subsurface execution of rotary and slide drilling operations in Oman. This breakthrough sets a new standard for land-based drilling, showcasing the power of advanced digital technologies to improve efficiency and performance in the oil and energy sector.\nAt the core of this technological feat lies the powerful integration of Halliburton’s LOGIX automation platform and Nabors' SmartROS rig operating system. Together, these cutting-edge solutions enabled a closed-loop drilling system that dramatically enhanced operational efficiency, consistency and real-time decision-making. Wells delivered ahead of schedule, with higher average rates of penetration and reduced non-productive time, set a benchmark for future digital drilling initiatives.\n \nThis achievement is not just a technical milestone, it is a statement of leadership. Halliburton and Nabors, a Hamilton-based oil and gas drilling company, have showcased how synergized digital ecosystems can transform complex drilling operations into streamlined, autonomous processes. The integration of advanced real-time analytics, remote control and data-driven orchestration allowed for seamless management of drilling parameters, setting a new standard for precision and performance.\nSteve Haden, senior VP of Project Management at Halliburton, highlighted the success of the breakthrough in improving efficiency, consistency and reliability. The wells were completed ahead of schedule, with better drilling rates and less downtime, showcasing the Houston, TX-based oil and gas equipment and services company’s leadership in drilling automation.\n \nWhat makes this accomplishment even more remarkable is its immediate impact on well construction timelines. The automation of both rotary and slide drilling not only optimized performance but also reduced drilling time, a critical factor in improving the economic viability of oil and gas projects in the region. By minimizing human intervention and maximizing system intelligence, Halliburton and Nabors proved that digital automation is not a vision for the future, rather, it is a powerful solution available today.\n \nThe strategic importance of this development goes far beyond a single project in Oman. As global energy demands grow, the need for faster, safer and more cost-effective drilling operations becomes paramount. This milestone sets a precedent not only for the Middle East, a hub for oil and gas activity, but also for global markets looking to adopt automated, data-centric drilling solutions. By leveraging the power of digital platforms like LOGIX and SmartROS, Halliburton and Nabors have created a model that other operators can replicate, enhancing global competitiveness and supporting a transition toward more intelligent energy exploration.\n \nWhat comes next is a natural progression toward full autonomy. With the success in Oman serving as a proof of concept, it is clear that digitally enabled rigs, capable of self-optimizing in real time, are no longer science fiction. These are fast becoming the industry standard. From enhancing safety through remote operations to enabling faster learning curves via integrated experience management, the benefits of automation span across every facet of drilling. This is not just a win for Halliburton and Nabors, it is a win for the entire sector and the regions that depend on efficient resource development.\n \nThe collaboration between Halliburton and Nabors in Oman marks a turning point in the future of drilling. This project proves that digital transformation can deliver faster, smarter and more efficient results. As the industry embraces automation, this achievement serves as a powerful example of what is possible when innovation and collaboration drive the way forward.\n \nCurrently, HAL and NBR each has a Zacks Rank #3 (Hold).\nInvestors interested in the energy sector might look at some better-ranked stocks like Archrock, Inc. AROC and Expand Energy Corporation EXE, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is valued at $4.09 billion. In the past year, its shares have risen 21.4%. Archrock, headquartered in Houston, TX, is a prominent energy infrastructure company focused on midstream natural gas compression services throughout the United States. With more than 70 years of experience, Archrock offers a robust fleet of compression equipment and comprehensive aftermarket services to support the production, compression and transportation of natural gas.\nExpand Energy is valued at $23.95 billion. Based in Oklahoma City, OK, Expand Energy is an independent natural gas production company. With significant interests in shale formations across Pennsylvania, Ohio, West Virginia and Louisiana, Expand Energy focuses on the acquisition, exploration and development of properties for producing oil, natural gas and natural gas liquids.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nHalliburton Company (HAL) : Free Stock Analysis Report\nNabors Industries Ltd. (NBR) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nExpand Energy Corporation (EXE) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nHere is how Expand Energy (EXE) and SolarEdge Technologies (SEDG) have performed compared to their sector so far this year.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHere are historical mortgage rates since 1971. Seeing home interest rates over time can help you understand today’s rates and decide if it's a good time to buy a house.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-00_Oceaneering International (OII) Earnings Expected to Grow_ Should You Buy_",
    "date": "",
    "content": "Title: Oceaneering International (OII) Earnings Expected to Grow_ Should You Buy_\nDate: 2025-04-16 14:00\nURL: https://finance.yahoo.com/news/oceaneering-international-oii-earnings-expected-140055541.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOceaneering International (OII) is expected to deliver a year-over-year increase in earnings on higher revenues when it reports results for the quarter ended March 2025. This widely-known consensus outlook gives a good sense of the company's earnings picture, but how the actual results compare to these estimates is a powerful factor that could impact its near-term stock price.\nThe stock might move higher if these key numbers top expectations in the upcoming earnings report, which is expected to be released on April 23. On the other hand, if they miss, the stock may move lower.\nWhile the sustainability of the immediate price change and future earnings expectations will mostly depend on management's discussion of business conditions on the earnings call, it's worth handicapping the probability of a positive EPS surprise.\nThis oilfield services company is expected to post quarterly earnings of $0.36 per share in its upcoming report, which represents a year-over-year change of +157.1%.\nRevenues are expected to be $663.56 million, up 10.8% from the year-ago quarter.\nThe consensus EPS estimate for the quarter has remained unchanged over the last 30 days. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\nInvestors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction).\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\nFor Oceaneering International, the Most Accurate Estimate is higher than the Zacks Consensus Estimate, suggesting that analysts have recently become bullish on the company's earnings prospects. This has resulted in an Earnings ESP of +4.23%.\nOn the other hand, the stock currently carries a Zacks Rank of #3.\nSo, this combination indicates that Oceaneering International will most likely beat the consensus EPS estimate.\nWhile calculating estimates for a company's future earnings, analysts often consider to what extent it has been able to match past consensus estimates. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\nFor the last reported quarter, it was expected that Oceaneering International would post earnings of $0.45 per share when it actually produced earnings of $0.37, delivering a surprise of -17.78%.\nThe company has not been able to beat consensus EPS estimates in any of the last four quarters.\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\nOceaneering International appears a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\nHalliburton (HAL), another stock in the Zacks Oil and Gas - Field Services industry, is expected to report earnings per share of $0.60 for the quarter ended March 2025. This estimate points to a year-over-year change of -21.1%. Revenues for the quarter are expected to be $5.26 billion, down 9.4% from the year-ago quarter.\nOver the last 30 days, the consensus EPS estimate for Halliburton has been revised 1% down to the current level. Nevertheless, the company now has an Earnings ESP of -0.03%, reflecting a lower Most Accurate Estimate.\nWhen combined with a Zacks Rank of #3 (Hold), this Earnings ESP makes it difficult to conclusively predict that Halliburton will beat the consensus EPS estimate. Over the last four quarters, the company surpassed EPS estimates just once.\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nOceaneering International, Inc. (OII) : Free Stock Analysis Report\nHalliburton Company (HAL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-41_Fracker Liberty’s Profit Falls to 3-Year Low as Oil Slumps",
    "date": "",
    "content": "Title: Fracker Liberty’s Profit Falls to 3-Year Low as Oil Slumps\nDate: 2025-04-16 22:41\nURL: https://finance.yahoo.com/news/fracker-liberty-profit-falls-3-224125279.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nAdjusted first-quarter profit fell to 4 cents a share, according to a statement Wednesday, matching the average estimate among analysts. Sales and capital spending both came in better than expected, prompting the shares to rise 5.9% at 6:34 p.m. in New York.\nCurrent levels of fracking activity suggest US oil output will hold steady, “mitigating the possibility of steep declines experienced by the service industry in past cycles,” the company said. Meanwhile, major shale driller Diamondback Energy Inc. said Wednesday that it’s “actively reviewing its operating plan” for the rest of the year given market volatility, according to a separate statement.\n“While the current tumult in commodity prices is not immediately driving changes in North American activity, we expect oil producers are evaluating a range of scenarios in anticipation of oil price pressure,” Diamondback said.\nLiberty’s broad footprint across North American shale provides it a unique scope of vision for domestic oil-production trends. The Denver-based oilfield contractor has tumbled roughly 40% this year as US President Donald Trump’s trade war punished crude prices and tarnished the outlook for near-term fossil-fuel demand.\nLiberty is the first major US-based oil-service company to post quarterly results, with rival Halliburton Co. set to follow Tuesday morning.\n(Updates with sales, capital spending in second paragraph; Diamondback comment in third paragraph.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staf\nWatch five nuclear energy stocks amid massive power demand. These are: CEG, BWXT, PCG, AEP, NEE.\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveInterior Secretary Doug Burgum ordered the pause on\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]