[
  {
    "title": "2025-04-14 13-20_Caterpillar Celebrates First 100 years with a Commitment to the Future Workforce",
    "date": "",
    "content": "Title: Caterpillar Celebrates First 100 years with a Commitment to the Future Workforce\nDate: 2025-04-14 13:20\nURL: https://finance.yahoo.com/news/caterpillar-celebrates-first-100-years-132000948.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCompany Pledges $100 Million to Help Equip Tomorrow's Innovators\nIRVING, Texas, April 14, 2025 /PRNewswire/ -- Caterpillar Inc. (NYSE: CAT) today announced an investment to support a key source of its success and longevity for the next 100 years: people. As part of the celebration, the company pledged $100 million over the next five years to help equip the workforce of the future with the skills needed, leveraging technology to meet global market demands as the world undergoes a rapid digital transformation.\n\"We are excited to celebrate Caterpillar's centennial with this investment that will empower the workforce of tomorrow,\" said Caterpillar Chairman and CEO Jim Umpleby. \"This pledge reinforces our commitment to building a world where technology and human creativity can work hand in hand to create a more resilient workforce. Together, by empowering individuals with the skills and resources they need to thrive, we can make that world our reality.\"\nAccording to The Future of Jobs Report 2025, in the next five years, the skillsets needed for success in the global labor market are expected to evolve drastically. This transformation will result in the creation of 170 million new jobs. These technology-driven skills can include those for artificial intelligence (AI), automation, data analytics, digital twins, Internet of Things (IoT), machine language, augmented reality, computer-aid design and modeling, and robotics maintenance, alongside soft skills.\n\"As an industry leader, Caterpillar understands the urgency of preparing the next generation with the capabilities required for the jobs of tomorrow,\" said Jaime Mineart, chief technology officer at Caterpillar, and pledge executive sponsor. \"This pledge, our first of its kind, reflects our dedication to collaborating with our global stakeholders to devise the best training solutions.\"\nThe pledge builds upon Caterpillar's ongoing work to help close the growing skills gap in the manufacturing industry, including:\nThinkBIG, a two-year program that pays students while they train to become technicians.\nThe company's STEM outreach programs that expose K-12 students to different careers in manufacturing.\nCaterpillar's Global Dealer Technician Challenge - an initiative showcasing how skilled technicians are part of a high-tech, high-impact, high-demand career. The competition was designed to raise awareness of the opportunities in the technician career field.\nThroughout 2025, Caterpillar will be engaging in bringing key actors together on forward-looking solutions and building on what we have already achieved in preparing the workforce of the future. To learn more about the program's progress, visit caterpillar.com.\nCentennial CelebrationsThis year, Caterpillar is reflecting on its rich past and promising future at local celebrations across the world as part of a centennial world tour. In addition to Caterpillar's $100 million pledge, the Caterpillar Foundation, Caterpillar's philanthropic organization, is making charitable donations to local nonprofit organizations at each tour stop, building on the Foundation's legacy of impact through community development and sustainability initiatives.\n\"Whether it is Caterpillar investing in the future of work, or Caterpillar employees volunteering, the company's culture has always been about supporting communities where its employees live and work,\" said Asha Varghese, head of corporate social responsibility at Caterpillar. \"This ongoing commitment to serving communities helps create an environment in which everyone can thrive.\"\nFor more information about Caterpillar's centennial, please visit caterpillar.com/100.\nView the multimedia release here: https://www.multivu.com/caterpillar/9327651-en-caterpillar-reaches-100-year-milestone\nAbout CaterpillarWith 2024 sales and revenues of $64.8 billion, Caterpillar Inc. is the world's leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives. For 100 years, we've been helping customers build a better, more sustainable world and are committed and contributing to a reduced-carbon future. Our innovative products and services, backed by our global dealer network, provide exceptional value that helps customers succeed. Caterpillar does business on every continent, principally operating through three primary segments – Construction Industries, Resource Industries and Energy & Transportation – and providing financing and related services through our Financial Products segment. Visit us at caterpillar.com or join the conversation on our social media channels at caterpillar.com/en/news/social-media.html.\nView original content to download multimedia:https://www.prnewswire.com/news-releases/caterpillar-celebrates-first-100-years-with-a-commitment-to-the-future-workforce-302427618.html\nSOURCE Caterpillar Inc.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nFEATURE   Caterpillar stock rose early but closed lower on Tuesday after the company announced a CEO transition. The machinery maker is filling its top executive role from inside the company. Shares fell 1.\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.  Umpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.  Umpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\nMcDonald's (MCD) concluded the recent trading session at $312.48, signifying a -1.14% move from its prior day's close.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nThese 10 stocks performed the best over the past 10 years.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 09-01_Construction Machinery Q4 Earnings_ Astec (NASDAQ_ASTE) is the Best in the Biz",
    "date": "",
    "content": "Title: Construction Machinery Q4 Earnings_ Astec (NASDAQ_ASTE) is the Best in the Biz\nDate: 2025-04-15 09:01\nURL: https://finance.yahoo.com/news/construction-machinery-q4-earnings-astec-090122145.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how Astec (NASDAQ:ASTE) and the rest of the construction machinery stocks fared in Q4.\nAutomation that increases efficiencies and connected equipment that collects analyzable data have been trending, creating new sales opportunities for construction machinery companies. On the other hand, construction machinery companies are at the whim of economic cycles. Interest rates, for example, can greatly impact the commercial and residential construction that drives demand for these companies’ offerings.\nThe 4 construction machinery stocks we track reported a slower Q4. As a group, revenues missed analysts’ consensus estimates by 1.4%.\nAmidst this news, share prices of the companies have had a rough stretch. On average, they are down 16.1% since the latest earnings results.\nInventing the first ever double-barrel hot-mix asphalt plant, Astec (NASDAQ:ASTE) provides machines and equipment for building roads, processing raw materials, and producing concrete.\nAstec reported revenues of $359 million, up 6.5% year on year. This print fell short of analysts’ expectations by 4%, but it was still a strong quarter for the company with a solid beat of analysts’ EPS estimates and an impressive beat of analysts’ EBITDA estimates.\nAstec pulled off the fastest revenue growth but had the weakest performance against analyst estimates of the whole group. Unsurprisingly, the stock is up 9.3% since reporting and currently trades at $34.11.\nIs now the time to buy Astec? Access our full analysis of the earnings results here, it’s free.\nContracted by the United States Navy during WWII, Manitowoc (NYSE:MTW) provides cranes and lifting equipment.\nManitowoc reported revenues of $596 million, flat year on year, in line with analysts’ expectations. The business performed better than its peers, with a significant beat of analysts' EPS estimates.\nThe stock is down 23.2% since reporting. It currently trades at $7.53.\nIs now the time to buy Manitowoc? Access our full analysis of the earnings results here, it’s free.\nWith its iconic yellow machinery working on construction sites, Caterpillar (NYSE:CAT) manufactures construction equipment like bulldozers, excavators, and parts and maintenance services.\nCaterpillar reported revenues of $16.22 billion, down 5% year on year, falling short of analysts’ expectations by 2%. It was a softer quarter as it posted a significant miss of analysts’ adjusted operating income estimates and a miss of analysts’ organic revenue estimates.\nCaterpillar delivered the slowest revenue growth in the group. As expected, the stock is down 23.7% since the results and currently trades at $299.92.\nRead our full analysis of Caterpillar’s results here. \nWith humble beginnings as a dump truck company, Terex (NYSE:TEX) today manufactures lifting and material handling equipment designed to move and hoist heavy goods and materials.\nTerex reported revenues of $1.24 billion, up 1.5% year on year. This number beat analysts’ expectations by 0.8%. Aside from that, it was a slower quarter as it recorded full-year EBITDA guidance missing analysts’ expectations.\nTerex achieved the biggest analyst estimates beat among its peers. The stock is down 26.8% since reporting and currently trades at $35.13.\nRead our full, actionable report on Terex here, it’s free. \nThanks to the Fed’s series of rate hikes in 2022 and 2023, inflation has cooled significantly from its post-pandemic highs, drawing closer to the 2% goal. This disinflation has occurred without severely impacting economic growth, suggesting the success of a soft landing. The stock market thrived in 2024, spurred by recent rate cuts (0.5% in September and 0.25% in November), and a notable surge followed Donald Trump’s presidential election win in November, propelling indices to historic highs. Nonetheless, the outlook for 2025 remains clouded by potential trade policy changes and corporate tax discussions, which could impact business confidence and growth. The path forward holds both optimism and caution as new policies take shape.\nWant to invest in winners with rock-solid fundamentals? Check out our Top 6 Stocks and add them to your watchlist. These companies are poised for growth regardless of the political or macroeconomic climate.\nJoin Paid Stock Investor Research\nHelp us make StockStory more helpful to investors like yourself. Join our paid user research session and receive a $50 Amazon gift card for your opinions. Sign up here.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where Accenture plc (NYSE:ACN) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading at significant […]\nU.S. stocks drifted Tuesday through a rare quiet day for financial markets.  The Dow Jones Industrial Average fell 155 points, or 0.4%, and the Nasdaq composite edged down by less than 0.1%.  The modest moves offered some respite following the huge swings that have battered Wall Street recently, not just day to day but also hour to hour.\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.  Umpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.  Umpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\nCandice Li says that after Washington raised tariffs on Chinese goods by 145%, U.S. orders for the medical devices her firm is making have vanished.  Li was at her firm's booth at the Canton Fair, China's biggest trade expo held twice-a-year in the southern city of Guangzhou, where more than 30,000 exhibitors showcase their products over an area larger than 200 football fields.  This was the first such fair China has held since U.S. President Donald Trump slapped tariffs in excess of 100% on China and of at least 10% on the rest of the world earlier this month.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 10-45_Caterpillar Chairman and CEO Jim Umpleby to become Executive Chairman; Caterpillar Chief Operating O",
    "date": "",
    "content": "Title: Caterpillar Chairman and CEO Jim Umpleby to become Executive Chairman; Caterpillar Chief Operating O\nDate: 2025-04-15 10:45\nURL: https://finance.yahoo.com/news/caterpillar-chairman-ceo-jim-umpleby-104500111.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIRVING, Texas, April 15, 2025 /PRNewswire/ -- After eight years as CEO and nearly 45 years of service, Caterpillar Inc. (NYSE: CAT) Chairman and CEO D. James Umpleby III will become Executive Chairman of the Board effective May 1. Chief Operating Officer (COO) Joseph E. Creed, a 28-year Caterpillar veteran, will succeed him as CEO and join the Board of Directors May 1.\nAfter assuming the role of CEO on January 1, 2017, Umpleby led the development and execution of a new strategy for long-term profitable growth, creating significant shareholder value. In 2024, Caterpillar achieved record full-year adjusted profit per share, which increased more than sixfold during Umpleby's tenure as CEO.\n\"I'm grateful to have had the opportunity to work with Caterpillar's dedicated global team of employees and dealers for my entire career. As we celebrate our 100th anniversary, we honor those who came before us establishing a culture of excellence serving our customers.\" said Umpleby.  \"I have great confidence in my successor Joe Creed and the entire Executive Office to lead our global team as Caterpillar embarks upon our second century of helping our customers build a better, more sustainable world.\"\nCreed joined Caterpillar in 1997 and has held numerous positions of increasing responsibility across multiple divisions of Caterpillar. He was promoted to Chief Financial Officer for Caterpillar's Energy & Transportation business segment in 2013, then to Vice President of Caterpillar's Finance Services Division in 2017. Creed also served as interim Chief Financial Officer for Caterpillar in 2018. He then became Vice President of the Oil & Gas and Marine Division and the Electric Power Division. In 2021, he was promoted to Group President of Energy & Transportation. Effective November 1, 2023, Creed was appointed to the newly created position of Chief Operating Officer.\n\"For 100 years, our incredible people have been the foundation of Caterpillar's success,\" said Creed. \"I'm proud to work alongside our talented Caterpillar employees and dealers as we continue to support customers across our diverse businesses, from disaster recovery and building the world's infrastructure to delivering critical minerals and reliable energy. I look forward to leading this amazing team as we build upon Caterpillar's legacy of excellence.\"\nDebra L. Reed-Klages, who has served as a Director since June 2015, will remain on the Board as independent Presiding Director, a position she has held since June 2022.\n\"We are deeply grateful for Jim's leadership and appreciate the outstanding results he achieved during his tenure. His impact on our customers, dealers, shareholders and employees will continue for years to come,\" Reed-Klages said. \"Joe's selection as CEO is the result of a multi-year succession planning process by the Board of Directors. He is a proven leader with significant experience in Caterpillar's global businesses. We are confident Joe will position Caterpillar for continued future success.\"\nAbout CaterpillarWith 2024 sales and revenues of $64.8 billion, Caterpillar Inc. is the world's leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives. For 100 years, we've been helping customers build a better, more sustainable world and are committed and contributing to a reduced-carbon future. Our innovative products and services, backed by our global dealer network, provide exceptional value that helps customers succeed. Caterpillar does business on every continent, principally operating through three primary segments – Construction Industries, Resource Industries and Energy & Transportation – and providing financing and related services through our Financial Products segment. Visit us at caterpillar.com or join the conversation on our social media channels at caterpillar.com/en/news/social-media.html.\nForward-Looking StatementsCertain statements in this press release relate to future events and expectations and are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as \"believe,\" \"estimate,\" \"will be,\" \"will,\" \"would,\" \"expect,\" \"anticipate,\" \"plan,\" \"forecast,\" \"target,\" \"guide,\" \"project,\" \"intend,\" \"could,\" \"should\" or other similar words or expressions often identify forward-looking statements. All statements other than statements of historical fact are forward-looking statements, including, without limitation, statements regarding our outlook, projections, forecasts or trend descriptions. These statements do not guarantee future performance and speak only as of the date they are made, and we do not undertake to update our forward-looking statements.\nCaterpillar's actual results may differ materially from those described or implied in our forward-looking statements based on a number of factors, including, but not limited to: (i) global and regional economic conditions and economic conditions in the industries we serve; (ii) commodity price changes, material price increases, fluctuations in demand for our products or significant shortages of material; (iii) government monetary or fiscal policies; (iv) political and economic risks, commercial instability and events beyond our control in the countries in which we operate; (v) international trade policies and their impact on demand for our products and our competitive position, including the imposition of new tariffs or changes in existing tariff rates; (vi) our ability to develop, produce and market quality products that meet our customers' needs; (vii) the impact of the highly competitive environment in which we operate on our sales and pricing; (viii) information technology security threats and computer crime; (ix) inventory management decisions and sourcing practices of our dealers and our OEM customers; (x) a failure to realize, or a delay in realizing, all of the anticipated benefits of our acquisitions, joint ventures or divestitures; (xi) union disputes or other employee relations issues; (xii) adverse effects of unexpected events; (xiii) disruptions or volatility in global financial markets limiting our sources of liquidity or the liquidity of our customers, dealers and suppliers; (xiv) failure to maintain our credit ratings and potential resulting increases to our cost of borrowing and adverse effects on our cost of funds, liquidity, competitive position and access to capital markets; (xv) our Financial Products segment's risks associated with the financial services industry; (xvi) changes in interest rates or market liquidity conditions; (xvii) an increase in delinquencies, repossessions or net losses of Cat Financial's customers; (xviii) currency fluctuations; (xix) our or Cat Financial's compliance with financial and other restrictive covenants in debt agreements; (xx) increased pension plan funding obligations; (xxi) alleged or actual violations of trade or anti-corruption laws and regulations; (xxii) additional tax expense or exposure, including the impact of U.S. tax reform; (xxiii) significant legal proceedings, claims, lawsuits or government investigations; (xxiv) new regulations or changes in financial services regulations; (xxv) compliance with environmental laws and regulations; (xxvi) catastrophic events, including global pandemics such as the COVID-19 pandemic; and (xxvii) other factors described in more detail in Caterpillar's Forms 10-Q, 10-K and other filings with the Securities and Exchange Commission.\n \nView original content to download multimedia:https://www.prnewswire.com/news-releases/caterpillar-chairman-and-ceo-jim-umpleby-to-become-executive-chairman-caterpillar-chief-operating-officer-joe-creed-elected-as-caterpillars-next-ceo-302428783.html\nSOURCE Caterpillar Inc.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nCaterpillar has decided to make a change at the top, replacing Jim Umpleby with Joe Creed.\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.  Umpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.  Umpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 10-55_Caterpillar names insider Joe Creed as successor to CEO Umpleby",
    "date": "",
    "content": "Title: Caterpillar names insider Joe Creed as successor to CEO Umpleby\nDate: 2025-04-15 10:55\nURL: https://finance.yahoo.com/news/caterpillar-names-insider-joseph-e-105523559.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Shivansh Tiwary and Aishwarya Jain\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.\nUmpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.\nUmpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\n\"While Creed will be stepping into the role at a challenging part in the cycle and amid a dynamic macro backdrop, we believe the well-telegraphed internal succession, and Umpleby's transition to executive chairman likely limits the impact on shares,\" Kristen Owen, senior analyst at Oppenheimer, wrote in a note.\nCaterpillar's shares were up 1% in morning trade. They have lost nearly 18% of their value this year.\n\"Historically, this means there will be consistency and continuity rather than any big changes in strategy or tactics,\" Jefferies analyst Stephen Volkmann said.\n\"I would not expect any meaningful changes at the company for at least a year or two, if at all.\"\nCaterpillar had reaped the benefits of former President Joe Biden's 2021 infrastructure law - a $1 trillion enactment aimed at upgrading roads, bridges and other transport infrastructure.\nHowever, the initial demand surge waned as due to high borrowing costs and persistent inflation.\nSeveral contractors are also adopting a wait-and-see approach to buying new machinery against the backdrop of mounting uncertainty over government spending under the Trump administration.\nThe company, set to report first-quarter results later this month, has forecast a slight decline in sales for 2025.\n(Reporting by Aishwarya Jain and Shivansh Tiwary in Bengaluru; Editing by Shounak Dasgupta, Anil D'Silva and Sriraj Kalluvila)\nThe company agreed to a $347 million takeover by U.S. buyout firm Atlas Holdings, signaling the end of its nearly 80-year listing on the London Stock Exchange.\nThe outlook for the German economy cratered this month after Trump’s tariff blitz, according to a monthly survey of financial analysts.\nThe yield on 30-year Japanese government bonds has surged to its highest level since 2004, raising concerns among investors.\nThe network business reported a 6% rise in sales, with strong growth in North America as customers moved forward investments ahead of planned U.S. tariffs.\nSpring is usually a busy period at the Ben Reid Garden Centre on the outskirts of Aberdeen. But this year it has come with a chill for the 250-year-old family business.\nEuropean stocks were rising Tuesday after U.S. President Donald Trump said he could pause some tariffs on auto makers, sparking hopes of further exemptions. The continent's flagship Stoxx 600 index climbed 1.\nCanada said that automakers will be allowed to continue to import a certain number of US-made cars and trucks, tariff-free, provided they keep manufacturing vehicles in the country. Keith Naughton reports on Bloomberg Television.\nLVMH sales fell more than expected in the first quarter, weighed down by weak demand for luxury goods in China and the US and the threat of a trade war. Bloomberg's Angelina Rascouet reports.\nThe acquisition aligns with ArcLight's strategy to address increasing power demand driven by AI and electrification trends.\nOther companies hit hard include a medical device maker, a semiconductor firm and the maker of Vans sneakers.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 12-35_Caterpillar Changes CEOs, With COO Creed Taking Over",
    "date": "",
    "content": "Title: Caterpillar Changes CEOs, With COO Creed Taking Over\nDate: 2025-04-15 12:35\nURL: https://www.investopedia.com/caterpillar-changes-ceos-with-coo-creed-taking-over-11715305?.tsrc=rss\nContent:\nMICHAELA STACHE / AFP via Getty Images\n Caterpillar (CAT) has made a change at the top.\n\n Amid global uncertainty because of tariffs and a falling stock price, construction giant Caterpillar on Tuesday announced that Chief Executive Officer Jim Umpleby will become executive chairman of its board on May 1 after eight years at the helm.1\n\n Umpleby will be replaced as CEO by Chief Operating Officer (COO) Joe Creed, a 28-year Caterpillar veteran. Creed also will be joining the board on May 1.\n\n Shares of Caterpillar, which operates a global footprint and is considered a bellwether for economic growth and contraction. entered Tuesday down 18% in 2025 amid widespread uncertainty following President Donald Trump's sweeping \"reciprocal\" tariffs.\n\n Shares of Caterpillar, a Dow component, were little changed before the opening bell, edging just a bit higher. Wall Street analysts have a mean price target of around $364 on the shares, representing a more-than-20% premium to yesterday's close.\n\nCaterpillar. \"Caterpillar Chairman and CEO Jim Umpleby to become Executive Chairman; Caterpillar Chief Operating Officer Joe Creed Elected as Caterpillar's Next CEO.\""
  },
  {
    "title": "2025-04-15 12-55_NYSE Content Advisory_ Pre-Market update + Bank of America beats earnings estimates",
    "date": "",
    "content": "Title: NYSE Content Advisory_ Pre-Market update + Bank of America beats earnings estimates\nDate: 2025-04-15 12:55\nURL: https://finance.yahoo.com/news/nyse-content-advisory-pre-market-125500437.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNEW YORK, April 15, 2025 /PRNewswire/ -- The New York Stock Exchange (NYSE) provides a daily pre-market update directly from the NYSE Trading Floor. Access today's NYSE Pre-market update for market insights before trading begins.\nKristen Scholer delivers the pre-market update on April 15th\nBank of America (NYSE: BAC) reported better than expected results this morning, raising share price pre-market.\nGeneral Motors (NYSE: GM) and Ford (NYSE: F) rose after President Trump's comments around helping auto companies\nJohnson & Johnson (NYSE: JNJ), Citigroup (NYSE: C), and PNC (NYSE: PNC) highlight upcoming earnings\nOpening BellCaterpillar (NYSE: CAT) celebrates its 100th anniversary\nClosing BellAxis Capital (NYSE: AXS) marks the two-year anniversary of Vincent Tizzio as President & CEO\nDownload the NYSE TV App and Subscribe Here\n \nView original content to download multimedia:https://www.prnewswire.com/news-releases/nyse-content-advisory-pre-market-update--bank-of-america-beats-earnings-estimates-302428948.html\nSOURCE New York Stock Exchange\nWhile the top- and bottom-line numbers for Citigroup (C) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nThe headline numbers for Bank of America (BAC) give insight into how the company performed in the quarter ended March 2025, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals.\nWhile the top- and bottom-line numbers for Johnson & Johnson (JNJ) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nWe recently published a list of Top 10 Restaurant Stocks to Buy Under $20. In this article, we are going to take a look at where Arcos Dorados Holdings Inc. (NYSE:ARCO) stands against other top restaurant stocks to buy under $20. The Impact of Trump’s Tariffs on the Restaurant Industry Restaurant stocks are showing volatility […]\nGriffon and Cars.com's have been highlighted as Zacks Bull and Bear of the Day\n(Reuters) -     U.S. bank PNC Financial  (PNC) reported a rise in first-quarter profit on Tuesday, helped by a boost in interest income.\n↗️ Netflix (NFLX): The streaming company aims to achieve a $1 trillion market capitalization and double its revenue by 2030, The Wall Street Journal reported. Shares closed 4.8% higher. 🔎 MP Materials (MP); USA Rare Earth (USAR): Shares in the rare-earth companies were mixed, after surging Monday following a Financial Times report that President Trump plans to stockpile critical metals to counter China.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 13-00_Here is What to Know Beyond Why Caterpillar Inc. (CAT) is a Trending Stock",
    "date": "",
    "content": "Title: Here is What to Know Beyond Why Caterpillar Inc. (CAT) is a Trending Stock\nDate: 2025-04-15 13:00\nURL: https://finance.yahoo.com/news/know-beyond-why-caterpillar-inc-130014830.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCaterpillar (CAT) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this construction equipment company have returned -13%, compared to the Zacks S&P 500 composite's -3.9% change. During this period, the Zacks Manufacturing - Construction and Mining industry, which Caterpillar falls in, has lost 12%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\nCaterpillar is expected to post earnings of $4.32 per share for the current quarter, representing a year-over-year change of -22.9%. Over the last 30 days, the Zacks Consensus Estimate has changed -1.9%.\nThe consensus earnings estimate of $19.41 for the current fiscal year indicates a year-over-year change of -11.4%. This estimate has changed -1.7% over the last 30 days.\nFor the next fiscal year, the consensus earnings estimate of $21.69 indicates a change of +11.7% from what Caterpillar is expected to report a year ago. Over the past month, the estimate has changed -2.2%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Caterpillar.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Caterpillar, the consensus sales estimate for the current quarter of $14.61 billion indicates a year-over-year change of -7.5%. For the current and next fiscal years, $62.51 billion and $65.47 billion estimates indicate -3.6% and +4.7% changes, respectively.\nCaterpillar reported revenues of $16.22 billion in the last reported quarter, representing a year-over-year change of -5%. EPS of $5.14 for the same period compares with $5.23 a year ago.\nCompared to the Zacks Consensus Estimate of $16.64 billion, the reported revenues represent a surprise of -2.57%. The EPS surprise was +3.42%.\nOver the last four quarters, Caterpillar surpassed consensus EPS estimates three times. The company could not beat consensus revenue estimates in any of the last four quarters.\nNo investment decision can be efficient without considering a stock's valuation. Whether a stock's current price rightly reflects the intrinsic value of the underlying business and the company's growth prospects is an essential determinant of its future price performance.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nCaterpillar is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Caterpillar. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nCaterpillar Inc. (CAT) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nHBAN's first-quarter 2025 results are likely to have been impacted by a decline in fee income and a rise in expenses.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nDanaher (DHR) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBarclays analyst Dan Levy downgraded his view of the sector to “Negative” and cut his rating for General Motors to Hold from Buy.\nPDD Holdings Inc. Sponsored ADR (PDD) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nBJ's Wholesale stock is soaring, but after a 34% YTD rally, should you ride the momentum or lock in gains?\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 14-50_Palantir, Caterpillar, HPE_ Trending Tickers",
    "date": "",
    "content": "Title: Palantir, Caterpillar, HPE_ Trending Tickers\nDate: 2025-04-15 14:50\nURL: https://finance.yahoo.com/video/palantir-caterpillar-hpe-trending-tickers-145019262.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMadison Mills takes a closer look at some of the trending tickers of the trading day.\nPalantir (PLTR) is in focus after NATO bought its Maven Smart System.\nCaterpillar's (CAT) CEO, James Umpleby, will step down with COO Joe Creed taking his place on May 1.\nActivist investor Elliott Management builds a $1.5 billion stake in HPE (HPE), according to Bloomberg reports.\nTo watch more expert insights and analysis on the latest market action, check out more Catalysts here.\nIt's now time for some of today's trending tickers. Today we're watching Palantir, Caterpillar and HPE. First up, Palantir rising after NATO finalized the purchase of the company's AI military system. NATO says it's completed an acquisition of Palantir's Maven Smart system at the end of March. The Maven system uses AI to collect and analyze large amounts of data to modernize war fighting capabilities. Next up, Caterpillar announcing CEO Jim Umpleby will step down at the end of the month. Chief Operating Officer Joe Creed will take over the role effective on May 1st. Caterpillar set to report its first quarter results later this month. And finally, we are watching HPE. Activist investor Elliott Management reportedly taking a stake worth more than 1 and a half billion dollars. According to Bloomberg, Elliott plans to engage with the software company to help it boost its value moving forward here. And those are your trending tickers for the day.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nUK&nbsp;inflation&nbsp;slipped back for a second straight month. Consumer prices rose 2.6% in the 12 months to March, an easing from the 2.8% increase in February, according to the Office for National Statistics. The ONS said the slowdown was driven by cheaper computer games, falling fuel prices and unchanged food costs. Bloomberg's John Stepek reports.\nWe recently published a list of 10 Firms End Stronger on Tuesday. In this article, we are going to take a look at where Hewlett Packard Enterprise Company (NYSE:HPE) stands against other firms that end stronger on Tuesday. A muted trading persisted on the stock market on Tuesday, with major indices ending in the red, […]\nThe Palantir, MicroStrategy and Take-Two Interactive have been highlighted in this Investment Ideas article.\nThe U.S. government ”indicated that the license requirement addresses the risk that the covered products may be used in, or diverted to, a supercomputer in China,” Nvidia said.\nMcDonald's (MCD) concluded the recent trading session at $312.48, signifying a -1.14% move from its prior day's close.\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.  Umpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.  Umpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 15-15_Wall Street sees strategic continuity as Caterpillar names Creed CEO",
    "date": "",
    "content": "Title: Wall Street sees strategic continuity as Caterpillar names Creed CEO\nDate: 2025-04-15 15:15\nURL: https://finance.yahoo.com/news/wall-street-sees-strategic-continuity-151502044.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nInvesting.com -- Caterpillar’s appointment of insider Joe Creed as its next chief executive, was dubbed a “well-telegraphed transition” by Wall Street that ensures strategic continuity at a pivotal time for the construction and machinery giant.\nCreed, chief operating officer, will succeed longtime CEO Jim Umpleby on May 1. Umpleby, who led  Caterpillar  (NYSE:CAT) through a multiyear operational turnaround, will become executive chairman.\nBarclays said the internal promotion brings “no surprises” and reflects a succession process that’s been “quasi investor-facing for several years.” Brokerage noted Creed’s strong background in both engineering and finance, two areas investors closely watch, positions him to carry forward the company’s focus on operational discipline, aftermarket growth, and capital efficiency.\n“Creed is a known entity to capital markets,” Barclays said, pointing to his appearances in investor settings and past roles, including interim CFO and head of the Energy & Transportation segment.\nOppenheimer echoed the view, saying the timing, aligned with Caterpillar’s 100th anniversary, signals continuity and confidence. “While Mr. Creed will be stepping into the role at a challenging part in the cycle and amid a dynamic macro backdrop, we believe the well-telegraphed internal succession, and Mr. Umpleby’s transition to Executive Chairman likely limits the impact on shares,” the firm wrote.\nCreed, a 28-year Caterpillar veteran, has held leadership posts across key business units including Electric Power, Oil & Gas, and Marine. He was named COO in October 2023, widely seen as a precursor to his elevation to CEO.\nAnalysts highlighted Creed’s leadership in Energy & Transportation as key to Caterpillar’s evolving strategy. Barclays noted investor focus on the segment has grown alongside demand for data centers and power generation, where Caterpillar sees potential for competitive differentiation.\nUmpleby’s tenure is credited with restoring stability and profitability through a renewed focus on core businesses. Barclays said his leadership saw Caterpillar streamline its operations, prioritize R&D, and make selective, strategic acquisitions like the $400 million deal for Weir’s Oil & Gas unit.\nRelated articles\nWall Street sees strategic continuity as Caterpillar names Creed CEO\nBofA downgrades U.S. chemical sector amid slowdown\nBernstein starts Xiaomi at ‘outperform,’ sees EV push as key equity driver\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nCaterpillar has decided to make a change at the top, replacing Jim Umpleby with Joe Creed.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nServiceNow (NYSE: NOW) stock is moving higher in Tuesday's trading.  The software specialist's share price was up 1.9% as of 2:30 p.m. ET, and been up as much as 3.1% earlier in the day.  Two investment firms updated their valuation forecasts for ServiceNow today and lowered their respective price targets on the stock.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 17-38_Caterpillar (NYSE_CAT) Announces CEO Transition With Joseph E. Creed Succeeding Umpleby",
    "date": "",
    "content": "Title: Caterpillar (NYSE_CAT) Announces CEO Transition With Joseph E. Creed Succeeding Umpleby\nDate: 2025-04-15 17:38\nURL: https://finance.yahoo.com/news/caterpillar-nyse-cat-announces-ceo-173858785.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCaterpillar recently announced a significant executive leadership change, with Joseph E. Creed appointed as the new CEO effective May 1, 2025. This leadership transition, along with adjustments to executive compensation, appears timely with the company's stock seeing a 6% rise last week. This move aligned closely with broader market trends where major indexes were buoyed by tech and bank stocks amid easing U.S.-China trade tensions. Within this context, Caterpillar's announcements likely added positive sentiment, supporting the stock's alignment with the market's upward trajectory, which saw a similar 7% climb over the same period.\nWe've identified 2 possible red flags with Caterpillar and understanding the impact should be part of your investment process.\nTrump has pledged to \"unleash\" American oil and gas and these 20 US stocks have developments that are poised to benefit.\nThe recent leadership change at Caterpillar, with Joseph E. Creed stepping in as CEO, might further solidify the company's strategic focus on sustainability and growth in alternative fuel markets. This aligns with Caterpillar's ongoing investments in capacity expansion and new technologies, potentially improving long-term revenue growth. While recent executive changes have buoyed short-term sentiment, impacting weekly stock performance positively, the firm's share price also reflects longstanding investor confidence with a total return of 186.72% over the last five years. This context frames a robust performance relative to the broader US market and offers a clear view of its trajectory beyond near-term fluctuations.\nAnalysis shows Caterpillar's shares are somewhat discounted compared to the consensus analyst price target of US$365.99, which indicates potential upward movement of over 20%. If the new leadership can successfully navigate near-term challenges such as lower sales volumes and an unfavorable product mix, revenue and earnings forecasts could improve in line with market expectations. A focus on high-margin services and strategic capital deployment could further enhance shareholder returns despite potential revenue pressures in certain sectors. As the company continues to pursue its sustainability goals, any advancements could further align with long-term market trends, potentially justifying current and future valuations.\nDive into the specifics of Caterpillar here with our thorough balance sheet health report.\n This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include NYSE:CAT.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.  Umpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.  Umpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where 3M Company (NYSE:MMM) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the end of […]\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nCaterpillar has decided to make a change at the top, replacing Jim Umpleby with Joe Creed.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of 10 Best Bargain Stocks to Buy in May. In this article, we are going to take a look at where Union Pacific Corporation (NYSE:UNP) stands against other best bargain stocks to buy in May. While increasing tariffs and a hard sell-off have resulted in uncertainty, Neuberger Berman, an investment manager, […]\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 19-50_Caterpillar Names COO Joseph Creed as Next CEO",
    "date": "",
    "content": "Title: Caterpillar Names COO Joseph Creed as Next CEO\nDate: 2025-04-15 19:50\nURL: https://finance.yahoo.com/news/caterpillar-names-coo-joseph-creed-195004208.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nBank of America's (BAC) first-quarter results surpassed Wall Street's projections as record trading\nAlbertsons (ACI) issued a full-year earnings outlook below Wall Street expectations on Tuesday, even\nThe International Energy Agency on Tuesday reduced its projections for global oil demand growth in 2\nNew York manufacturing activity improved more than expected this month, while the outlook turned neg\nNetflix (NFLX) likely faces \"limited\" risks from a potential global or US economic downturn amid the\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-00_Caterpillar Inc. to Announce First-Quarter 2025 Financial Results on April 30",
    "date": "",
    "content": "Title: Caterpillar Inc. to Announce First-Quarter 2025 Financial Results on April 30\nDate: 2025-04-16 13:00\nURL: https://finance.yahoo.com/news/caterpillar-inc-announce-first-quarter-130000098.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIRVING, Texas, April 16, 2025 /PRNewswire/ -- Caterpillar Inc. (NYSE: CAT) will release first-quarter 2025 financial results at 5:30 a.m. CDT on Wednesday, April 30. The full text of the release will be available at investors.caterpillar.com/financials/quarterly-results and on PR Newswire. The release will be furnished to the U.S. Securities and Exchange Commission (SEC) via a Current Report on Form 8-K in compliance with applicable SEC rules.\nTeleconference and webcast access:A real-time, listen-only teleconference and webcast of the quarterly results call that Caterpillar conducts with securities analysts and institutional investors will begin at 7:30 a.m. CDT on Wednesday, April 30. Supporting materials will be available before the webcast at investors.caterpillar.com/events-presentations.\nIn addition to the webcast, the one-hour conference call can also be accessed by telephone from both domestic and international locations, with a conference ID provided below:\nConference ID:\n8390933\nParticipant Toll-Free Dial-In Number:\n(800) 715-9871\nParticipant Toll Dial-In Number:\n+1 (646) 307-1963\nThe call can be accessed in real-time at investors.caterpillar.com/financials/quarterly-results. Listeners should go to the website before the live event to download and install any necessary audio software. The transcript from the conference call will be available at investors.caterpillar.com/financials/quarterly-results following the webcast.\nFor those unable to participate in the live broadcast, the replay will be available at investors.caterpillar.com/financials/quarterly-results shortly after the live event. There is no charge to access the webcast. A telephone replay will not be available.\nAbout CaterpillarWith 2024 sales and revenues of $64.8 billion, Caterpillar Inc. is the world's leading manufacturer of construction and mining equipment, off-highway diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives. For nearly 100 years, we've been helping customers build a better, more sustainable world and are committed and contributing to a reduced-carbon future. Our innovative products and services, backed by our global dealer network, provide exceptional value that helps customers succeed. Caterpillar does business on every continent, principally operating through three primary segments – Construction Industries, Resource Industries and Energy & Transportation – and providing financing and related services through our Financial Products segment. Visit us at caterpillar.com or join the conversation on our social media channels at caterpillar.com/en/news/social-media.html.\nCaterpillar's latest financial results are also available online:\nhttps://investors.caterpillar.com/overview/default.aspx\nhttps://investors.caterpillar.com/financials/quarterly-results/default.aspx (live broadcast/replays of quarterly conference call)\n \nView original content to download multimedia:https://www.prnewswire.com/news-releases/caterpillar-inc-to-announce-first-quarter-2025-financial-results-on-april-30-302429711.html\nSOURCE Caterpillar Inc.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar has decided to make a change at the top, replacing Jim Umpleby with Joe Creed.\nAll is not lost when it comes to investing in Nvidia. Here's what Lawrence McDonald of the Bear Traps Report has to say.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]