[
  {
    "title": "2025-04-14 08-59_Morgan Stanley, Citi cut US earnings estimates as season starts",
    "date": "",
    "content": "Title: Morgan Stanley, Citi cut US earnings estimates as season starts\nDate: 2025-04-14 08:59\nURL: https://finance.yahoo.com/news/morgan-stanley-citi-cut-us-085941613.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) — Morgan Stanley (MS) and Citigroup Inc. (C) slashed their estimates for 2025 earnings as companies kick off their first-quarter reports, joining a wave of Wall Street banks warning that tariffs will curb profit growth.\nMost Read from Bloomberg\nThe Secret Formula for Faster Trains\nNYC Tourist Helicopter Crashes in Hudson River, Killing Six\nEven Oslo Has an Air Quality Problem\nInside the Quiet, Extravagant Expansion of the Frick Collection\nLisbon Mayor Wants Companies to Help Fix City’s Housing Shortage\nCiti’s head of US equity strategy, Scott Chronert lowered his 2025 prediction for the S&P 500 to 5,800 from 6,500, predicated on earnings of $255 a share for companies in the index, down from a previous $270 projection. At Morgan Stanley, Mike Wilson cut his 2025 earnings-per-share forecast to $257 from $271.\n“The 90-day pause on reciprocal tariffs and further concessions over the weekend lessen the near-term probability of a recession, but uncertainty remains high,” said Wilson, who sees the S&P 500 trading in a range from 5,000-5,500. The index finished last week at 5,363.36.\nThe S&P 500 (^GSPC) has fallen 8.8% this year on concern that investors increasingly are shifting away from US assets. The selloff was worsened by Donald Trump’s “reciprocal” tariffs policy and the tit-for-tat spat with China. Investors are rushing to game out how the effective freezing of Chinese trade will impact companies and growth.\nMorgan Stanley’s Wilson warned that the S&P 500 could slump back below 5,000 and retest last week’s lows if 10-year Treasuries yields surge above 5% from the current 4.46%. A larger trade deal with China that significantly reduces tariffs still in place would cause significant upside, he said.\nRead: ‘No Place to Hide’ as Stress Spreads Across Assets: Taking Stock\nThe first signs of a slowdown in global trade are already emerging as companies around the world hit their own pause button on orders. If anything, Trump is extending the uncertainty that has already begun to drag on business and consumer sentiment.\n“No doubt, the goldilocks sentiment in place entering this year has given way to abject uncertainty,” Chronert wrote in a note. “This is for good reason as the Trump administration’s announced tariff approach is set to disrupt” a global trade system that has developed since China entered the World Trade Organization in 2001.\nCompanies’ attempts to pass through tariff-driven price increases threaten the US consumers’ incomes, who’s spending power has already been sapped by post-pandemic inflation.\nWhile a recession is not their base case, the probability for a mild one remains high, according to Chronert and Wilson.\nSome impacts are already visible. Delta Air Lines Inc. withdrew its full-year financial guidance due to uncertainty surrounding global trade last week.\nIn a difficult environment, Wilson recommends looking for opportunities in industries where prices already reflect the risks, including transports, materials, semiconductors, autos and pharma/biotech as well as hardware, while leaning towards bearish bets in areas such as consumer discretionary and staples stocks.\n—With assistance from Michael Msika.\nMost Read from Bloomberg Businessweek\nThe Beauty Salon Recession Indicator\nTrump Is Firing the Wrong People, on Purpose\nWorld Travelers Are Rethinking Vacation Plans to the US\nHow One MBA Grad Blew the Whistle on a $2 Billion Deal\nCheap Consumer Goods Are the American Dream, Actually\n©2025 Bloomberg L.P.\nBy subscribing, you are agreeing to Yahoo's \n                        \n                            Terms\n                        \n                     and \n                        \n                            Privacy Policy\n                        \n\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nMcDonald's (MCD) concluded the recent trading session at $312.48, signifying a -1.14% move from its prior day's close.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 12-00_United Airlines (UAL) Q1 Earnings_ What To Expect",
    "date": "",
    "content": "Title: United Airlines (UAL) Q1 Earnings_ What To Expect\nDate: 2025-04-14 12:00\nURL: https://finance.yahoo.com/news/united-airlines-ual-q1-earnings-120057694.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAirline company United Airlines Holdings (NASDAQ:UAL) will be reporting results tomorrow after market close. Here’s what you need to know.\nUnited Airlines beat analysts’ revenue expectations by 2.1% last quarter, reporting revenues of $14.7 billion, up 7.8% year on year. It was a strong quarter for the company, with a decent beat of analysts’ adjusted operating income and EPS estimates. It reported 64.46 billion revenue passenger miles, up 6.3% year on year.\nIs United Airlines a buy or sell going into earnings? Read our full analysis here, it’s free.\nThis quarter, analysts are expecting United Airlines’s revenue to grow 4.7% year on year to $13.13 billion, slowing from the 9.7% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $0.74 per share.\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. United Airlines has missed Wall Street’s revenue estimates twice over the last two years.\nLooking at United Airlines’s peers in the consumer discretionary segment, some have already reported their Q1 results, giving us a hint as to what we can expect. Carnival delivered year-on-year revenue growth of 7.5%, beating analysts’ expectations by 0.9%, and Delta Air Lines reported revenues up 2.1%, topping estimates by 1.1%. Carnival traded up 1.1% following the results while Delta Air Lines was also up 9.6%.\nRead our full analysis of Carnival’s results here and Delta Air Lines’s results here.\n\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nUnited Airlines offered two sets of profit guidance Tuesday depending on whether the U.S. enters a recession or not. \"The company's outlook is dependent on the macro environment which the company believes is impossible to predict this year with any degree of confidence,\" United said in an investor update.\n(Reuters) -Caterpillar said on Tuesday that Chief Operating Officer Joe Creed would succeed Jim Umpleby as CEO, tapping an insider to help the construction equipment maker navigate the fallout of President Donald Trump's sweeping tariffs.  Umpleby, a veteran who has been with the company for more than four decades, held the top job for the last eight years and guided the firm through a demand and supply chain downturn brought on by the COVID-19 pandemic.  Umpleby, who will transition to executive chairman, will hand over the reins on May 1 to 49-year-old Joseph Creed, a 28-year veteran with extensive leadership experience at Caterpillar.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 15-46_Airline Stock Roundup_ DAL's Q1 Earnings Report & JBLU, VLRS in Focus",
    "date": "",
    "content": "Title: Airline Stock Roundup_ DAL's Q1 Earnings Report & JBLU, VLRS in Focus\nDate: 2025-04-14 15:46\nURL: https://finance.yahoo.com/news/airline-stock-roundup-dals-q1-154600471.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOn April 9, Delta Air Lines DAL reported better-than-expected revenues and earnings per share for the first quarter of 2025 despite the tariff-induced uncertainty. Given the current uncertain scenario, DAL decided against reaffirming its 2025 financial guidance.\nJetBlue Airways JBLU was also in the news due to its decision to add two nonstop routes to expand its service at Fort Lauderdale. Mexican carrier Controladora Vuela Compañía de Aviación VLRS or Volaris reported a year-over-year increase in revenue passenger miles (RPMs: a measure of air traffic) for March.\nDriven by the increase in international operations, Latin American carrier LATAM Airlines Group LTM reported a year-over-year increase in revenue passenger-kilometers (RPK: a measure of air traffic) for March. Alaska Airlines, a wholly owned subsidiary of Alaska Air Group ALK, was also in the news due to its decision to invest in Loft Dynamics, a company specializing in virtual flight training. Through this move, Alaska Air aims to revolutionize pilot training.\nRead the last Airline Roundup here.\n1.  Delta reported first-quarter 2025 earnings (excluding 9 cents from non-recurring items) of 46 cents per share, which surpassed the Zacks Consensus Estimate of 40 cents. Earnings increased 2.2% on a year-over-year basis due to low fuel costs. Revenues in the March-end quarter were $14.04 billion, surpassing the Zacks Consensus Estimate of $13.81 billion and increasing 2.1% on a year-over-year basis. Adjusted operating revenues (excluding third-party refinery sales) increased 3.3% year over year to $13 billion.\nDelta expects second-quarter 2025 adjusted earnings per share in the $1.7-$2.3 range. The adjusted operating margin is expected in the 11-14% band. Revenues on an adjusted basis are expected to be down 2% to up 2% year over year.\nDAL currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n2. In response to customer demand, JetBlue has decided to resume service between Fort Lauderdale and Philadelphia and between Fort Lauderdale and Guayaquil, Ecuador, beginning this summer. Flights connecting Fort Lauderdale and Philadelphia will operate twice daily from July 3. Meanwhile, flights between Fort Lauderdale and Guayaquil will operate once a day from July 17. Flights on both routes will be operated by JetBlue’s Airbus A320 aircraft, equipped with all modern facilities.\nThese new routes build on JetBlue’s continued investment in South Florida, where the low-cost airline has increased departures by 6% year over year. The resumption of the two routes highlights JetBlue’s commitment to meeting customer demand and seizing strategic opportunities. These routes were paused during a broader network optimization.\n3. For March, Volaris reported a 10.9% year-over-year increase in consolidated capacity (measured in available seat miles). The load factor (% of seats filled by passengers) decreased 2.4 percentage points to 84.4% on a consolidated basis. The metric fell as the increase in consolidated traffic (7.8%) was less than the increase in consolidated capacity. During the month, Volaris transported 2.6 million passengers, up 12.3% year over year.\nOn the domestic front, revenue per mile (RPM) and available seat miles (ASMs) increased 9.9% and 13.3%, respectively, from March 2024 levels. The domestic load factor in March was 89.4%, a decrease of 2.8 percentage points from year-ago levels. In international markets, RPM increased 4.6% year over year, while ASM rose 7.6% year over year.\n4. For March, LATAM Airlines reported a 7.2% year-over-year increase in consolidated capacity, measured in available seat kilometers. LTM’s revenue passenger kilometers increased 5.6% year over year despite the impact of the carnival holidays on Brazil’s domestic segment. The carnival took place in the month of March in 2025, whereas it was celebrated in February in 2024, affecting year-over-year comparability. Although traffic improved on a year-over-year basis, it failed to outpace capacity expansion. As a result, the load factor (percentage of seats filled by passengers) fell to 81.9% from 83.9% a year ago.\n5. In a bid to revolutionize pilot training by leveraging extended reality technology, Alaska Air took a stake in Loft Dynamics, which is headquartered in Zürich, Switzerland, with an office in Santa Monica, CA. Through this investment, made through Alaska Star Ventures, ALK intends to develop the first hyper-realistic, full-motion Boeing 737 virtual reality simulator.\nThe following table shows the price movement of the major airline players over the past week and during the last six months.\nImage Source: Zacks Investment Research\nThe NYSE ARCA Airline Index increased by 2.6% to $59.58 as most airline stocks traded in the green over the past week. The upside followed President Donald Trump's announcement that he would pause the reciprocal import taxes for 90 days. Over the past six months, the NYSE ARCA Airline Index has decreased 16.5%.\nAmid the tariff-induced uncertainties, first-quarter 2025 earnings reports of many airlines are expected in the coming days. For example, Alaska Air is scheduled to report quarterly results on April 23. While its top line is likely to have been hurt by the slowdown in domestic air travel demand, the bottom line is expected to have been boosted by reduced fuel costs.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nDelta Air Lines, Inc. (DAL) : Free Stock Analysis Report\nJetBlue Airways Corporation (JBLU) : Free Stock Analysis Report\nAlaska Air Group, Inc. (ALK) : Free Stock Analysis Report\nLATAM Airlines Group S.A. (LTM) : Free Stock Analysis Report\nControladora Vuela Compania de Aviacion, S.A.B. de C.V. (VLRS) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nWe recently published a list of Top 10 Restaurant Stocks to Buy Under $20. In this article, we are going to take a look at where Arcos Dorados Holdings Inc. (NYSE:ARCO) stands against other top restaurant stocks to buy under $20. The Impact of Trump’s Tariffs on the Restaurant Industry Restaurant stocks are showing volatility […]\nHere at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nWhy investors should use the Zacks Earnings ESP tool to help find stocks that are poised to top quarterly earnings estimates.\nMcDonald's (MCD) concluded the recent trading session at $312.48, signifying a -1.14% move from its prior day's close.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 21-45_Hyatt, Hilton, and Marriott Stocks Downgraded by Goldman Sachs on Weaker Hotel Outlook",
    "date": "",
    "content": "Title: Hyatt, Hilton, and Marriott Stocks Downgraded by Goldman Sachs on Weaker Hotel Outlook\nDate: 2025-04-14 21:45\nURL: https://www.investopedia.com/hyatt-hilton-and-marriott-stocks-downgraded-by-goldman-sachs-on-weaker-hotel-outlook-11715106?.tsrc=rss\nContent:\nJoe Raedle / Getty Images\n Goldman Sachs lowered its outlook for U.S. hotels Monday, pointing to lagging consumer demand, growing economic uncertainty, and troubling signals from the airline industry.\n\n The bank said it now expects U.S. hotels' average revenue per available room, or RevPAR, to grow 0.4% in 2025, down from its prior estimate of 1.4%.1 As a result, Goldman analysts dropped their rating for Hyatt Hotels (H) stock to “sell,\" and downgraded Marriott International (MAR) and Hilton Worldwide (HLT) to “neutral.” \n\n The updated forecast does not account for a recession, Goldman said, which “would likely drive further downside.\" The bank currently places the odds of a recession at 45%, noting that past economic downturns have brought double-digit declines in RevPAR.\n\n Shares of Hyatt dropped 3% Monday, while Marriott and Hilton fell about 1%, amid broader market gains. (Read Investopedia's live coverage of today's market action here.)\n\n In March, three of the largest U.S. airlines—Delta Air Lines (DAL), Southwest Airlines (LUV), and American Airlines (AAL)—had dropped projections for the first quarter of the year, citing weakening travel demand amid worries about the economy.\n\n Delta CEO Ed Bastian said last week that people are “acting as if we're going [into] a recession,” and the airline withdrew its full-year guidance.\n\n The demand warning from airlines hit travel stocks across the booking industry, including hotels and cruise lines. Shares of Hilton, Marriott, and Hyatt have all lost about a fifth of their value since the beginning of March.\n\nGoldman Sachs. \"Americas Lodging. Where to invest in Lodging amidst macro uncertainty; CHH to Buy, H to Sell, MAR and HLT to Neutral.\""
  },
  {
    "title": "2025-04-15 10-11_China blocks Boeing deliveries in retaliation to Trump tariffs",
    "date": "",
    "content": "Title: China blocks Boeing deliveries in retaliation to Trump tariffs\nDate: 2025-04-15 10:11\nURL: https://uk.finance.yahoo.com/news/china-blocks-boeing-deliveries-retaliation-101109491.html?.tsrc=rss\nContent:\nWe, Yahoo, are part of the Yahoo family of brandsThe sites and apps that we own and operate, including Yahoo and AOL, and our digital advertising service, Yahoo Advertising.Yahoo family of brands.\n\n    If you do not want us and our partners to use cookies and personal data for these additional purposes, click 'Reject all'.\n\n    If you would like to customise your choices, click 'Manage privacy settings'.\n\n    You can withdraw your consent or change your choices at any time by clicking on the 'Privacy & cookie settings' or 'Privacy dashboard' links on our sites and apps. Find out more about how we use your personal data in our privacy policy and cookie policy."
  },
  {
    "title": "2025-04-15 14-03_UPS hires Delta Air Lines to maintain Boeing 757 engines",
    "date": "",
    "content": "Title: UPS hires Delta Air Lines to maintain Boeing 757 engines\nDate: 2025-04-15 14:03\nURL: https://finance.yahoo.com/news/ups-hires-delta-air-lines-140355667.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nDelta Air Lines’ technical operations division will provide engine maintenance support to UPS Airlines for its fleet of Boeing 757-200 converted freighters.\nDelta TechOps announced on LinkedIn last week that it has signed a 10-year contract with UPS (NYSE: UPS) to service Pratt & Whitney PW2037 engines on UPS’ entire 757 fleet. Delta CEO Ed Bastian also disclosed the agreement during Delta’s first quarter-earnings briefing.\n“This is an exciting one for our MRO team and supports long-term revenue diversification and growth,” Bastian said. Both companies are headquartered in Atlanta.\nUPS operates 75 Boeing 757 freighters, according to a fact sheet on its website.\n\nDelta Air Lines (NYSE: DAL) is one of the largest maintenance, repair and overhaul (MRO) providers in North America. Other major airlines with their own maintenance units include American and Lufthansa. The companies inspect and maintain their own aircraft, and make extra money from outside customers.\nLast week, Pratt & Whitney announced an agreement to expand annual overhaul capacity by 30% for geared turbofan engines at Delta TechOps’ Atlanta facility over the next decade. The GTF engine is a newer type mostly used to power the Airbus A220 and A320 neo family of aircraft. The extra infrastructure will enable Delta to overhaul up to 450 of the engines per year.\nDelta makes money from noncore businesses like TechOps and its jet fuel refinery near Philadelphia.\nClick here for more FreightWaves/American Shipper stories by Eric Kulisch.\n\nHow did Delta Air Lines awaken 570 dormant aircraft?\nDelta makes mobile hospital pods to transport troops with COVID-19\nThe post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nThe bank plans to open additional centres in major cities such as Guangzhou, Nanjing, Qingdao, and Dalian by the end of this year.\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply.  ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nFrench-Italian carmaker Stellantis has reduced its shortlist of CEO candidates to five, said two people familiar with the matter, as it nears a decision on who will lead the company through one of the industry's most tumultuous periods.  Investors are likely to seek an update on the hiring process as well as further insight into how Stellantis will manage President Donald Trump's 25% tariffs on foreign auto imports at an annual general meeting in Amsterdam later on Tuesday.  Former CEO Carlos Tavares abruptly departed the company - maker of Jeep and Peugeot brand cars - in December following a dramatic plunge in sales and profit.\nMcDonald's (MCD) concluded the recent trading session at $312.48, signifying a -1.14% move from its prior day's close.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nThese 10 stocks performed the best over the past 10 years.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 14-51_Travel Stocks Are No Ticket to Paradise",
    "date": "",
    "content": "Title: Travel Stocks Are No Ticket to Paradise\nDate: 2025-04-15 14:51\nURL: https://finance.yahoo.com/m/ea0e9fcf-196f-32e6-b9c5-4b32ec93b2ae/travel-stocks-are-no-ticket.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOverseas visitor numbers fell by 11.6%, with European arrivals dropping sharply. ✈️ The picture has darkened close enough to the quarterly “quiet period” that many travel-related companies have yet to quantify the impact, but airlines Delta and Frontier pulled financial guidance.\nTwo banks recently issued bullish notes on Netflix (NFLX), Schwab Network reported. Meanwhile, the company is seeking to raise its market capitalization to $1 trillion by 2030, according to The Wall Street Journal. Bank of America and Evercore ISI Are Upbeat on NFLX Netflix has “a strong subscription model with critical entertainment,” Bank of America […]\nChipotle's focus on customer experience, digital investment and supplier diversification should support a sustainable recovery over time.\nIs McDonald's strong growth strategy enough to overcome near-term challenges? Let us take a closer look.\nBoise, Idaho-based grocer focuses on digital sales, warehouse automation, pharmacy in 2025\nAmerican Airlines said Tuesday that it will introduce free Wi-Fi for its \"AAdvantage\" rewards members starting in January 2026.\nMcDonald's (MCD) concluded the recent trading session at $312.48, signifying a -1.14% move from its prior day's close.\nRecently, Zacks.com users have been paying close attention to Caterpillar (CAT). This makes it worthwhile to examine what the stock has in store.\nUPS has selected Delta Airlines to maintain engines for its fleet of Boeing 757 freighters. The post UPS hires Delta Air Lines to maintain Boeing 757 engines appeared first on FreightWaves.\nSunrun (RUN) closed the most recent trading day at $6.71, moving -1.61% from the previous trading session.\nRoyal Caribbean continues to demonstrate strong underlying business momentum, supported by record bookings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 15-06_American Airlines to Launch Free Wi-Fi for Rewards Members in 2026",
    "date": "",
    "content": "Title: American Airlines to Launch Free Wi-Fi for Rewards Members in 2026\nDate: 2025-04-15 15:06\nURL: https://www.investopedia.com/american-airlines-to-launch-free-wifi-for-rewards-members-in-2026-11715316?.tsrc=rss\nContent:\nKevin Carter / Getty Images\n American Airlines (AAL) said Tuesday that it will introduce free Wi-Fi on flights for its \"AAdvantage\" rewards members starting in January 2026.1\n\n The airline is partnering with AT&T (T) to introduce the service, which it says will be available \"on all aircraft equipped with Viasat and Intelsat high-speed satellite connectivity, accounting for roughly 90% of its fleet.\" American said it recently conducted a test on select flight routes, which surpassed its own expectations.\n\n Chief Customer Officer Heather Garboden said the company has been \"working diligently to outfit our aircraft\" with the necessary technology.\n\n Last month, rival United Airlines (UAL)—which is set to report its latest quarterly earnings after the bell Tuesday—won government approval to launch its first commercial flight with free Starlink satellite internet service in May.2 United had signed a deal with Starlink, a division of Elon Musk's SpaceX, last September to bring satellite internet to its more than 1,000 planes over the next several years.\n\n Delta Air Lines (DAL), which already has free Wi-Fi on most domestic flights for loyalty members, announced earlier this month that it would be expanding its service to Europe, Israel and West Africa through its partnership with T-Mobile (TMUS).3\n\n American Airlines shares were up 3% in Tuesday morning trading but are still down nearly 40% year-to-date.\n\nAmerican Airlines. \"Connecting the world: American Airlines to provide complimentary inflight Wi-Fi, sponsored by AT&T.\"\nPR Newswire. “United Receives FAA Certification on Starlink Aircraft and Schedules First Commercial Flight for May 2025.”\nDelta Air Lines. \"Keeping you connected: Fast, free Wi-Fi now on most transatlantic routes; coming to regional jets.\""
  },
  {
    "title": "2025-04-16 14-00_These Were the 2 Worst-Performing Stocks in the S&P 500 in March 2025",
    "date": "",
    "content": "Title: These Were the 2 Worst-Performing Stocks in the S&P 500 in March 2025\nDate: 2025-04-16 14:00\nURL: https://www.fool.com/investing/2025/04/16/these-were-the-2-worst-performing-stocks-in-sp-500/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=c746d076-12a3-4cac-b269-c99e4416b4ef&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nMarch wasn't the best month for the S&P 500, with the index dropping 5.8%. It was a tough month all around, as 98 of the S&P 500 stocks finished the month down at least 10%, but two especially had a bad month: Delta Air Lines (DAL -0.47%) and United Airlines (UAL -0.01%). Delta and United were the S&P 500's worst-performing stocks in March, falling 27.5% and 26.4%, respectively.\n\n^SPX data by YCharts\nBroader economic uncertainty took its toll on both companies, but there were also industry-specific problems that caused the stock price drops. Delta lowered its revenue growth guidance from 6%-8% down to 5% (at the higher end). It also cut its earnings-per-share (EPS) guidance from $0.70 to $1 down to $0.30 to $0.50.\nUnited also lowered its guidance as it projects its revenue will take a hit. It noted a slowdown in corporate and government travel, especially as the federal government focuses on reducing its spending. United says government-related booking decreased by half.\nAs new tariff plans go into effect and concerns about inflation and a potential recession ramp up, both companies could face some near-term troubles as consumers, companies, and governments cut back on travel. It will take time to see how it all plays out, but investors should expect volatility to continue along with potential drops.\nAs of market closing on April 11, Delta's and United's stocks are down 30.8% and 31.3% for the year, respectively.\n\n \n\nBefore you buy stock in Delta Air Lines, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Delta Air Lines wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nStefon Walters has no position in any of the stocks mentioned. The Motley Fool recommends Delta Air Lines. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 14-19_Tariffs, Trump, and Turmoil",
    "date": "",
    "content": "Title: Tariffs, Trump, and Turmoil\nDate: 2025-04-16 14:19\nURL: https://www.fool.com/investing/2025/04/16/tariffs-trump-and-turmoil/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=5faa735d-67a5-4895-a54f-4501251b9aeb&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nIn this podcast, Motley Fool analysts talk about economic uncertainty, airlines, building materials, and assorted spirits.\nMotley Fool analyst Asit Sharma caught up with Martín de los Santos, the CFO of MercadoLibre, at The Motley Fool's Market Volatility Summit. They talked about how MercadoLibre became resilient, and the long-term opportunities for the company.\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\nA full transcript is below.\nThis is a modal window.\nBeginning of dialog window. Escape will cancel and close the window.\nEnd of dialog window.\nThis is a modal window. This modal can be closed by pressing the Escape key or activating the close button.\nThis video was recorded on April 11, 2025\nRon Gross: T is for tariffs, Trump and Turmoil. Motley Fool money starts now.\nFrom fool Global headquarters. This is Motley Fool Money. It's the Motley Fool Money Radio Show. I'm Ron Gross sitting in for Dylan Lewis. Joining me today, our senior analyst, Emily Flippen and Matt Argersinger fools, how you doing?\nMatt Argersinger: Ron.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nEmily Flippen: Doing all right.\nMatt Argersinger: Doing all right.\nRon Gross: Glad to hear it. Today, we're going to talk banks and assorted spirits, but we must, once again, begin with the big macro and, oh, boy, what a week it has been following several very rough days in the stock market, on Wednesday, the Trump administration put a 90-day pause on its so-called reciprocal tariff policy, sending the market soaring for its biggest one day gain since 2008. Then, on Thursday, inflation data came in tamer than expected and just for good measure, on Thursday, we saw another sell-off in stocks. Emily, I am truly exhausted. But let's dig in. Where are we now from an economic markets perspective? I know you don't have a crystal ball, but where do you think we're going?\nEmily Flippen: If financial media has anything to say about it, it's straight to hell on a handbasket here for American consumers and investors. I'm teasing here because I really don't necessarily think that is going to be the case. While we still have a lot of economic data that is not coming out as favorably as I think some investors want, and that's leading to some of that volatility we're seeing in the market, the earlier inflation metrics that we got earlier this week, we're actually very encouraging. It was a sign that some of the concerns that I think we had around stagflation may be coming down a bit. Now, that is the core PPI, the producer price index that excludes food and energy, but it's the Fed's favored inflation metric here. That actually fell nominally month over month.\nAnd it wasn't just a matter of, Okay, this is lower than expected, but still rising inflation, but an actual month-over-month decline here. Of course, if we add food and energy, the story changes. But this is a little bit of a silver lining that I think investors need to say, OK, we have a lot of data that's pointing in the wrong direction right now. Here is something that continues to say, it may not be as bad as we expect. But of course, the emphasis is, of course, on this was the case. Inflation metrics are a lagging indicator. We're always forward-looking. Some of the policies that we've seen since this data has come out over the course of the past month, I think, are pretty clearly indicating that inflation is expected to heat up substantially. But I'll take this when for this week.\nRon Gross: What about from the markets? Do you think the markets are just nervous, don't like uncertainty? That's what we typically say. Markets hate uncertainty, and there's so much uncertainty around here nowadays. Do you think that's why we're seeing the volatile the big sharp moves?\nEmily Flippen: I don't think it's just uncertainty. I think there's genuine concern about the business impacts that these tariffs, if they stay in place, will have both on companies that are supplying, manufacturing, as well as consumers looking to make purchases. This has wide-ranging implications for the performance of the broader economy as a whole. It's not just a matter of uncertainty because I think if we came out tomorrow and said, Okay, we are certain, 100% sure. The tariffs, as they are today, are going to stick this way for the next 12 months for certain, for example. That would be certainty. But I'll tell you what, I bet the stock market would sell off.\nRon Gross: Oh. Understood. Matt, US consumer sentiment is now worse than during the Great Recession. New data just came out. Anything here for an individual investor to do other than sit back and just watch it unfold?\nMatt Argersinger: Sitting back is very good advice. Watching it unfold, I don't know. You're better off just turning everything off and maybe going away for a week. But look, we're investors. I know that's impossible. It's definitely impossible for me. But here's what I think if you're an investor, what you can or should pay attention to, and that is interest rates. The Trump administration only really blinked this past week when the 10 yield crossed about 4.5%. But guess where we are today as we tape on Friday, back above 4.5%, Ron. If you go back to April 2nd, which was Liberation Day, as the administration called it, the 10-year was just above 4%. We're up 50 basis points in a week, and that's through all this market dislocation. It usually doesn't work that way. Usually, investors are buying treasuries as a safe haven during times like this. That's just not happening right now and I think that is where the real danger lies, and I think Emily hinted at this.\nI mean, if countries like China and, Japan UK, various members of the EU stop buying our treasuries, either because they're exporting less as a result of these tariffs, and they don't have as many US dollars to invest anyway, or much worse, guys, they willfully decide to stop buying treasuries in favor of other safe-haven assets or currencies. I mean, just look at the Swiss franc as of the past week. If that happens, it will almost certainly send treasury yields much higher. And I think that would spell huge trouble for the housing market, which we already know is suffering from high mortgage rates. Imagine mortgage rates not at six or 7% as they are now, but 8, 9, 10%. I think it also spells big trouble for small, midsize businesses who don't have as much flexibility with their balance sheets and where they source their products. It's bad for auto manufacturers, bad for commercial real estate and then to consumers to Emily's point. Consumers are sitting on record credit card debt and if interest rates move higher that situation gets a lot worse. I think it really could mean bad news for the economy. If you're going to watch anything at all, sit back and watch this shake out, watch treasury yields. If they keep moving higher, I expect that could trigger a response by the administration. To be less aggressive with these tariffs, maybe come to the table, that'll be the trigger point.\nRon Gross: I was going to say one silver lining may be we do have anecdotal evidence that the administration does keep an eye on the bond market, and on interest rates, that could very well be the reason we got the 90 day pause. We don't necessarily have proof of that, but that certainly could be. I would encourage them to keep an eye on the yields, so we don't get into too much trouble, as you outlined. But speaking of interest rates, on Friday, many of the larger banks reported pretty solid results for the first quarter, and Matt, lots of data, plenty of commentary from the CEOs. What's set out to you in these reports?\nMatt Argersinger: Results you said, Ron, the results were actually really solid. The problem is no one really cares about that right now. It's really all about guidance and how these CEOs are thinking about the environment, post tariffs, post-liberation Day and what they see going forward. Here's what they're saying. If you look at CEO Jamie Diamond, CEO of the largest US bank, JP Morgan, he's been pretty vocal this past week about the dangers of tariffs, even saying he believes that a recession is all but unavoidable now. And then he said this after his bank reported quarter results, \"The economy is facing considerable turbulence, potential negatives of tariffs and trade wars,\" ongoing sticking inflation, high fiscal deficits, and still rather high asset prices and volatilities.\nWhat else he said? Wells Fargo's CEO, Charlie Sharf, \"We support the administration's willingness to look at barriers to fair trade to the United States. Though there are certainly risks associated with such significant actions, a timely resolution, which benefits the US, would be good for businesses, consumers, and the markets. We expect continued volatility and uncertainty and are prepared for a slower economic environment in 2025\" Then Larry Fink, CEO of Blackrock, which I think is now the world's largest ass manager, \"The sweeping tariff announcements went further than I could have imagined in my 49 years in finance.\" Then in an interview on CNBC, he also said, \"I think we're very close if not in a recession now,\" talking about, of course, the US economy.\nRon Gross: Thanks for cheering us up, Matt.\nMatt Argersinger: Well, there you go. Let me sum it up, too. These tarifs are dangerous. If not resolved quickly, the risks are high, expect continued uncertainty, which we keep talking about, and we may already be in a recession. Remember, these are the banks and financial institutions that have a pulse, I think, in a lot of areas of the economy, which is from housing to credit, consumer spending. Wait until we start hearing from industrial companies or consumer discretionary companies, especially those that make and sell products all around the world. What will be their reactions and guidance when they report in the coming weeks? I think this is just the first Salvo, and it's sobering when you look at it, in terms of what they're seeing.\nRon Gross: On Wednesday, Constellation Brands reported fourth-quarter results that beat expectations, but a week full-year earnings outlook that focused on the impact of, yes, tariffs was the focus. Emily, how did the quarter look to you? Is it possible for us to remove tariffs from this conversation and focus on the business, or they are so intertwined, just can't do that.\nEmily Flippen: I actually think that tariffs are maybe the least interesting thing happening to Constellation Brands business today. I understand why the narrative was around tariffs. It's like you can open up an Internet browser without being slapped across the face with news about tariffs and how they're going to be impacting companies. Certainly, Constellation Brands did say in the quarter that they're expecting a low single-digit increase in their total cost of goods that's associated with the tariffs and sourcing, of course, aluminum cans and other bottling items for the beers and the accessories, I'll say, for the wine and spirits business that they sell. But all of this stuff is happening to Constellation Brands. Meanwhile, Constellation Brands as a business itself, is actually doing a pretty decent job of a turnaround, especially considering the overall beer market. I think it's a disappointment that there's not more discussion around how strong this business has been in an incredibly weak environment for alcohol sales.\nIf you compare their performance against other large beer makers, Boston Beer, with Sam Adams being a great example, which has seen declining depletions, declining shipments, declining profitability and sales, Constellation Brands is growing and growing pretty solidly because the beer brands that it is continuing to focus on just have continued to resonate with a consumer that's a little bit more niche, that is a bit more loyal, and that has led to pretty incredible market share gains really consistently for this company in otherwise weak environment. I love that Constellation Brands has performed so well. I'm disappointed that the narrative is, Oh, no, that small single-digit increase associated with the tariffs. But I actually think fast forwarding five years from now, we're probably looking at a better business than today.\nRon Gross: They're selling some of their wine brands, Cooks, Miomi, that a good movie? You like that?\nEmily Flippen: I do. They're actually almost entirely divesting of their wine and spirits business. And if you look at their performance on earnings per share, non-adjusted basis for the quarter, you'll see the impact of that nearly $3 billion in goodwill write-offs associated with the sale of that business, which has been an underperformer for them for a while. That is obviously a ding on them. Some of the investments this company has made historically just haven't panned out. But they're really focusing on cost energies right now and focusing on what works, which is obviously the Corona, the Medello, the Pacificos. Those have an audience that are way more loyal than not to be offensive to Miomi, which I love their wine is a bit more loyal.\nRon Gross: Coming up, we'll talk airlines, building materials, and used cars. You're listening to Motley Fool Money.\n...\nRon Gross: Welcome back to Motley Fool Money. I'm Ron Gross here with Emily Flippen and Matt Argersinger. On Wednesday, Delta reported that revenue growth stalled a bit in the first quarter and the company did not reaffirm its full year guidance, citing headwinds from the economic uncertainty around global trade. Matt, seems to me it wasn't the quarterly results, but the lack of full year guidance that spooked investors. Shares were up big on Wednesday as Trump paused tariffs, but the stock got smacked on Thursday as investors continued to digest what it all means. As I asked Emily with constellation, I'd love to strip out the economic noise here and talk about the business. Can we do that?\nMatt Argersinger: Well, let's try, Ron. It was actually a record quarter for Delta in terms of revenue. Pretty surprising, revenue was up 3.3% year over year, 13 billion, and growth was particularly strong in the premium segment of the business. So first class, business class, revenue there was up 7% year over year. International revenue was also pretty strong, and even corporate revenue was higher year over year, and Delta generated 1.3 billion in free cash flow in the quarter, paid down about 500 million in long term debt. All fairly positive and aligned with what CEO Ed Bastian said near the beginning of the year, which was that 2025 was going to be Delta's best financial year in our history. That is not really working out.\nRon Gross: Maybe not so much.\nMatt Argersinger: Because even if you go back a month ago, Delta had actually guided for 6-8% revenue growth this quarter. That's a big comedown from that. According to Bastion, things actually started to slow back in February. Well, before these tariff announcements or any hint of them, the company slashed its first quarter forecast. It did maintain its full year outlook back then, though. As you mentioned, Ron, that has now changed. They're not reaffirming that year outlook anymore. The company has pulled its guidance. It's still expecting to be profitable this year, but a far cry from where the company thought things would be coming into the year. I think you have to worry a lot about the state of the consumer here. What travel demand is going to look like, say, over the next 6-9 months, you mentioned the consumer sentiment numbers at the top of the show. One thing that's got to be helping Delta a little bit, though, over the past week is the fall in energy prices that we've seen. It's a big cost input for every airline including Delta. That will undoubtedly help Delta's margins and probably help the company remain profitable for the year if not growing.\nRon Gross: On Thursday, CarMax reported worse than expected fourth quarter results, and while it said it was making progress toward its financial goals, it will remove the timelines associated with them due to the potential impact of broader macro factors. Emily, I know I sound like a broken record here, but the macro environment is hard to escape. Do your best. Tell me how CarMax's business is doing.\nEmily Flippen: I actually think the business is doing a lot better than people expect, especially, again, given the narrative right now. I understand that the market is in part selling off CarMax for a few different factors. Of course, one aspect of the tariff implication for CarMax and any other business that is operating in the auto parts industry is that the used car parts that it needs in order to fix and resell vehicles on its platform, those are likely to increase, and that's likely to hurt margins at least in that narrow perspective. There's also an element of, Okay, used car prices are likely to increase with the tariffs as well, and that could hurt demand for used cars.\nThat could certainly pride some people out of market, and management was so uncertain of this environment that they did pull that guidance for vehicle sales, which is concerning to investors adding to the uncertainty. You can make the logical argument there for the interim of like, Okay, I understand what's happening here to CarMax. But I actually think that a little bit longer term, taking it one step further, we're likely to see similarly to what we saw during the pandemic that used car prices are likely to go up and that could price some people out of the market. But it's actually a boon for a lot of leaders in this space like CarMax, when the prices of used cars go up, especially in comparison to something like a new vehicle 'cause a new vehicles will also increase making used cars look relatively more attractive for consumers who can make a purchase plus higher cost means higher fees for CarMax. All of that is to say, I actually think they could make up some of the margin here, and the future may not be as negative for CarMax as some investors are pricing in today.\nRon Gross: All things considered, does CarMax go on your radar or you still go away?\nEmily Flippen: If I had a radar stock this month that I thought was an attractive value that I could make a 22nd, 32nd pitch for it, CarMax would certainly be up there. Digging into it this morning and in preparation for our show here, it reminded me this is an incredibly strong, profitable company, market share leader with a lot of tailwinds if you're willing to hold and overlook some of the near term uncertainty.\nRon Gross: Sounds good. On Tuesday, RPM International reported fiscal third quarter results that came in weaker than expected, and the maker of Deglo and Rustleum blamed unfavorable weather conditions and said that sales would be flat in the fourth quarter. Matt, RPM does a lot of business overseas, so it's got the trade situation plus the weather to contend with. How the quarter look to you, and does it tell us anything about industrial activity in general?\nMatt Argersinger: Well, lots of headwinds for RPM and lots of headwinds in general for industrial activity, even coming into this quarter and all the tariff news. Really two big challenges for them. They had record results last year in last year's fiscal third quarter, so comparisons are tough. But weather was a big problem in the quarter. If you don't know RPM, they serve primarily in the construction industry, and in much of the country, you had a fairly lengthy winter and then a lot of unusual storm activity in the south and the West, which really affected them. Slow housing market also continues to have an impact. That's been a story for a few years now. Until that picks up, RPM's consumer business is really going to struggle. Sales were down 3% overall. Pre tax operating profits, this is a business with high operating leverage we're down around 30%. With regard to tariffs, though, the good news for RPM is that they tend to be fairly insulated. For the most part, the company manufactures products in the countries or regions where it sells them. They do small amount of cross border activity. It sounds like a situation for RPM, where sales may be slightly down for the year with lower margins, but here is something, Ron, you and Emily can be excited about. RPM is acquiring the pink stuff.\nRon Gross: The pink.\nMatt Argersinger: Which I'm sure, if you've ever done an industrial cleaning of a bathroom, you've definitely use or at least should use. So the pink stuff joins other cleaning products within RPM's portfolio, including Crud Cutter, Mean Green, and Contobum, if I'm pronouncing that correctly. That guy sounds like the 1927 Yankees when it comes to cleaning portfolio lineup.\nRon Gross: I love it. Alright, fools. We'll see you a little bit later in the show. Up next, an interview with Martin de los Santos. He's the CFO of Mercado Libre, E-commerce giant and the largest company in Latin America. You're listening to Motley Fool Money.\nWelcome back to Motley Fool Money. I'm Ron Gross. Molly Fool senior analyst Asit Sharma caught up with Martin de los Santos, the CFO of Mercado Libre, a few weeks ago at our Market Volatility Summit. In this clip, you'll hear how Mercado Libre became resilient in the long term opportunities for Meli. Motley Fool members can access the full interview and replays from the event at live.fool.com.\nAsit Sharma: Martin, I wanted to start. Just looking at this company in general, Mercado Libre has such a history of dealing with formidable challenges from hyperinflation and geopolitical events within Latin America to providing fintech and lending services to populations that often are new to the banking and credit systems. What makes Mercado Libre such a resilient business?\nMartin de los Santos: Yes, we were founded back in '99, and we turned 25 years in 2024. With those 25 years, as you can imagine, in Latin America, operating in 19 different countries, we've seen it all. Things going sour very rapidly. Maybe Mezuela as an example, hyperinflation in Argentina, then things coming back as we are seeing it today, Brazil, Mexico. I think we went through a lot during those years. I would highlight a couple of things. First, we operate in commerce and Fintech in a region where there's a lot to be done in those two fronts. Production of commerce continues to be very low compared to other places. We are riding a secular trend of people moving online. The same with Fintech, I think the banks have done a really poor job of including financially, most of the population in Latin America, so that generates an opportunity for us. That's one thing. I will also highlight the culture of the company.\nOur CEO, our chairman continues to be Marcos Galbrin, who was the founder of the company. Not only him, a lot of people were with him at the beginning continues to be with the company. We have a very strong culture of entrepreneurship, willingness to take risks. Many times in the history of our company, we have to reinvent ourselves or take big bets, and that's a big part of our success, a culture of excellence, execution, bringing good talent, teamwork internally while competing because we operating in very competitive markets to the outside. I think I would say that we operate in a region that has tremendous opportunities, both commerce and Fintech, and we also have a culture of executing and operating in Latin America that has helped us to be resilient and to be successful in this. Latin America, we came from being a start-up of five people in the garage 25 years ago to last year we became the most valuable company in Latin America, and we have done that I think by culture and execution and the quality of people that we brought into our team.\nAsit Sharma: I liked one thing that you mentioned between the culture and the execution, which is the ability to take a risk, to take those big bets. How are things different now that you sit in the chair of a CFO to make sure that the bets have a commensurate payoff for the risk and also maybe in some cases to be the person who's encouraging the company to take those risks?\nMartin de los Santos: It's not only my role. I think it's the role of the senior management team. We keep on thinking about the trade off between growth and profitability. In fact, we have a name for that within Meli we call it grow fit because we operating many different verticals have tremendous growth opportunities, but at the same time, they require investments. If you look at the history of the past five, six years, we improve significantly the profitability of our business. While at the same time, we continue to deliver very high growth in both in commerce, Fintech, advertising at the different verticals. However, when we look forward, we don't shy away from investing, even if in the short term, that might put some pressure on margins because the main thing for us is to make sure that we do capture those opportunities that we had ahead of us and not necessarily to maximize short term profits. We do have a long term perspective on the business, but that's a trade off that we do it all the time, deciding where to invest and sacrifice a little bit of margins to capture opportunities in the future, and the whole company and the whole senior management team is thinking in those terms. Then it does risk taking, I think it's the nature of our business.\nYou mentioned I used to run the credit business, which we started back in 2017. That's probably the ultimate one that you need to manage and to deal with risk, and we're very cautious in the way we manage that risk. But in other cases in the history of our company, maybe 15 years ago, we took a big bet on adapting our platform to mobile, and that required lot of risk and a mindset of really changing the way we were doing things. If we didn't do that, we wouldn't have a company today. Ten years ago, we started with logistics, which is critical for e-commerce solution. If you think about it ten years ago, we didn't touch one single package. Today, last year, we have 1.8 billion packages delivered through our own fulfillment infrastructure or logistic infrastructure. I think those type of beds that when you need to do when you need to take risk and make sure that you invest behind the long term growth opportunities, that's what differentiates mainly from other companies that might not be willing to take those risks.\nAsit Sharma: I wanted to ask you about some overall metrics that you use as you look at the business. I used to work for a company where while we had so many drill down metrics, the owner would come in every day, and he said, I just need one number to run this business. Now, that wasn't true. You need more than one number to run a business. But it taught me something that people like yourself often Kean on a few metrics almost on a daily basis. How do you gauge the health of Mercado Libre from day to day?\nMartin de los Santos: Yeah, we are a very data oriented company. Business reviews that are so deep in terms of analysis and data that is true. It's hard to keep up with all the businesses. It's very complex Mercado Libre today. So it's important to have some, big picture views, and then you can drill down whenever you see something that we want to go into more detail. Many different businesses, 19 different countries. You can imagine that the metrics are hundreds. But I would say that obviously, top line metric GMB on our commerce business is very important. Users, last year, I mentioned we have 100 million users, or 100 million buyers on our commerce platform. In terms of engagement, transactions per user is a metric that we follow very closely. That's on the commerce side. On the Fintech side, obviously number of users, 61 million monthly active users last quarter. TPV for the acquiring business, then credit book, asset and the mansion that has been growing more than 100% year and years, is a metric that is very important to see engagement with our platform and then frequency of use.\nIn Fintech is very important to have principality. We're seeing people who have engaged with more than one product and how often they engage with different products. That's something that we pay a lot of attention. Then the credit business, obviously, the traditional metrics, MPLs, the spreads of our books, the different books, and so on the repayment of our credit card, for instance, which is a product that you need to invest to build a cohort, I would say those. Obviously, financial metrics at the end of the quarter, at the end of each month are very important to see top line growth, as well as profit margins are the two ones, the two metrics that tells us how we are doing in terms of growth feed rate profitability, as well as growth.\nAsit Sharma: Strategically, where you sit, where are you focusing the organization to create the most value when we look out over a very long time horizon? Is there a specific activity or investment that's going to create the greatest yield as we look beyond, say, the medium term that you like to talk about within the management team and encourage employees to think about?\nMartin de los Santos: Very important to have an owner's mentality team. We operate. We are fortunate to operate in a platform in a company. That has, as we like to say, has more doors to be open, that has to open them. We have opportunities everywhere we see. In commerce, we're just getting started. Penetration is very low. We continue to grow at a very rapid pace north of 30% year and year, twice the speed of the market, so we're continuing to gain market share. Even after 25 years, we're growing at start-up rates. On Fintech in Mexico, less than half the population have a bank account. Less than 15% have a credit card. The opportunity is immense as well to continue growing. Advertising, we mentioned it before, everywhere you look at mainly there are opportunities. We are fortunate to have a lot of resources to take on those opportunities. 18,000 developers, a very well, very strong balance sheet to invest.\nWe generate lots of cash, even though we are investing in our business as well. I think the big challenge is when you don't have a clear constraint is how to make sure that you are investing in the right things. That represents not only choosing what to invest, but also choosing what not to do, not to get and also to make sure that you are investing on things that really have a good payout, and they actually result in growth going forward. That's something that continuously my team and my colleagues at the sea level are continuously looking at, at the end of the day is maintaining this growth feed mentality that we have been operating. We want to make sure that we hit the growth targets. While, not shying away from investing, even if in the short term, we might put some pressure on margins. We don't mind. We don't run the business on a quarter by quarter basis. We run the business for the next 25 years.\nRon Gross: Coming up after the break, Emily Flippen and Matt Argersinger return with a couple of stocks on their radar. Stay right here. You're listening to Motley Fool Money. As always, people on the program may have interest in the stocks they talk about, and the Motley Fool may have formal recommendations for or against. Don't buy r sell stocks based solely on what you hear. All personal finance content follows Motley Fool editorial standards and are not approved by advertisers. The Motley Fool only picks products that it would personally recommend to friends like you. Welcome back to Motley Fool Money Ron Gross here with Emily Flippen and Matt Argersinger Fools, we've got time for two quick stories before we hit stocks on our radar. Let's start with the Walmart news on Wednesday, Walmart withdrew its earnings guidance, citing uncertainty surrounding the Trump administration's newly imposed tariffs specifically on China. Emily, the health of Walmart can tell us a lot about the health of the consumer and, frankly, the economy as a whole. What did you take away from these actions by Walmart management?\nEmily Flippen: Unfortunately, my takeaway is that things will likely get worse before they get better. The silver lining to this is that Walmart did reaffirm its sales guidance. They actually are perceived to have a little bit more clarity into how consumers are behaving versus what their bottom line may look like, which is obviously heavily impacted by things like tariffs and any negotiations there. Not only does Walmart really act as that bellwether for how consumers are behaving, but it's also really easy to forget that Walmart's a little bit of a bellwether and a leader for other businesses that look to Walmart for guidance. So many companies are likely watching Walmart's decision here to pull back guidance on their bottom line, and they could potentially adopt a very similar wait-and-see approach here as it applies to their own guidance. And that can almost turn into a self-fulfilling prophecy of economic slowing and leading to a market sell-off all because of the cautiousness around things like earnings guidance. Now, I think that could be a dramatic interpretation, of course, and I'll just quickly mention that Walmart does have much more complex supply lines than a lot of other small businesses. Their certainty and clarity there could be more opaque than other companies. But the fact that they are a bellwether for both consumers, which we focus on, as well as other businesses is a bit of a red flag.\nRon Gross: The new Superman movie is scheduled to hit theaters this July. As listeners know, I am a Superman fanatic, really looking forward to it. Admittedly, the movies haven't always been so super, but there is a new sneak peek out there. I know you have both seen it, so I'm curious to ask. Do we have a hit on our hands or a dud? Did you have a favorite part of the sneak peek? I'll go to you first Matt.\nMatt Argersinger: Well, how can you not love Krypto coming in there, Krypto the super dog, coming in to rescue Superman from whatever ails him in that particular scene. But no, look, I think it looks awesome. I think Gunn did a fantastic job with the Guardians of Galaxy movies. I like that he's bringing a lot of interesting characters into the Superman movie, including looks like Hawk Man's in there. Looks like Guy Gardner, the Green Lantern characters in there. I'm excited. I'm going to go see it with my son, for sure. Emily, a hit or a dud?\nEmily Flippen: Well, let's put it this way. You're barking up the wrong tree, because I am not a superhero movie watcher. But I will say this. I watched the trailer at your bequest, and I didn't know the creepy CGI dog had a name. Nice to know.\nMatt Argersinger: You don't know Krypto? A creepy CGI dog.\nEmily Flippen: There's a lot of CGI in that trailer. CGI has come a long way. I don't know what I'm talking about, as it applies to CGI. I will say, it was obviously CGI, though. I do think it's a little bit of a red flag if you're having to bring in other superheroes to attract excitement. What does that say about Superman?\nRon Gross: Well, I am hopeful, and my favorite part is when the Fortress of solitude rises out of the snow as Superman gets closer, almost like it could sense where he was. I love that part. Very cool. Alright, Fools, a quick personal note before we hit stocks on our radar. This will be my last Motley Fool Money radio show. It has been the joy of my career to play a small part in the financial journey of as Chris Hill would say, our dozens of listeners. Thank you for letting me share my thoughts with you for 16 wonderful years. Thank you all very much. I really appreciate it.\nMatt Argersinger: Ron, can I just say?\nRon Gross: Yes, Matt.\nMatt Argersinger: Sixteen years, actually, 17 years with the Motley Fool. You've been a colleague, a mentor, a leader, most of all, a friend. I wish you the very best in retirement, and we will do our very best. It will be a lot harder now, but we will do our very best to keep this show firing on all cylinders.\nRon Gross: [laughs] I appreciate that. Thanks, Martin. Very nice. Fools, we have time for a couple of stocks on our radar, so let's close out the show that way, and I will bring in our man Dan Boyd, to ask a question and pick his favorite. Emily, you're up first. What have you got?\nEmily Flippen: I'm looking at Dexcom this week. It's nice to have a little bit of positive news in a world that is changing around us so rapidly. Some of the excitement here for Dexcom did get drowned out by tariff talk. But Dexcom did see a little bit of a revival this week because they did get FDA approval for their newest continuous glucose monitor that is a Dexcom G7. It could be worn for up to 15 days so that extending the life versus their previous model, it puts them in more direct competition with Abbott, who is one of their competitors, which also has the FreeStyle Libre, which can be worn up to 15 days. Ahead of Metronic. I definitely move in the right direction here for Dexcom. CGM penetration for diabetics worldwide is still so much lower than what it should be, considering the health benefits that it can bring. I will say, though, I always have in the back of my head, just the fear around a couple of things. One is weight loss drugs, leading to a decline in type 2 diabetes that could eat up some of the market here for Dexcom, as well as actually a potential cure for something like diabetes. That's further down the line, but a lot of research and time is being spent into it, considering it is such a deadly and expensive disease.\nRon Gross: Dan, you got a question or a comment?\nDan Boyd: Dexcom it's one of these companies that the name doesn't really match up with what they do. The name, to me, is, like, something out of Superman, very sinister. But what they do very good for society. I don't know what to do here, Emily.\nEmily Flippen: That's a good point. I will say Abbott sharing its name with Abbott Elementary. Sounds like the friendlier of the options, but I like Dexcom more, despite the name.\nRon Gross: Matt, you're up. What have you got?\nMatt Argersinger: Ron, I'm looking at RobinHood Markets. Ticker H-O-O-D. This is an unusual one for me. I just want to stress, this is a true radar stock, a company I'm just beginning to take a look at. But I heard a great interview with Robin Hood's chief brokerage officer last week. If you look at where young people, I'm talking mainly Emily's age, where they're going to open up brokerage accounts. It's not Fidelity. It's not Charles Schwab. It's certainly not Interactive Brokers where I tend to toil. It's Robin Hood. Nearly 26 million funded customers, many, I think most of which are in their 20s and 30s. When that large cohort of investors matures, starts opening retirement accounts, trust accounts, getting mortgages, doing more sophisticated trading. I think Robin Hood is really growing its offerings to like, a whole range of financial services. They also have the Robin Hood Gold membership, which is approaching three million accounts. It offers members higher levels of market data, greater margin access, could be dangerous, and then higher interest on cash and accounts. I have to say, I'm a shareholder in Schwab and I will probably be a shareholder in Schwab for a long time. But if I'm going to make a long term bet on a brokerage company, I might also want to have exposure to a brokerage company that has the most young people coming to it because it's likely to prosper right alongside that growth over time.\nRon Gross: Dan, got a question?\nDan Boyd: Yeah, when I hear Robin Hood, I associate it with meme stocks like GameStop and AMC and all that jazz. Is this a company that actually has legs, or is it just something that's going to be a flash in the pan?\nMatt Argersinger: Dan, I thought the same thing. It's the meme stock brokerage. But the fact that they have 26 million funded customers, and that has continued growing way past the GameStop and AMC stuff that we saw several years ago, that gives you confidence that has long term staying power.\nRon Gross: I, too, am a Charles Schwab shareholder, not a Robin Hood one, but I'll take a look. Could be interesting. Dan, you got a favorite fear watch list?\nDan Boyd: Well, it really seems like Dexcom is, like, the smart choice, but Robin Hood, I feel like is the more interesting choice. Can I do both on your last day, Ron?\nRon Gross: You can do whatever you want, Dan. Both it is.\nDan Boyd: That's awesome.\nRon Gross: Emily Flippen and Matt Argersinger, thanks for being here, my friends. That's going to do it for this week's Motley Fool Money. Our tremendous engineer is Dan Boyd. I am Ron Gross. Thanks for listening. The Motley Fool Money Radio Show, we'll see you next week.\nJPMorgan Chase is an advertising partner of Motley Fool Money. Charles Schwab is an advertising partner of Motley Fool Money. Wells Fargo is an advertising partner of Motley Fool Money. Asit Sharma has no position in any of the stocks mentioned. Dan Boyd has no position in any of the stocks mentioned. Emily Flippen, CFA has positions in Constellation Brands and MercadoLibre. Matthew Argersinger has positions in Boston Beer, Charles Schwab, MercadoLibre, and RPM International and has the following options: short May 2025 $45 puts on Delta Air Lines. Ron Gross has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Boston Beer, CarMax, Interactive Brokers Group, JPMorgan Chase, MercadoLibre, and Walmart. The Motley Fool recommends Charles Schwab, Constellation Brands, Delta Air Lines, DexCom, and RPM International and recommends the following options: long January 2027 $65 calls on DexCom, short January 2027 $75 calls on DexCom, and short June 2025 $85 calls on Charles Schwab. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 18-20_United Airlines Says It's Unfazed by Tariffs’ Potential Impact",
    "date": "",
    "content": "Title: United Airlines Says It's Unfazed by Tariffs’ Potential Impact\nDate: 2025-04-16 18:20\nURL: https://finance.yahoo.com/m/4c7ae5d6-b1f7-377a-9d88-94f32c7b9393/united-airlines-says-it%27s.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUnited Airlines doesn’t expect tariffs to have a significant impact on what it pays for planes, Chief Executive Scott Kirby said. Most of the aircraft deliveries United is waiting on will come from Boeing, and most of its new Airbus planes are being built in Alabama, though the network of suppliers that the plane makers rely on is spread throughout the world. Rival Delta Air Lines said last week it won’t pay tariffs on any new Airbus planes coming its way and would defer any deliveries affected by new levies.\nCORRECTIONS China’s Comac C919 jet is a competitor to Boeing 737. A Page One article on Wednesday about Boeing incorrectly identified the competing plane as the 747. Audi’s A7 is among models being recalled because of software problems.\nAnalysts see Bitcoin poised for a breakout despite trade war shocks. If key resistance holds, $92K is in sight.\nYou must keep up on Warren Buffett stocks: The Berkshire Hathaway chief sticks to a winning investing formula, but he does not sit still.\nBoeing (BA) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nThe company beat expectations for first-quarter profit but it plans to cut capacity starting in the third quarter based on demand trends.\nStarbucks (SBUX) is tweaking its dress code in an effort to showcase its “iconic green apron,” the company announced Tuesday.\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\nStarbucks is imposing new limits on what its baristas can wear under their green aprons.  Starbucks will give each employee two free T-shirts.  Starbucks said the new dress code will make its green aprons stand out and create a sense of familiarity for customers.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 18-29_United Airlines Is So Unsure About the Economy It Offers Two Profit Scenarios",
    "date": "",
    "content": "Title: United Airlines Is So Unsure About the Economy It Offers Two Profit Scenarios\nDate: 2025-04-16 18:29\nURL: https://finance.yahoo.com/news/united-airlines-unsure-economy-offers-182932996.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- United Airlines Holdings Inc. reassured investors worried about wobbly demand with a vow to make money even during a recession.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nThe company plans to control costs and keep its planes full, dialing back flying plans as needed to keep profits coming in should President Donald Trump’s trade war trigger an economic downturn. The carrier took the unusual step of issuing two profit forecasts, saying adjusted earnings will be $11.50 to $13.50 a share this year if the current environment remains stable, or as little as $7 a share if the US economy enters a recession.\n“That’s a pretty good downside,” said Bloomberg Intelligence analyst George Ferguson, who added that he’s never seen a company give a multi-scenario outlook before. “I expect airlines to bleed red in a recession.”\n“It is true that the environment has gotten a lot harder,” United Chief Executive Officer Scott Kirby said Wednesday on the company’s earnings call, adding that the carrier has a “real shot” to achieve its rosier outlook. “No matter what the economic environment is, we are going to bust our asses to get there.”\nWall Street applauded the two-pronged show of confidence, sending United’s shares up more than 5% during the call before the stock turned negative, in line with a broader market slump. American Airlines Group Inc. and Southwest Airlines Co. report first-quarter earnings next week.\nUnited offered a counter to warnings from rival airlines that growth and profits are at risk due to Trump’s tariffs. Delta Air Lines Inc. last week withdrew its 2025 financial guidance due to global trade uncertainty and waning confidence among consumers and businesses that has “flat-lined” revenue growth. The parent of Frontier Airlines also withdrew its full-year profit outlook due to the murky economic environment.\n“We like United’s guidance approach given the fluidity of the macro backdrop,” Deutsche Bank analyst Mike Linenberg said in a report.\nTrump’s rapid trade policy shifts — slapping tariffs on countries and goods before granting relief soon after — have made it difficult for companies to forecast demand and earnings with any precision. United said the macroeconomic environment this year “is impossible to predict” with any confidence.\n“Time will tell how the backdrop plays out, but management has had a knack of pulling a rabbit out of the hat,” Melius Research analyst Conor Cunningham said in a note. “At the very least, there is now a downside scenario in which investors can attempt to get comfortable around.”\nUnited isn’t alone in seeing divergent outcomes. The Bank of Canada on Wednesday published two sets of forecasts, instead of its usual single projection. One outlines a temporary stall in Canadian economic activity, and the second sketches out an outright downturn that lasts a year. Separately, Fed Governor Christopher Waller on Monday laid out two scenarios for how Trump’s trade policy could affect the US economy, including one in which economic growth would slow “to a crawl” should steep US tariffs remain in place for some time.\nDeep government job cuts and changing border policies by the Trump administration have already cut into bookings for domestic trips. United said premium cabin sales over the last two weeks were up 17% while international grew 5% year over year. The carrier’s first-quarter adjusted profit of 91 cents a share topped Wall Street’s expectation for 74 cents.\nUnited said it will reduce that flying by four percentage points starting in the third quarter and will continue trimming some flying on low-demand days going into the fourth quarter. The airline said Wednesday it would move up the planned early retirement of 21 airplanes.\nThe carrier expects an adjusted profit in the current quarter will be $3.25 to $4.25 a share, compared with the $3.97 average of analyst estimates compiled by Bloomberg. Delta has also said it expects to post a second-quarter profit.\n--With assistance from Christopher Condon.\n(Retops with executive commentary, analyst reaction from the first paragraph.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]