[
  {
    "title": "2025-04-16 05-44_Weekly Picks_ 🧠 Alphabet’s AI edge, CSL’s pricing power, and a chip underdog",
    "date": "",
    "content": "Title: Weekly Picks_ 🧠 Alphabet’s AI edge, CSL’s pricing power, and a chip underdog\nDate: 2025-04-16 05:44\nURL: https://finance.yahoo.com/news/weekly-picks-alphabet-ai-edge-054420316.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWelcome to Weekly Picks, where each week our analysts hand pick their favourite Narratives from the community (  what is a Narrative? ).\nThis week’s picks cover:\n💸 Why  Alphabet is the most undervalued Mag7 stock.\n👨‍💻 How PVA TePLa is on the cusp of being re-rated higher.\n💉 Why CSL is undervalued, no matter how high the tariffs go.\n🔔 Know when to act:  Set the narrative valuations as your own fair value to know when to buy, hold or sell the stock.\n🤔 Get answers: Ask the author any questions in the comments section. Feel free to like as well to support their work.\n✨ Discover more Narratives: There are hundreds of other insightful stock narratives on our Community page .\n✍️ Build an audience: Have your narrative seen by millions of investors, simply meet our Featuring criteria to go into the running!\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\nSimply Wall St analyst Michael Paige and Simply Wall St have no position in any of the companies mentioned. This article is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 09-06_Google faces 5 billion pound UK lawsuit for abusing dominance in online search",
    "date": "",
    "content": "Title: Google faces 5 billion pound UK lawsuit for abusing dominance in online search\nDate: 2025-04-16 09:06\nURL: https://finance.yahoo.com/news/google-faces-5-billion-pound-090629004.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBy Paul Sandle\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.\nThe class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.\nIt said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nThe claim, filed by competition law expert Or Brook on behalf of thousands of businesses, alleges Google ensured its search engine had better functionality and more features for Google's own advertising offering than that of its competitors.\nGoogle said this was \"yet another speculative and opportunistic case\".\n\"We will argue against it vigorously,\" a spokesperson said. \"Consumers and advertisers use Google because it is helpful, not because there are no alternatives.\"\nBrook said businesses had almost no choice but to use Google ads to advertise their products and services.\n\"Regulators around the world have described Google as a\nmonopoly and securing a spot on Google's top pages is essential for visibility,\" she said in a statement.\n\"Google has been leveraging its dominance in the general search and search advertising market to overcharge advertisers.\"\nBritain's antitrust regulator launched an investigation into Google's search services, including their impact on advertising markets, in January.\nThe Competition and Markets Authority said at the time that millions of people and businesses relied on Google's services, which accounted for 90% of searches and were used by more than 200,000 UK businesses to advertise.\n($1 = 0.7526 pounds)\n(Reporting by Akash Sriram in Bengaluru and Paul Sandle in London; Editing by Varun H K, Catarina Demony and Emelia Sithole-Matarise)\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nWell-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL). Brown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet’s core internet search business. Details About Brown’s Decision and His Motivation After selling half of his GOOG […]\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nAlphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) stock reached an all-time high price of $207.05 on Feb. 4, riding a wave of strong growth and earnings momentum from 2024.  At the time of writing on April 11, shares of Alphabet are down 24% from that record high.  Innovations in areas like machine learning, automation, and generative AI are rapidly transforming the global economy.\nDETROIT (Reuters) -Ford Motor's China business, including exports from the country, made $900 million in earnings before interest and taxes last year, one of the automaker's top executives said on Wednesday.  John Lawler, Ford's vice chair and former chief financial officer, gave a rare glimpse into the automaker's earnings in the country, where it has been restructuring to stem financial losses.  \"When I left China in 2016, it was a digital society back then,\" Lawler said at an analyst conference, referring to his previous role as head of Ford China.\nMILAN (Reuters) -Ferrari has been preparing for years for electrification, starting with Formula One powertrains, as it nears the launch of its first fully electric (EV) model in October, Chairman John Elkann said on Wednesday.  Known globally for its roaring petrol engines, the luxury sportscar maker started selling hybrid models in 2019 and is scheduled to unveil its first EV at a capital markets day on October 9.  \"Electrification has been a path that we've been pursuing now for decades, starting in Formula One and then from our race cars to our sports cars,\" Elkann said during the company's annual shareholders' meeting.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to […]\nHeartland Advisors, an investment management company, released its “Heartland Value Fund” first quarter 2025 investor letter. A copy of the letter can be downloaded here. The fund was down 5.63% in the first quarter compared to a 7.74% fall for the Russell 2000 Value Index. The fund outperformed the benchmark over the past 1, 3, […]\nEY is being investigated over its audits of the Post Office in the wake of the Horizon scandal, which saw hundreds of postmasters wrongly convicted of theft.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-00_Google used AI to suspend over 39M ad accounts suspected of fraud",
    "date": "",
    "content": "Title: Google used AI to suspend over 39M ad accounts suspected of fraud\nDate: 2025-04-16 10:00\nURL: https://techcrunch.com/2025/04/16/google-used-ai-to-suspend-over-39m-ad-accounts-committing-fraud/?.tsrc=rss\nContent:\nLatest\t\n\n\n\n\t\tAI\t\n\n\n\n\t\tAmazon\t\n\n\n\n\t\tApps\t\n\n\n\n\t\tBiotech & Health\t\n\n\n\n\t\tClimate\t\n\n\n\n\t\tCloud Computing\t\n\n\n\n\t\tCommerce\t\n\n\n\n\t\tCrypto\t\n\n\n\n\t\tEnterprise\t\n\n\n\n\t\tEVs\t\n\n\n\n\t\tFintech\t\n\n\n\n\t\tFundraising\t\n\n\n\n\t\tGadgets\t\n\n\n\n\t\tGaming\t\n\n\n\n\t\tGoogle\t\n\n\n\n\t\tGovernment & Policy\t\n\n\n\n\t\tHardware\t\n\n\n\n\t\tInstagram\t\n\n\n\n\t\tLayoffs\t\n\n\n\n\t\tMedia & Entertainment\t\n\n\n\n\t\tMeta\t\n\n\n\n\t\tMicrosoft\t\n\n\n\n\t\tPrivacy\t\n\n\n\n\t\tRobotics\t\n\n\n\n\t\tSecurity\t\n\n\n\n\t\tSocial\t\n\n\n\n\t\tSpace\t\n\n\n\n\t\tStartups\t\n\n\n\n\t\tTikTok\t\n\n\n\n\t\tTransportation\t\n\n\n\n\t\tVenture\t\n\n\n\n\t\tEvents\t\n\n\n\n\t\tStartup Battlefield\t\n\n\n\n\t\tStrictlyVC\t\n\n\n\n\t\tNewsletters\t\n\n\n\n\t\tPodcasts\t\n\n\n\n\t\tVideos\t\n\n\n\n\t\tPartner Content\t\n\n\n\n\t\tTechCrunch Brand Studio\t\n\n\n\n\t\tCrunchboard\t\n\n\n\n\t\tContact Us\t\n\nGoogle on Wednesday said it suspended 39.2 million advertiser accounts on its platform in 2024  — more than triple the number from the previous year — in its latest crackdown on ad fraud.\nBy leveraging large language models (LLMs) and using signals such as business impersonation and illegitimate payment details, the search giant said it could suspend a “vast majority” of ad accounts before they ever served an ad.\nLast year, Google launched over 50 LLM enhancements to improve its safety enforcement mechanisms across all its platforms.\n“While these AI models are very, very important to us and have delivered a series of impressive improvements, we still have humans involved throughout the process,” said Alex Rodriguez, a general manager for Ads Safety at Google, in a virtual media roundtable.\nThe executive told reporters that a team of over 100 experts assembled across Google, including members from the Ads Safety team, the Trust and Safety division, and researchers from DeepMind. They analyzed deepfake ad scams involving public figure impersonations and developed countermeasures. \nThe company introduced technical countermeasures and over 30 ads and publisher policy updates last year. These moves helped suspend over 700,000 offending advertising accounts, leading to a 90% drop in reports of deepfake ads, the company claims.\nIn the U.S. alone, Google said it suspended 39.2 million advertiser accounts and took down 1.8 billion ads last year, with key violations tied to ad network abuse, trademark misuse, healthcare claims, personalized ads, and misrepresentation.\nIndia, the world’s most populous country and the second biggest internet market after China in terms of users, saw 2.9 million account suspensions last year, Google said, making it the second-highest after the U.S. The company also removed 247.4 million ads in India, with the top five policy violations related to financial services, trademark misuse, ad network abuse, personalized ads, and gambling and games.\nOf all the advertiser account suspensions, Google said it suspended 5 million accounts for scam-related violations.\nOverall, the company removed almost half a billion ads related to scams.\nGoogle also verified more than 8,900 new election advertisers in 2024, which saw half of the world’s population go to the polls, and removed 10.7 million election ads. However, Rodriguez noted that the volume of election ads compared to Google’s overall ad numbers was relatively small and would not significantly impact its safety metrics this year.\nIn total, Google said it blocked 5.1 billion ads last year and removed 1.3 billion pages. In comparison, it blocked over 5.5 billion ads and took action against 2.1 billion publisher pages in 2023.\nGoogle told TechCrunch that the decreasing numbers indicated improvements in its prevention efforts. By improving early detection and suspension of malicious accounts, fewer harmful ads are produced or reach the platform, the company said.\nThe company also restricted 9.1 billion ads last year, it said. \nImportantly, large-scale suspensions sometimes spark concerns over how fairly a company applies its rules. Google said it offers an appeal process that includes human reviews to ensure it took “appropriate action.”\n“Oftentimes, some of our message wasn’t as clear and transparent about specifics, about what the rationale was, or reasoning, and sometimes that left the advertiser a little more confused. We ended up updating a bunch of our policies as it related to that, a bunch of our transparency capabilities in terms of the messaging around what and why to help the advertiser … It’s been a big focus for the team as part of 2024 and into 2025,” Rodriguez said.\nTopics\n\nReporter\n\n Microsoft researchers say they’ve developed a hyper-efficient AI model that can run on CPUs\n\n\n\n Figma ignores the fear, files paperwork for an IPO\n\n\n\n For security, Android phones will now auto-reboot after three days\n\n\n\n Figma sent a cease-and-desist letter to Lovable over the term ‘Dev Mode’\n\n\n\n Notorious image board 4chan hacked and internal data leaked\n\n\n\n Notion releases an AI-powered email client for Gmail\n\n\n\n Hertz says customers’ personal data and driver’s licenses stolen in data breach\n\n\n\n© 2025 Yahoo.\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!"
  },
  {
    "title": "2025-04-16 10-22_Google faces £5 billion lawsuit in U.K. over alleged market abuse",
    "date": "",
    "content": "Title: Google faces £5 billion lawsuit in U.K. over alleged market abuse\nDate: 2025-04-16 10:22\nURL: https://finance.yahoo.com/news/google-faces-5-billion-lawsuit-102205564.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nInvesting.com -- Alphabet Inc’s (NASDAQ:GOOGL) Google is facing a class action lawsuit in the U.K., where it’s being sued for potential damages exceeding £5 billion ($6.6 billion).\nThe claim alleges that the U.S. tech giant has been abusing its near-total dominance in the online search market, which has resulted in increased prices.\nThe lawsuit, filed on Wednesday in the U.K. Competition Appeal Tribunal, alleges that Google has been using its dominant position to stifle competition from other search engines.\nIt claims this has strengthened Google’s market standing and established it as the sole viable platform for online search advertising.\nAccording to the lawsuit, Google has been actively excluding competition by entering into contracts with phone manufacturers to pre-install Google Search and the Chrome browser on Android devices.\nAdditionally, the tech company has been paying Apple Inc (NASDAQ:AAPL) to ensure that Google Search is the default search engine on iPhones.\nRelated articles\nGoogle faces £5 billion lawsuit in U.K. over alleged market abuse\nNeedham upgrades Boston Scientific on easing competition, growth opportunities\nMizuho upgrades Cloudflare on AI traction, improving deal pipeline\nInvestment management company Vulcan Value Partners recently released its first-quarter 2025 investor letter. A copy of the letter can be downloaded here. The first quarter experienced the return of volatility. The companies’ management teams expressed a more cautious view following the recent election. Optimism has given way to uncertainty about tariffs and potential impacts on earnings, inflation, […]\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nAs TikTok continues to build out its search experience, the social network is now surfacing reviews for select places right within the comments tab of a video. The new feature, which appears to be a test, eliminates the need to conduct a new search or open Google when you come across a place on TikTok and want to learn more about it. TikTok users who have access to this new feature will see a new \"Reviews\" tab on the right after they click to view the video's comments. For instance, if you come\nAnother step towards expanded business listings in the app?\nGoogle on Wednesday said it suspended 39.2 million advertiser accounts on its platform in 2024 — more than triple the number from the previous year — in its latest crackdown on ad fraud. By leveraging large language models (LLMs) and using signals such as business impersonation and illegitimate payment details, the search giant said it could suspend a \"vast majority\" of ad accounts before they ever served an ad. Last year, Google launched over 50 LLM enhancements to improve its safety enforcemen\nAlphabet (GOOGL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nGameStop (GME) concluded the recent trading session at $26.70, signifying a -1.04% move from its prior day's close.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 11-33_Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising",
    "date": "",
    "content": "Title: Google Faces Potential $6.6 Billion U.K. Antitrust Lawsuit Over Search Advertising\nDate: 2025-04-16 11:33\nURL: https://finance.yahoo.com/m/a110cb1b-176c-3251-ad05-1f098e047e33/google-faces-potential-%246.6.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Meta Platforms, Inc. (NASDAQ:META) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock […]\nWe recently published a list of 10 AI Stocks on the Move. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other AI stocks on the move. Market uncertainty aside, the AI race is tighter than ever. A report by Stanford University’s Institute for Human-Centered AI (HAI) […]\nJapanese regulators on Tuesday accused U.S. tech giant Google of violating anti-monopoly laws, echoing similar moves in the U.S. and Europe.  Google Japan said in a statement that it found the action “regrettable.”  It said it has invested in Japan significantly to promote innovation as a technology leader.\nMeta CEO Mark Zuckerberg emphasized in federal court on Wednesday that he bought Instagram and WhatsApp because he saw value in the companies — not to take out competitors, as the Federal Trade Commission alleges in a historic antitrust trial.  Zuckerberg took the stand for the third day in the trial, wrapping up his testimony as the first witness Wednesday afternoon.  Hansen focused some of his questioning on emails sent by Zuckerberg and his associates that the FTC cited in earlier testimony to illustrate the Facebook founder's alarm over the growth of Instagram and his sense that he needed to neutralize its threat.\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nAlphabet is strengthening its competitive position in the search and cloud with the infusion of AI amid challenging macroeconomic conditions.\nDETROIT (Reuters) -Ford Motor's China business, including exports from the country, made $900 million in earnings before interest and taxes last year, one of the automaker's top executives said on Wednesday.  John Lawler, Ford's vice chair and former chief financial officer, gave a rare glimpse into the automaker's earnings in the country, where it has been restructuring to stem financial losses.  \"When I left China in 2016, it was a digital society back then,\" Lawler said at an analyst conference, referring to his previous role as head of Ford China.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nAlphabet (GOOGL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 12-28_Market Chatter_ Alphabet's YouTube Prematurely Promised Immunity From Australian Social Media Ban",
    "date": "",
    "content": "Title: Market Chatter_ Alphabet's YouTube Prematurely Promised Immunity From Australian Social Media Ban\nDate: 2025-04-16 12:28\nURL: https://finance.yahoo.com/news/market-chatter-alphabet-apos-youtube-122806058.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAlphabet (GOOG)'s YouTube Chief Executive Officer Neal Mohan got a personal guarantee from Australia\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nAlphabet (GOOGL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-00_Investors Heavily Search Alphabet Inc. (GOOG)_ Here is What You Need to Know",
    "date": "",
    "content": "Title: Investors Heavily Search Alphabet Inc. (GOOG)_ Here is What You Need to Know\nDate: 2025-04-16 13:00\nURL: https://finance.yahoo.com/news/investors-heavily-search-alphabet-inc-130016924.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAlphabet Inc. (GOOG) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this company have returned -2.5%, compared to the Zacks S&P 500 composite's -4.2% change. During this period, the Zacks Internet - Services industry, which Alphabet falls in, has lost 5.5%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, Alphabet is expected to post earnings of $2.06 per share, indicating a change of +9% from the year-ago quarter. The Zacks Consensus Estimate has changed -1.6% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $8.87 points to a change of +10.3% from the prior year. Over the last 30 days, this estimate has changed -0.2%.\nFor the next fiscal year, the consensus earnings estimate of $10.17 indicates a change of +14.6% from what Alphabet is expected to report a year ago. Over the past month, the estimate has changed -0.5%.\nHaving a strong externally audited track record, our proprietary stock rating tool, the Zacks Rank, offers a more conclusive picture of a stock's price direction in the near term, since it effectively harnesses the power of earnings estimate revisions. Due to the size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, Alphabet is rated Zacks Rank #3 (Hold).\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nFor Alphabet, the consensus sales estimate for the current quarter of $75.53 billion indicates a year-over-year change of +11.8%. For the current and next fiscal years, $331.22 billion and $368.31 billion estimates indicate +12.2% and +11.2% changes, respectively.\nAlphabet reported revenues of $81.62 billion in the last reported quarter, representing a year-over-year change of +12.9%. EPS of $2.15 for the same period compares with $1.64 a year ago.\nCompared to the Zacks Consensus Estimate of $81.38 billion, the reported revenues represent a surprise of +0.3%. The EPS surprise was +1.42%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOG) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nDWF Labs purchased World Liberty Financial (WLFI) tokens worth $25 million on Apr. 16. WLFI is a crypto project backed by the Trump family.\nLike the quiet quitting and quiet vacationing trends before it, quiet cracking gets at worker insecurity fueled by the current economy.\nIf Sheetz, Wawa or QuikTrip suddenly drop 30 locations into a new market, it fundamentally changes consumer behavior and competitive dynamics, columnist Frank Beard writes.\nSimilar investigations into other industries have been a precursor to sector-specific tariffs from the U.S., which wants to boost its domestic rare earth supply.\nThe trading platform, which aims to attract younger investors as the Great Wealth Transfer increases their pricing power, saw a big spike out of the gate.\nThe spike comes as US drug manufacturers stockpile medicines in anticipation of new tariffs.\nRobust AI chip demand is likely to have driven TSM's Q1 revenue growth, while rising operational costs could have weighed on earnings growth.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-00_Investors Heavily Search Alphabet Inc. (GOOGL)_ Here is What You Need to Know",
    "date": "",
    "content": "Title: Investors Heavily Search Alphabet Inc. (GOOGL)_ Here is What You Need to Know\nDate: 2025-04-16 13:00\nURL: https://finance.yahoo.com/news/investors-heavily-search-alphabet-inc-130018317.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAlphabet (GOOGL) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\nOver the past month, shares of this internet search leader have returned -2.7%, compared to the Zacks S&P 500 composite's -4.2% change. During this period, the Zacks Internet - Services industry, which Alphabet falls in, has lost 5.5%. The key question now is: What could be the stock's future direction?\nWhile media releases or rumors about a substantial change in a company's business prospects usually make its stock 'trending' and lead to an immediate price change, there are always some fundamental facts that eventually dominate the buy-and-hold decision-making.\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\nWe essentially look at how sell-side analysts covering the stock are revising their earnings estimates to reflect the impact of the latest business trends. And if earnings estimates go up for a company, the fair value for its stock goes up. A higher fair value than the current market price drives investors' interest in buying the stock, leading to its price moving higher. This is why empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\nFor the current quarter, Alphabet is expected to post earnings of $2.04 per share, indicating a change of +7.9% from the year-ago quarter. The Zacks Consensus Estimate has changed -1.6% over the last 30 days.\nFor the current fiscal year, the consensus earnings estimate of $8.88 points to a change of +10.5% from the prior year. Over the last 30 days, this estimate has changed -0.2%.\nFor the next fiscal year, the consensus earnings estimate of $10.17 indicates a change of +14.5% from what Alphabet is expected to report a year ago. Over the past month, the estimate has changed -0.5%.\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for Alphabet.\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\nEven though a company's earnings growth is arguably the best indicator of its financial health, nothing much happens if it cannot raise its revenues. It's almost impossible for a company to grow its earnings without growing its revenue for long periods. Therefore, knowing a company's potential revenue growth is crucial.\nIn the case of Alphabet, the consensus sales estimate of $75.53 billion for the current quarter points to a year-over-year change of +11.8%. The $326.8 billion and $363.24 billion estimates for the current and next fiscal years indicate changes of +10.7% and +11.2%, respectively.\nAlphabet reported revenues of $81.62 billion in the last reported quarter, representing a year-over-year change of +12.9%. EPS of $2.15 for the same period compares with $1.64 a year ago.\nCompared to the Zacks Consensus Estimate of $81.38 billion, the reported revenues represent a surprise of +0.3%. The EPS surprise was +1.42%.\nThe company beat consensus EPS estimates in each of the trailing four quarters. The company topped consensus revenue estimates each time over this period.\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\nAlphabet is graded C on this front, indicating that it is trading at par with its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about Alphabet. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nAltria (MO) closed at $57.52 in the latest trading session, marking a +0.68% move from the prior day.\nArista Networks (ANET) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock.\nStoneCo's comprehensive fintech platform, consistent earnings outperformance, and attractive valuation allow investors to profit from Brazil's digital payment transformation.\nInvestment management company Vulcan Value Partners recently released its first-quarter 2025 investor letter. A copy of the letter can be downloaded here. The first quarter experienced the return of volatility. The companies’ management teams expressed a more cautious view following the recent election. Optimism has given way to uncertainty about tariffs and potential impacts on earnings, inflation, […]\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nPinterest (PINS) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-03_Google Faces $6.6B UK Lawsuit Alleging Search Monopoly Abuse; Stock Slides",
    "date": "",
    "content": "Title: Google Faces $6.6B UK Lawsuit Alleging Search Monopoly Abuse; Stock Slides\nDate: 2025-04-16 13:03\nURL: https://finance.yahoo.com/news/google-faces-6-6b-uk-130347574.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAlphabet (NASDAQ:GOOG) shares fell more than 2% in early Wednesday trading after Google was hit with a multi-billion-pound class action lawsuit in the U.K., accusing the tech giant of abusing its dominance in the online search market.\nThe 5 billion (roughly $6.6 billion) claim, filed on behalf of British businesses that have used Google's search advertising services since 2011, alleges that Google leveraged its \"near-total control\" to inflate ad prices by limiting competition in the sector.\nThe legal complaint, led by competition law scholar Or Brook and represented by Geradin Partners, claims Google paid Apple (AAPL) billions to remain the default search engine on Safari. It also says the company struck deals with Android phone makers to pre-install Google Search and Chrome, further locking out rivals.\nBrook said U.K. businesses have had \"almost no choice\" but to rely on Google for online ads and argued the company \"overcharged\" advertisers through anti-competitive behavior, according to a Wednesday CNBC report.\nThe lawsuit adds to growing global scrutiny over Google's market dominance and follows similar regulatory pushback in the U.S. and EU.\nThis article first appeared on GuruFocus.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where Applied Materials, Inc. (NASDAQ:AMAT) stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump […]\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nMiddle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]\nAdvanced Micro Devices (NASDAQ: AMD) stock saw a big valuation pullback Wednesday.  The semiconductor company's share price ended the day's trading down 7.4% amid a 2.3% decline for the S&P 500 and a 3.1% decline for the Nasdaq Composite.  Due to new U.S. policies, AMD will require an export license in order to sell its MI308X artificial intelligence (AI) processor into the Chinese market.\nAlphabet (GOOGL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-42_Is Alphabet Inc. (NASDAQ_GOOGL) the Best NASDAQ Stock to Buy So Far in 2025_",
    "date": "",
    "content": "Title: Is Alphabet Inc. (NASDAQ_GOOGL) the Best NASDAQ Stock to Buy So Far in 2025_\nDate: 2025-04-16 13:42\nURL: https://finance.yahoo.com/news/alphabet-inc-nasdaq-googl-best-134201402.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other NASDAQ stocks to buy in 2025.\nOn April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact of current tariffs and compared the situation to an economic armageddon. If the current tariffs remain in place, Ives thinks it would lead to a 15% to 20% demand reduction across the board. He thinks that investor anxiety is much higher considering how things were in the March 2020 COVID-19 crash earlier. The analyst thinks that investors should now focus on the likelihood of tariff adjustments from comments about negotiations, the impact on consumer-focused companies, and the potential for demand destruction. He even thinks that companies may refuse to provide guidance in the first-quarter earnings calls due to the persistent tariff uncertainty.\nIves thinks that a lot of tech companies will not be able to absorb high tariff increases and rather this cost will be passed on to the consumers which will lead to significant margin erosion and even potential sales declines. He indicated that tech stocks are currently pricing in a 10% to 15% cut to numbers. He suggests that investors should now look at companies with strong long-term potential as he believes earnings may normalize in 2025 and 2026. The analyst also addressed the defensive performance of defense contractors. While acknowledging the relative stability here, Ives cautioned that even these even such sectors are not immune to tariffs. He noted the significant foreign component, specifically 40% to 50% in some instances, in hardware and other sectors.\nOur Methodology\nWe sifted through the financial media reports to compile a list of the top NASDAQ stocks to buy for 2025. We then selected the 13 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 900 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nNumber of Hedge Fund Holders: 234\nAlphabet Inc. (NASDAQ:GOOGL) is a tech company that operates through three segments. The Google Services segment provides products and services like ads, Chrome, Gmail, and YouTube. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, and data & analytics, among others. The Other Bets segment sells healthcare-related and internet services.\nOn March 31, Ken Gawrelski, an analyst at Wells Fargo, reaffirmed an Equal Weight rating on the company while lowering the price target to $167 from $184. This cautious sentiment is a result of the company’s current trough multiples and bearish investor sentiment. This is because they believe that Google’s search business is put at risk by new AI-related technologies.\nHowever, the increasing demand for AI infrastructure and GenAI solutions has improved the adoption of GCP (Google Cloud Platform). GCP recently outpaced the entire cloud market. The company’s overall Cloud segment rose by 30$ year-over-year in Q4 2024. Notably, the company’s 6th-gen TPU called Trillium enhances AI workload significantly. Alphabet Inc.’s (NASDAQ:GOOGL) AI-developed platform called Vertex AI increased its customers by fivefold in Q4.\nOakmark Equity and Income Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOGL) in its Q4 2024 investor letter:\n“Alphabet Inc. (NASDAQ:GOOGL) was the top contributor during the quarter. Despite ongoing litigation with the Department of Justice in its antitrust case, the U.S.-headquartered interactive media and services company’s stock price rose after posting solid third-quarter earnings. In the Search division, the company generated low-teens year-over-year revenue growth and management highlighted that they’re seeing strong user engagement with their new AI Overviews feature. The biggest upside surprise came from the Cloud division, where revenue growth accelerated to 35% and margins reached a record of 17%. This performance was driven by client demand for AI Infrastructure and Generative AI Solutions as well as core Google Cloud Platform (GCP) products. We continue to believe Alphabet is a collection of great businesses that can unlock further value over the long term through its world-class AI capabilities.”\nOverall, GOOGL ranks 4th on our list of the best NASDAQ stocks to buy so far in 2025. While we acknowledge the growth potential of GOOGL, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than GOOGL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nAlphabet is strengthening its competitive position in the search and cloud with the infusion of AI amid challenging macroeconomic conditions.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Booking Holdings Inc. (NASDAQ:BKNG) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential […]\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Tesla Inc. (NASDAQ:TSLA) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nWe recently published a list of the 12 Reddit Stocks with High Potential. In this article, we are going to take a look at where Wyndham Hotels & Resorts Inc. (NYSE:WH) stands against other Reddit stocks with high potential. On April 15, Monica Guerra, Morgan Stanley Wealth Management Head of US Policy, joined ‘Closing Bell […]\nAlphabet (GOOGL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-53_Alphabet (GOOG) Fell in Q1 Despite Meeting Earnings Expectations",
    "date": "",
    "content": "Title: Alphabet (GOOG) Fell in Q1 Despite Meeting Earnings Expectations\nDate: 2025-04-16 13:53\nURL: https://finance.yahoo.com/news/alphabet-goog-fell-q1-despite-135322398.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOakmark Funds, advised by Harris Associates, released its “Oakmark Fund” first quarter 2025 investor letter. A copy of the letter can be downloaded here. The fund’s investor class returned 1.14% in the first quarter, compared to a -4.27% return for the S&P 500 Index. The fund has returned 12.76% since its inception compared to the index return of 10.44% over the same period. The largest contributors to the fund for the quarter were financials and consumer staples while consumer discretionary and communication services detracted. In addition, you can check the fund’s top 5 holdings to determine its best picks for 2025.\nIn its first quarter 2025 investor letter, Oakmark Fund emphasized stocks such as Alphabet Inc. (NASDAQ:GOOG). Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, offers various platforms and services operating through Google Services, Google Cloud, and Other Bets segments. The one-month return of Alphabet Inc. (NASDAQ:GOOG) was -4.57%, and its shares lost 0.85% of their value over the last 52 weeks. On April 15, 2025, Alphabet Inc. (NASDAQ:GOOG) stock closed at $158.68 per share with a market capitalization of $1.918 trillion.\nOakmark Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its Q1 2025 investor letter:\n\"Alphabet Inc. (NASDAQ:GOOG) was the top detractor during the quarter. The U.S.-headquartered company’s stock price declined despite having posted fourth-quarter 2024 earnings that were in line with consensus expectations. Search revenue growth remained strong, and management reiterated that the new “AI Overviews” feature is driving higher engagement with comparable monetization. The one miss during the quarter was in the Cloud segment, where revenue grew 30% year-over-year but fell slightly short of consensus expectations. We believe the shortfall was largely due to short-term capacity constraints and that the long-term growth outlook for Google Cloud remains robust. We continue to see Alphabet as a collection of great businesses that can further benefit from the company’s world class AI capabilities. With shares trading at just 15x our estimate of next year’s earnings per share, we believe the stock is meaningfully undervalued.\"\nA laptop and phone open to Google's services in an everyday setting.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 174 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of the fourth quarter which was 160 in the previous quarter. In 2024, Alphabet Inc. (NASDAQ: GOOG) achieved a revenue growth of 14% compared to 2023, reaching $350 billion. For the fourth quarter, the revenue was $96.5 billion, reflecting a 12% increase in both reported and constant currency. While we acknowledge the potential of Alphabet Inc. (NASDAQ:GOOG) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nWe covered Alphabet Inc. (NASDAQ:GOOG) in another article, where we shared Vulcan Value Partners' views on the company. In addition, please check out our hedge fund investor letters Q1 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\nThe tech market took it on the chin on Wednesday as the trade war picked up steam and the Federal Reserve sounds like it's not going to bail out the market.  Big tech in both the U.S. and China were hit hard today.  Broadcom (NASDAQ: AVGO) fell as much as 6.7%, Alibaba Group (NYSE: BABA) dropped 5.6%, and JD.com (NASDAQ: JD) fell 6.4%.\nFedEx's surcharges are expected to remain in effect until May 2, when the duty-free de minimis trade provision officially ends.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nIt can be a smart strategy, provided you understand what you’re risking.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-10_Google Sued for $6.6 Billion_ Did It Rig the Internet_",
    "date": "",
    "content": "Title: Google Sued for $6.6 Billion_ Did It Rig the Internet_\nDate: 2025-04-16 14:10\nURL: https://finance.yahoo.com/news/google-sued-6-6-billion-141007324.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAlphabet's Google (GOOGL) just got hit with a lawsuit that could cost up to 5 billion ($6.6 billion)and it's not coming from regulators this time. A massive UK class action claims Google weaponized its default search engine status to freeze out competitors and force British businesses to overpay for digital ads. Filed at the Competition Appeal Tribunal, the lawsuit says Google struck deals with Android phone makers and paid Apple (NASDAQ:AAPL) to make its search engine the default across devices, locking in market control and pushing ad prices higher than they should've been.\nLeading the charge is competition law expert Or Brook, who argues UK businesses had no real choice: if you wanted visibility online, you had to play by Google's rulesand pay up. The claim alleges that Google built a walled garden around search ads, where it not only dominated volume (over 90% of UK searches) but also offered enhanced functionality only through its own channels. Over 200,000 businesses are said to have been impacted. Brook didn't hold back: Google has been leveraging its dominance in the general search and search advertising market to overcharge advertisers.\nGoogle's response? Predictable. The company called the lawsuit speculative and opportunistic, and insists people use Google because it's helpfulnot because they're forced to. But the timing couldn't be worse. Britain's Competition and Markets Authority is already investigating Google's grip on digital ads, and the global antitrust spotlight on Big Tech is only getting brighter. If this legal fight gains momentum, it could mark a major turning point in how digital ad ecosystems are governedand priced.\nThis article first appeared on GuruFocus.\nWell-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL). Brown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet’s core internet search business. Details About Brown’s Decision and His Motivation After selling half of his GOOG […]\nMiddle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-33_After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street",
    "date": "",
    "content": "Title: After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street\nDate: 2025-04-16 14:33\nURL: https://finance.yahoo.com/news/after-surge-to-record-highs-gold-overtakes-magnificent-7-as-the-most-crowded-trade-on-wall-street-143338618.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGold has surpassed the \"Magnificent Seven\" tech stocks as the most crowded trade on Wall Street as the precious metal surged to record highs this year amid volatile markets and an uncertain economic backdrop.\nAccording to the latest Bank of America fund managers survey published this week, nearly half of the fund managers surveyed (49%) see long gold, or bets that gold prices will rise, as the most crowded trade in the market right now. This marks the first time in two years that fund managers did not see the Magnificent Seven as Wall Street's most crowded trade, according to the survey.\nGold futures (GC=F) on Wednesday rose to an all-time high of $3,334 as investors continued to favor the safe-haven asset amid a falling US dollar (DX-Y.NYB) and tariff uncertainty.\nGold prices have surged more than 27% year to date, while the Magnificent Seven tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), Tesla (TSLA), and Nvidia (NVDA) — are down considerably.\nRead more: How to invest in gold in 4 steps\nTesla stock has led Magnificent Seven losses and is down about 38% since the start of 2025. Apple stock has fallen 21%.\nNvidia stock has also declined 21% year to date. In a regulatory filing, the AI chip giant warned of a multibillion-dollar impact from US export controls on China, which weighed on shares.\nShares of Alphabet, Microsoft, Meta, and Amazon — the remainder of the Magnificent Seven — are all down by double-digit percentages since the start of the year.\nGold's rally comes as central banks' demand hit all-time highs last year and as investors increased inflows into physical gold-backed exchange-traded funds (ETFs).\n\"The new highs in gold are signaling a shift in appetite for US assets,\" Ryan McIntyre, senior managing partner at asset manager firm Sprott, recently told Yahoo Finance.\n\"Confidence in the US has clearly been shaken, so people are looking to diversify.\"\nWall Street analysts have remained bullish on gold, upping their price forecasts on the precious metal even amid its fast ascent.\nSome 42% of fund managers expect gold will be the best-performing asset of 2025, up from 23% in March, according to Bank of America.\nThe firm's survey also showed investors have rotated out of US assets by a record amount over the past two months, with 73% of respondents saying \"US exceptionalism\" has peaked.\nInes Ferre is a Senior Business Reporter for Yahoo Finance. Follow her on X at @ines_ferre.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nSTH MVRV dropped to 0.82, signaling investor stress — while long-term holders quietly accumulate.\nSemiconductor stocks sank Wednesday after Nvidia and Advanced Micro Devices warned they would take a hit after the Trump administration moved to limit the chipmakers' exports to China.\nOppenheimer analysts on Wednesday initiated coverage of Lyft with an \"outperform\" rating, writing that they expect the company to benefit as ridesharing continues \"to challenge the rising cost of car ownership.\"\nOther companies hit hard include a medical device maker, a semiconductor firm and the maker of Vans sneakers.\nGold futures opened at $3,248.40 an ounce on Wednesday, up from Tuesday's close of $3,218.70. Gold's highest opening price in history follows ongoing uncertainty about changing U.S. tariff policies and the U.S. inflation outlook.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-56_There are 'definitely buying opportunities' in the tech sell-off",
    "date": "",
    "content": "Title: There are 'definitely buying opportunities' in the tech sell-off\nDate: 2025-04-16 14:56\nURL: https://finance.yahoo.com/video/definitely-buying-opportunities-tech-sell-145640214.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNvidia (NVDA), Advanced Micro Devices (AMD), and ASML (ASML) are dragging the market lower as investors weigh the impact of the US-China trade war and a potential economic slowdown fueled by US President Trump's policies.\nSummit Global Investments chief investment officer David Harden sits down with Madison Mills and Brad Smith to discuss how to play the tech sector, comparing Microsoft (MSFT), Nvidia (NVDA), Tesla (TSLA), and Alphabet (GOOG, GOOGL).\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief here.\nIt's time now for today's strategy session. US stocks opening in the red this morning with tech leading the losses here. Options data showing investors are positioning for further losses in mega cap tech and semis ahead of earnings. That's according to data from Bloomberg. Joining us now with more, David Harden, Summit Global Investments CIO. David, great to speak with you this morning. Certainly a lot of pain for the big tech names this morning.\nThank you.\nAre you buying big tech at these levels?\nWell, I think there's some definitely buying opportunities that are coming available. For example, one of the things that I like is Google. Google has $25 billion in free cash flows last quarter. It's it's it's growing at double digits year-over-year. Its profit margins are great. Its return on equity is around 30%. And the PE is now finally getting down into those reasonable levels you can consider 16, 17, 15. So I think I think these are buying opportunities to start accumulating more positions in something like a Google.\nI think what you're highlighting is the, you know, this one thing is not like the other in the tech trade even as you're looking at what is more of a platform play where there's perhaps more of a reason to believe that the consumers would flow into free products that a Google might offer online versus what we're seeing in some of the products and propensity to spend in some of the other tech plays where there might be a consumer pullback in those discretionary dollars. How do you continue to look across these companies once we get into earnings and see how they're forecasting and guiding for the rest of the year on that?\nYeah, I think that's really important because where did their earnings come from, right? And and how are they tied to tariffs? That's really important. And how does those tariffs impact like advertising for Google. So you want to look kind of through those earnings into the consumer and and see what that consumer's doing and how that consumer's acting. And I think that's another play in tech. There is a separation. What? Are they hardware? Like Apple's had to navigate a lot more tariff news than Google's had to navigate, even though they're both navigating it.\nAnd we're starting to see individual companies being used as tools in this trade war. Obviously with Nvidia's specific chips being impacted by export controls, to what extent does that change any fundamental view you have on these stocks or should investors look past any of that daily headline news on tariffs?\nI I I think absolutely, you have to consider that and you have to manage your your risk here. Risk is really, really important in these markets and managing that is essential. So where you have the H20 chip, for example, invidia, they have clearly shown last night on their earnings that they have a difficult time more difficult time than some of these other tech names. So look for tech names that are more US based. Look for tech names that have more um say high-quality earnings. Even though somebody could question Google's high quality earnings, their earnings scores are not very good, but it is more US based. It is more consumer based in the US. And so that's very, very important in tech.\nIt seems like we've all been asking the question of what's the next big catalyst to drive conviction within the markets. Does that mean the AI trade or the fast-paced growth cycle for the AI trade is dead?\nNo, I don't think so because let's face it. Probably 10 minutes ago you were looking at AI, or I was looking at AI, or somebody was looking at some agent and the and the new things that are coming out with AI agents and things of this nature are absolutely impactful. The power of AI is growing. It's not shrinking. We're using it more. And it will continue to spread. So I think that trade's not done. I think there'll continue to be infrastructure build outs and AI things, but it has to go past just the technology. You have to look into the in industrial side of tech and where are they putting and building these centers at.\nI want to get to one of your cells, but first really quickly, would you buy Nvidia at these levels?\nUh probably not right now. No. I would be if you're if you're in it, it's time to hold and be patient. But if you're looking to buy, I think there's better opportunities to buy.\nAnd I know one of them is Microsoft, correct?\nI if you're looking at the two comparison, yes, Microsoft today, Nvidia's down more 6-7%, Microsoft's down in one, one and a half right now. I I think that's a safer play. It's a little bit more if if you will ingrained in our society. The revenues are are more um consistent. And so that's something that I would look at is more something like a Google or Microsoft. Both of those I would consider buying opportunities, especially at these levels.\nAnd I know a sell for you is one member of the mag 7. Talk to us about Tesla.\nWell, I think Tesla's had some negative earnings. We know that and um it's under pressure. I think every Tesla's uh I I saw a sticker on the back of a Tesla the other day that said something like, I bought this post crazy. So this is this is very, very important right now in our society. But having said that, I think Elon Musk is going to tell you when it's the right time to buy Tesla. And he hasn't done that yet. So he he's outspoken. We know what he's capable of. And until he's ready to let us know it's the right time to buy, I think it's you avoid that stock right now.\nOutside of tech, where's your favorite trade, your top idea right now?\nAnd I think I think outside of tech, you're going to have to look at some of the healthcare companies that have really been hurt with the Pharmatech news and other things.\nIt seems like they're next though in the docket for what potential tariffs may look like.\nOh, absolutely. So look for those healthcare companies that are not necessarily tied to pharma and they get their revenue, surgical centers and other places that are hospital-based, that are US-based, that we are going to use on a daily basis, but really are not tied to that. Those are the ones that have been kind of the baby been thrown out with the bath water. Their their valuations are very good right now.\nAbsolutely. David, great to see you here in studio. Thanks for taking the time with us this morning.\nThank you.\nAbsolutely.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\n“I don’t own Nvidia (NVDA), but this is the first time I’m really starting to look at (Nvidia)” stock, prominent CNBC contributor Stephanie Link said on the channel today. Link suggested that NVDA would rebound significantly over the longer term, and she noted that she had been buying more shares of one of NVDA’s rivals, […]\nGold bumped the 'Magnificent Seven' tech stocks to take the top spot as a crowded trade, according to a BofA survey.\nBuying stocks when overall markets are falling can seem dangerous and counterintuitive.  A great example would have been buying shares of quality companies amid the market chaos of 2020.  While it wasn't an easy time to buy stocks given the uncertainty ahead, doing so could have resulted in some significant gains for investors.\nThe stock market has been in turmoil so far this year amid the tariff-related issues that threaten to send the U.S. economy into a potential recession, and a big drop in consumer sentiment this month has added to the overall negativity.  So, SoundHound is at the beginning of a terrific growth curve, considering that it expects to generate $167 million in revenue this year at the midpoint of its guidance range.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nTSMC, the main global producer of advanced chips used in artificial intelligence applications, is set to report a 57% leap in first-quarter profit on Thursday, though it is also likely to flag risks from U.S. President Donald Trump's trade policies.  Taiwan Semiconductor Manufacturing Co is expected to report a net profit of T$354.6 billion ($10.92 billion) for the three months ended March 31, according to a LSEG SmartEstimate drawn from 18 analysts.\n(Reuters) -Californians further soured on Tesla in the first quarter, pulling down the electric-vehicle maker's registrations by 15% as backlash against Elon Musk's company intensified in the state that has embraced EVs most across the United States.  There have been relentless protests in many cities in California - echoing the backlash in other countries - against Musk's involvement in U.S. President Donald Trump's administration and his embrace of far-right politics in Europe, a key factor behind Tesla's 13% drop in first-quarter deliveries globally.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-04_What Makes Alphabet (GOOG) a Better Stock Compared to its Peers_",
    "date": "",
    "content": "Title: What Makes Alphabet (GOOG) a Better Stock Compared to its Peers_\nDate: 2025-04-16 15:04\nURL: https://finance.yahoo.com/news/makes-alphabet-goog-better-stock-150444264.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMiddle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to increase cash goal levels by roughly 5% for each portfolio. In the quarter, the firm sold 3% more than it bought. In Q1 2025, the US Portfolios returned -3.7% compared to -4.6% for the S&P 500. It’s Core U.S. portfolios returned -0.7% while Russell 2000 returned -9.8%, S&P 600 returned -9.3% and Nasdaq generated -10.4% for the same period. However, its European Portfolios appreciated by 9.2%. In addition, please check the fund’s top five holdings to know its best picks in 2025.\nIn its first quarter 2025 investor letter, Middle Coast Investing emphasized stocks such as Alphabet Inc. (NASDAQ:GOOG). Alphabet Inc. (NASDAQ:GOOG), the parent company of Google, offers various platforms and services operating through Google Services, Google Cloud, and Other Bets segments. The one-month return of Alphabet Inc. (NASDAQ:GOOG) was -4.57%, and its shares gained 1.15% of their value over the last 52 weeks. On April 15, 2025, Alphabet Inc. (NASDAQ:GOOG) stock closed at $158.68 per share with a market capitalization of $1.918 trillion.\nMiddle Coast Investing stated the following regarding Alphabet Inc. (NASDAQ:GOOG) in its Q1 2025 investor letter:\n\"Alphabet Inc. (NASDAQ:GOOG) – We bought Alphabet (i.e. Google) in a few accounts. I’ve owned it before, but not for very long. I usually don’t focus on buying the biggest tech companies, even as we have the one portfolio with the large AMZN / AAPL positions.\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nAlphabet Inc. (NASDAQ:GOOG) is in 7th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 174 hedge fund portfolios held Alphabet Inc. (NASDAQ:GOOG) at the end of the fourth quarter which was 160 in the previous quarter. In 2024, Alphabet Inc. (NASDAQ: GOOG) achieved a revenue growth of 14% compared to 2023, reaching $350 billion. For the fourth quarter, the revenue was $96.5 billion, reflecting a 12% increase in both reported and constant currency. While we acknowledge the potential of Alphabet Inc. (NASDAQ:GOOG) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nWe covered Alphabet Inc. (NASDAQ:GOOG) in another article, where we shared Vulcan Value Partners' views on the company. In addition, please check out our hedge fund investor letters Q1 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\nCIBC lowered the firm’s price target on Celestica (CLS) to $120 from $150 and keeps an Outperformer rating on the shares following quarterly results. The firm says that while it is encouraged by Google (GOOGL) and Amazon’s (AMZN) 2025 Gen-AI related capex plans for datacenter buildouts that should benefit hardware suppliers including Celestica, what is less clear is the impact from U.S. export tariffs of 36% on Thailand, which is home to Celestica’s second-largest manufacturing location. This is\nAlphabet (GOOG) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nCEOs have warned on the economy because of Trump administration tariff policies. US Treasury Secretary Scott Bessent has a message for them all.\nThe lawsuit claims the tech giant abused its dominance and overcharged companies for search advertising services.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\nAI-chip darling Nvidia is getting hit today after warning it could take around a $5 billion hit from new, tighter US curbs on chips it exports to China. Sarah Kunst, the Founder and Managing Director at the VC fund Cleo Capital says the weakness in Nvidia share is a buying opportunity.\nSays saw ‘continued momentum’ in each of five businesses. Says securities services gained share. Says Markets had a ‘good quarter’. Says Equities revenues up 23% y/y. Says M&A revenue nearly doubled. Says USPB was up 2%. Says portfolio continued to perform in line with expectations. Says Transformation investments continue to modernize infrastructure. Says integrating AI directly into business operations. Says ‘confident in ability to continuing delivering, despite uncertainty of the moment’. Sa\nAlphabet (GOOGL) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-05_Celestica price target lowered to $120 from $150 at CIBC",
    "date": "",
    "content": "Title: Celestica price target lowered to $120 from $150 at CIBC\nDate: 2025-04-16 15:05\nURL: https://finance.yahoo.com/news/celestica-price-target-lowered-120-150545221.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCIBC lowered the firm’s price target on Celestica (CLS) to $120 from $150 and keeps an Outperformer rating on the shares following quarterly results. The firm says that while it is encouraged by Google (GOOGL) and Amazon’s (AMZN) 2025 Gen-AI related capex plans for datacenter buildouts that should benefit hardware suppliers including Celestica, what is less clear is the impact from U.S. export tariffs of 36% on Thailand, which is home to Celestica’s second-largest manufacturing location. This is important as 53% of Celestica’s 2024 external revenue was from Thailand, CIBC notes.\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities using  Tipranks' Stock Screener.\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee the top stocks recommended by analysts >>\nRead More on CLS:\nDisclaimer & DisclosureReport an Issue\nUp-and-Coming Celestica Stock (CLS) Quietly Capitalizes on AI Boom\nCelestica call volume above normal and directionally bullish\n3 Best Value Stocks to Buy Now, 3/13/2025, According to Analysts\n3 Best Value Stocks to Buy Now, 3/6/2025, According to Analysts \nCelestica Scores a Perfect 10, But New Tariffs Have Deeply Hurt Its Stock\nMiddle Coast Investing, an investment advisor firm, released its first-quarter investor letter. A copy of the letter can be downloaded here. Middle Coast Investing had a difficult but manageable first quarter, but everyone has suffered since the Liberation Day crash at the beginning of the second quarter. To manage the volatility, the firm decided to […]\nIt's no surprise that when companies dominate their industries, their stock prices tend to have long-term success. Apple and Amazon are two of the most widely discussed names when it comes to business...\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 17-00_Is Alphabet Inc. (NASDAQ_GOOGL) the Best Machine Learning Stock to Buy Now_",
    "date": "",
    "content": "Title: Is Alphabet Inc. (NASDAQ_GOOGL) the Best Machine Learning Stock to Buy Now_\nDate: 2025-04-16 17:00\nURL: https://finance.yahoo.com/news/alphabet-inc-nasdaq-googl-best-170024335.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks.\nGrand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to grow at a 34.8% CAGR from 2023 to 2030. Machine learning helps machines and systems learn from experience instead of through explicit programming. It uses algorithms to improve and analyze vast amounts of complex data to make informed decisions. Machine learning is quickly progressing as AI is rapidly expanding and transforming how businesses and individuals operate. These technological advancements are revolutionizing consumer experiences, and enabling convenient creation of digital services, products, and optimized supply chains. With this, startups can focus on specific solutions while larger companies can deliver comprehensive AI platforms.\nOn April 10, Amazon CEO Andy Jassy joined CNBC’s ‘Squawk Box’ to discuss the cost of AI and what has to happen to bring it down. Jassy emphasized that the growth in data center demand is now so significant that there is no foreseen attenuation here, even with ongoing macroeconomic uncertainties under tariffs. While there’s a general belief that the emergence of DeepSeek could now reduce the need for extensive data centers, processing power, and energy consumption previously forecasted at different tech companies, Jassy thinks that DeepSeek’s introduction did not disrupt any of this. Despite cost reductions that occurred have already over time, AI deployment still requires significant investment. He thinks that the current AI operations are expensive due to chip costs and other factors, but big techs, including his own company, would welcome any reductions in AI costs for customers moving forward.\nJassy underscored the demand for data centers despite tariff impacts and reflected optimism regarding lowering costs, which would potentially drive innovation and expanded use of AI across industries. AI is still limited and requires substantial human oversight as of now but it has massive potential across various sectors.\nWe sifted through ETFs and financial media reports to compile a list of the top ML stocks. We then selected the 10 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 900 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA user's hands typing a search query into a Google Search box, emphasizing the company's search capabilities.\nNumber of Hedge Fund Holders: 234\nAlphabet Inc. (NASDAQ:GOOGL) is a tech company that is currently leading in AI research and uses machine learning across its search engine, cloud services, and other offerings. It operates through three segments under the name of Google Services, Google Cloud, and Other Bets segments. The Google Cloud segment offers AI infrastructure, Vertex AI platform, cybersecurity, data and analytics, and other related services.\nRoth MKM recently reiterated a Buy rating on the company with a $220 price target on March 19. This sentiment was fueled by the company’s $32 billion Wiz acquisition. This is the largest acquisition in the company’s history. With this, Alphabet Inc. (NASDAQ:GOOGL) can offer improved cloud security and threat detection data across cloud environments. The company is also positioned for long-term AI growth due to its significant infrastructure. This includes data centers, GPUs, and TPUs.\nThe company’s advanced AI-powered features like AI Overviews in Search are monetized at the same rate as traditional search. For AI and cloud growth, the company is planning a $75 billion CapEx investment in 2025. This will particularly be focused on data centers and servers. Notably, the company’s Cloud business alone grew by 30% year-over-year in Q4 2024. The combined annual revenue from Cloud and Youtube exceeded $110 billion.\nOakmark Equity and Income Fund stated the following regarding Alphabet Inc. (NASDAQ:GOOGL) in its Q4 2024 investor letter:\n“Alphabet Inc. (NASDAQ:GOOGL) was the top contributor during the quarter. Despite ongoing litigation with the Department of Justice in its antitrust case, the U.S.-headquartered interactive media and services company’s stock price rose after posting solid third-quarter earnings. In the Search division, the company generated low-teens year-over-year revenue growth and management highlighted that they’re seeing strong user engagement with their new AI Overviews feature. The biggest upside surprise came from the Cloud division, where revenue growth accelerated to 35% and margins reached a record of 17%. This performance was driven by client demand for AI Infrastructure and Generative AI Solutions as well as core Google Cloud Platform (GCP) products. We continue to believe Alphabet is a collection of great businesses that can unlock further value over the long term through its world-class AI capabilities.”\nOverall, GOOGL ranks 4th on our list of the best machine learning stocks to buy now. While we acknowledge the growth potential of GOOGL, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than GOOGL but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWell-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL). Brown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet’s core internet search business. Details About Brown’s Decision and His Motivation After selling half of his GOOG […]\nThe stock market is in turmoil right now, and entering this week, the S&P 500 has declined by around 9% since the start of the year.  How can you keep your savings safe and still be invested in the stock market -- or is that even possible nowadays?  One blue chip stock you may be considering is Coca-Cola (NYSE: KO).\nWe recently published a list of the 12 Reddit Stocks with High Potential. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other Reddit stocks with high potential. On April 15, Monica Guerra, Morgan Stanley Wealth Management Head of US Policy, joined ‘Closing Bell Overtime’ on CNBC […]\nThe US stock market is closed Friday in observation of Good Friday. So is the bond market, which also closes early Thursday.\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 17-19_Prominent Investor Unloads His GOOG Stock",
    "date": "",
    "content": "Title: Prominent Investor Unloads His GOOG Stock\nDate: 2025-04-16 17:19\nURL: https://finance.yahoo.com/news/prominent-investor-unloads-goog-stock-171959265.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWell-known investor Josh Brown disclosed on CNBC recently that he had sold all of his shares of Alphabet (GOOG,GOOGL).\nBrown, the CEO of Ritholtz Wealth Management, stated that he was concerned about the impact of ChatGPT on Alphabet's core internet search business.\nA laptop and phone open to Google's services in an everyday setting.\nDetails About Brown's Decision and His Motivation\nAfter selling half of his GOOG stock earlier this year, Brown recently parted with his remaining shares.\n\"Google's (search engine) has never had to compete the way that it does now with younger generations jumping right into ChatGPT when they want to know something,\" Brown asserted. These young consumers \"are not looking for blue links and ads; they just want an answer,\" he explained.\nGoogle will have to find a way to deal with this challenge, the investor believes.\nBrown Suggests That GOOG Is Not Defensive\n\"I think this will be a defensive year,\" said Brown, who asserted that Alphabet and Meta (META) are \"the most reliant on ad revenue\" among large-cap tech names. But according to the investor, the moat around Meta's Instagram is \"arguably stronger\" than that of Google around search.\nWhile we acknowledge the potential of GOOG, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than GOOG but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at Insider Monkey.\nLONDON (Reuters) -Alphabet's Google is being sued in Britain for potential damages of up to 5 billion pounds ($6.6 billion) in a class action alleging the company abused its dominant market position in the online search industry.  The class action, filed at the Competition Appeal Tribunal on Tuesday, argues that Google's actions enabled it to charge higher prices for the advertisements that appear in search inquiries than it otherwise could in a competitive market.  It said the U.S. tech giant contracted phone makers to pre-install Google Search and the Chrome browser on Android devices and paid Apple to make it the default search engine on iPhones, with the intention of shutting out competition.\n(Bloomberg) -- Energy Secretary Chris Wright says Donald Trump’s administration is giving the “green light” to more US oil production, but the signal from the fracking company he used to run is flashing bright red.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsLiberty Energy Inc., which Wright led until his appointment to Trump’s cabinet, has tumbled\nWarren Buffett is famous because of the long-term success he has achieved running Berkshire Hathaway.  Second, it doesn't pay dividends despite the fact that Buffett often invests in dividend-paying companies.  Here's why that matters and why you might want to buy one of these three dividend payers he owns.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nPresident Trump’s 25% tariffs on the auto sector are the talk of the New York International Auto Show.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-24_Nvidia's $5.5B charge_ 'Nobody' should be 'surprised'",
    "date": "",
    "content": "Title: Nvidia's $5.5B charge_ 'Nobody' should be 'surprised'\nDate: 2025-04-16 20:24\nURL: https://finance.yahoo.com/video/nvidias-5-5b-charge-nobody-202431372.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNvidia (NVDA) and Advanced Micro Devices (AMD) plunge after comments from Federal Reserve Chair Jerome Powell deepened losses sparked by costs associated with new US restrictions on exports to China.\nFuturum CEO Daniel Newman sits down with Josh Lipton, joined by Defiance ETFs CEO and chief investment officer Sylvia Jablonski, to discuss the latest chip news and what it means for investors.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\nNvidia sinking. So after the chip maker disclosed that it would take a $5.5 billion dollar hit from the US government's surprise new controls on its semiconductor exports to China. For more on the latest, let's welcome now Daniel Newman, Futurum CEO. Daniel, it is great to see you here on set. Appreciate it from Texas. Um, you know, before J. Powell, frankly, this was the story of the day. It was chips, it was Nvidia. Nvidia is down here, Dan. It's not about 10%. It's getting clobbered in today's trade. I guess two, two questions to start. One, Dan, were you surprised by that news when you saw those headlines? And two, do you think down 10%, is that move justified in your opinion?\nYeah, first of all, nobody should have been surprised by this move. Really the administration's been giving the signal that it was going to clamp down. Now, what was interesting is this week, there was a bit of gyration because they cut this deal, they announced 500 billion dollars of AI supercomputers being built here in the United States. And then a day later, he pulls back on this new export licensing requirement.\nThat that, you bring that, Dan. That is an interesting point because there were some folks who thought Jensen Wong was going to be kind of shielded from this. Right?\nThey made a deal. I had a few reporters actually hit me up, do you think there was some tip for tat going on. And first of all, I think Trump needs to show, President Trump needs to show that there is no tip for tat. So whether it's, you know, Tim Cook bringing more manufacturing here, whether it's TSMC coming here. But I actually think on the other side of this, and maybe we come back to this, is that I actually think creating some certainty with the, with the community, the business community, about what type of benefit they can expect by onshoring and bringing manufacturing back here. I think that would be a great start. Having said that, national security, economic security, and AI are tightly correlated. Us giving the chips to China, whether it's the tuned down chips or the best chips coming through intermediaries, which they shouldn't be getting. This is something that's giving an advantaging China. There's a lot of people out there that are like, oh, well, this is going to only push their resolve. Do you think China is waiting because we're sending Nvidia chips, they're not investing in Huawei and building their own chips? You can be absolutely certain that they are. This war, this trade war, is largely being fought on the grounds of long-term economic domination. Long-term economic domination will only be had if we control the technology trade. Nvidia is at the forefront of that trade.\nAnd what do you think of from an investor standpoint? Here you have Nvidia falling yet again, 8 to 10%. You know, look what happened over the last couple days. It had recovered from its lows, right? And a lot of investors who got in short term experienced that bounce. Where, where do you think that looks like this week?\nYeah. I, I look at that line of people around the corner at $150 that just couldn't wait to buy. And you go, what is really changed? Well, first of all, you've got GPUs melting over at, at X and at OpenAI. There's so much demand there. Could Nvidia pivot some of its capacity, not focus so much on building specialized products for China, and make sure we meet all the capacity and demand that's out there for companies that are in the US that are trying to build? You've got $325 billion of CAPEX. And it's been reiterated. So whether it's been Sunder Pichai, whether it's been Satya Nadella, they're all planning to spend. And I genuinely believe, Sylvia, that the companies with, you know, the big operating leverage are going to look at this pullback as the moment to build AI infrastructure out. Because when we come out of this, and we will come out of this, there will be deals made. Calling that on the record right now. It may be a tough couple of months. When deals are made, we will see the economy accelerate. And those companies want to build the future and have that AI infrastructure in place. So the Googles and the Microsofts and the Amazons, they're going to buy Nvidia. Um, and one other thing, if I, if I may, I find it very interesting that everybody thinks that China and their push to build Huawei is going to be so successful. When AMD came out with a competitive product, no one believed they could build the software. Broadcom's making chips for the hyperscalers and everyone said, well, that's great, but they don't have CUDA. So it's not going to work as well. But suddenly, everybody believes that China and Huawei is going to build the CUDA competitive product that's going to undo Nvidia? I believe in China, I believe in their resolve. I don't believe that they have as much competition or much competitive capability today as people are suggesting.\nUNI Europa argues that American digital giants like Amazon benefit from unfair economic advantages in the world’s largest single market and should be dealt with accordingly.\nSNOW and MDB are well-known players in the database management system space. Which one is a better investment option?\nNvidia discloses that sales of its H20 chips to China would require a license ‘for the indefinite future’ from the U.S. Department of Commerce, AMD says a license requirement for chip exports will result in charges of up to $800 million, and ASML issues disappointing sales guidance.\nU.S. markets fell sharply Wednesday, with chip stocks leading the retreat as U.S.-China trade tensions spooked investors. The tech-heavy Nasdaq closed down 3.1%, the S&P 500 lost 2.2%, and the Dow Jones Industrial average fell 700 points, or 1.7%. Losses rippled across sectors, dragging the Russell 2000 down 1.4%.\nDavid Kostin, chief US equity strategist at Goldman Sachs, discusses expectations for US economic growth, the lack of liquidity in markets, and the outlook for earnings growth. He speaks on \"Bloomberg Open Interest.\"\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nNextEra (NEE) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.\nTrump wants to bring tech manufacturing to the US. There's little chance it will happen.\nWhales dumped more than $370 million in XRP this month, causing price drops and raising concerns among traders as selling pressure weighs on market sentiment.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-14_Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial",
    "date": "",
    "content": "Title: Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial\nDate: 2025-04-16 22:14\nURL: https://finance.yahoo.com/news/meta-saw-tiktok-highly-urgent-221403450.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nMeet the new most crowded trade on Wall Street. (It's not the Magnificent 7.)\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nOver a marathon three days of testimony, the Meta Platforms Inc. co-founder and chief executive officer clearly articulated how the social media market has evolved rapidly over time — which, if the judge agrees, could make it more difficult for the FTC to prove Meta dominates it.\nZuckerberg was composed, but occasionally evasive, when challenged to explain past emails and other private messages indicating a concerted effort to muscle out competitors.\nThose old messages and emails, gathered during the pre-trial discovery process, were more damning than his present-day testimony. The messages, often between Zuckerberg and other top Meta executives, painted a picture of an executive who was paranoid about his rivals and willing to buy competitors whenever possible.\nThe FTC is seeking to force Meta to sell off Instagram and WhatsApp, arguing that the two acquisitions have given Meta an illegal monopoly over parts of the social networking industry. Emails and documents presented at trial show that Meta, then called Facebook Inc., struggled to compete in the mobile app boom in the early 2010s, buying up successful competitors. The FTC said Meta bought the companies to eliminate direct competitive threats.\nMultiple Competitors\nZuckerberg and Meta’s lawyers, meanwhile, argued that Meta faces a wide array of competitors that fight for user attention, including ByteDance Ltd.’s TikTok, Google’s YouTube, Apple Inc.’s iMessage and Microsoft Corp.’s LinkedIn. On Wednesday, Zuckerberg said that TikTok, in particular, posed a “highly urgent” competitive threat when it sprang up in 2018.\n“We observed that our growth slowed down dramatically,” as TikTok gained popularity, Zuckerberg said Wednesday. “It was highly urgent, this has been a top priority for the company for several years.” Meta eventually rolled out a direct competitor, called Reels, that now drives a significant amount of video traffic for the company.\nZuckerberg was at times vague over his three days in court, and regularly disputed the FTC’s interpretations of his prior emails. As a leader, the way he communicated with staff was often blunt or harsh, and he spent time on the stand trying to add more nuance to what was written by his younger self. He occasionally clashed with the FTC’s lead lawyer, Daniel Matheson, who objected at one point that Zuckerberg wasn’t answering his questions.\nWhat’s unclear is how much weight those emails will ultimately have as US District Judge James Boasberg, who is presiding over the case, makes his decision. Meta has argued that the intent behind the purchases doesn’t matter, only whether those deals lead to consumer harm, which it disputes.\nBoasberg previously said the FTC will have a difficult time. Despite allowing the bulk of the case to proceed last November, Boasberg struck a skeptical tone about the FTC’s chances at trial. “Prevailing here, however, does not obscure the fact that the Commission faces hard questions about whether its claims can hold up in the crucible of trial,” the judge said. “Indeed, its positions at times strain this country’s creaking antitrust precedents to their limits.”\nBoasberg also said in a ruling shortly before the trial that the FTC must prove Meta is harming competition in the present day.\nSheryl Sandberg, the company’s former chief operating officer, followed Zuckerberg on the witness stand, facing sharp questioning from FTC lawyer Susan Musser.\nIf the FTC prevails, a spinoff of Instagram and WhatsApp would undo years of integration between the apps, disrupt two of the most popular digital consumer products in the world and potentially erase hundreds of billions of dollars in Meta’s market value. It would also raise serious questions about how the government evaluates and approves deals because the government allowed the transactions to go through at the time.\n‘Network Effects’\nPart of the FTC’s case involves the technical concept of “network effects,” meaning that the more users a company like Meta has, the more likely they are to retain a dominant position, because people are unlikely to switch to a service used by few people.\nBoasberg has remained largely silent during the questioning, but interjected during Zuckerberg’s testimony Wednesday to ask if network effects still really matter.\n“How much does it matter if your friends are on a particular platform if you can send content out of that platform? Why does it matter if your friends are there?” the judge said.\nZuckerberg said it doesn’t. “These apps now serve primarily as discovery engines,” he said. “People can take that content to messaging engines.”\nBigger Company\nUnder questioning by Meta lawyer, Mark Hansen, Zuckerberg refuted the FTC’s argument that Meta bought Instagram to bury a competitor. Instagram would not likely have been able to grow to the extent it has had it remained independent, he said. “Instagram has been built out into a much more vibrant service” as a result of the deal, Zuckerberg said.\nTaking a small online platform to a billion users and beyond is unlikely to happen without the backing of a larger company, he said. “Every company that has this level of scale is owned by a bigger company,” he said, citing TikTok and YouTube as examples.\nEarlier in the trial, it was revealed that Snap Inc.’s Evan Spiegel turned down a $6 billion acquisition offer from Facebook in 2013 for its Snapchat app. Zuckerberg said that the app would have grown more rapidly had it joined his company.\nZuckerberg sought to walk back some statements that he made in previous internal communications. He acknowledged that he sent a 2013 email saying that Facebook blocked advertising for messaging apps WeChat, Kakao and Line, in which he wrote the apps were “trying to build social networks to replace us.” On the stand this week, however, he said “it’s hard for me to characterize what their intent was.”\nMatheson also sought to show that Meta was aware of its antitrust risk years ago, including a possible breakup.\nHe displayed an email from 2018 in which Zuckerberg suggested that Meta should consider spinning off Instagram into a standalone company. “As calls to break up the big tech companies grow, there is a non-trivial chance that we will be forced to spin out Instagram and perhaps WhatsApp in the next 5-10 years anyway,” he wrote.\nAt one point, Zuckerberg was asked by Hansen to describe how he was evaluating the competitive threat posed by Instagram and others at the time of the deals. He referenced a quote from former Intel Corp. CEO Andy Grove: “Only the paranoid survive.”\n(Updates with color on Zuckerberg testimony starting in the first paragraph)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsAdjusted first-quarter profit fell to 4 cen\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsInterior Secretary Doug Burgum ordered the pause on\nUnderstanding what credit inquiries are, when they occur, and how they affect your credit can help you protect and improve your credit score.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where NVIDIA Corporation (NASDAQ:NVDA) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]