{
  "UNH": [
    "2025-04-30 18-26_Is UnitedHealth Group Inc. (UNH) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-04-29 08-00_3 ways Trump is answering (or dodging) questions on his historically bad 100-day stock market.txt",
    "2025-05-01 10-30_CVS posts Q1 earnings beat, raises full-year guidance.txt",
    "2025-05-01 18-42_Eli Lilly CEO waves off CVS-Novo Nordisk deal_ 'It feels a little like last decade'.txt",
    "2025-04-30 15-19_UnitedHealth names new CEO of Optum.txt",
    "2025-05-01 18-04_3 things we've learned from healthcare earnings.txt",
    "2025-04-30 15-02_Jim Cramer on UnitedHealth Group Inc. (UNH)_ We’ve Never Seen Anything Like This Collapse.txt",
    "2025-04-29 12-23_UnitedHealth Group Incorporated (UNH)_ Among Billionaire Israel Englander’s Stock Picks with Huge Up.txt",
    "2025-05-01 19-27_Jim Cramer_ UnitedHealth (UNH) Can “Do Whatever It Wants” Under Current Administration.txt",
    "2025-04-30 11-20_Humana reports strong first quarter earnings as Medicare Advantage costs hit the mark.txt",
    "2025-04-30 00-19_UnitedHealth Group Incorporated (UNH)_ One of the Best Long-Term Dividend Stocks to Buy According to.txt",
    "2025-05-01 20-30_Cigna’s Earnings Are About to Land. It’s Been a Wild Run for Health Insurers..txt",
    "2025-04-29 20-43_Is UnitedHealth Group (UNH) the Most Profitable Blue Chip Stock to Buy Now_.txt",
    "2025-04-30 12-00_These 4 Measures Indicate That UnitedHealth Group (NYSE_UNH) Is Using Debt Reasonably Well.txt",
    "2025-04-29 20-17_UnitedHealth names insider Patrick Conway as Optum CEO.txt"
  ],
  "XOM": [
    "2025-05-01 20-15_Exxon Growth Strategy Will Be Tested as It Reports Earnings.txt",
    "2025-04-30 08-30_If You'd Invested $10,000 in ExxonMobil Stock 5 Years Ago, Here's How Much You'd Have Today.txt",
    "2025-04-29 10-42_XOM, CVX, COP_ Don’t Miss the Bargain U.S. Energy Stocks Transcending Trump Tariff Mania.txt",
    "2025-05-01 20-03_Exxon Mobil, Chevron To Report As Oil Prices Slide. Are Buyback Cuts On The Table_.txt",
    "2025-04-30 13-15_Wall Street's Insights Into Key Metrics Ahead of Exxon (XOM) Q1 Earnings.txt",
    "2025-04-29 13-08_ExxonMobil Surges Ahead in Low-Carbon Push, BP and Shell Retreat.txt",
    "2025-05-01 23-00_Jobs report, Big Oil earnings, de minimis closure_ What to Watch.txt",
    "2025-04-29 17-33_Exxon Mobil Q1 Earnings Boosted by Upstream, Refining, Weighed by Chemicals, RBC Says.txt",
    "2025-04-30 12-45_ExxonMobil's Q1 Earnings on Deck_ Should You Stay Invested or Exit_.txt",
    "2025-05-01 21-27_Chevron & Exxon Mobil Earnings_ What to Expect.txt",
    "2025-04-29 13-55_BP Stock Drops as Earnings Miss, Buyback Cut. It’s a Warning for Exxon, Chevron..txt",
    "2025-04-29 12-40_Jim Cramer on Exxon Mobil Corporation (XOM)_ “We wanna stay away from Exxon” – Out of Favor in a Low.txt",
    "2025-04-29 13-27_Should You Stick With Chevron Before Its Q1 Earnings Drop_.txt",
    "2025-05-01 09-00_Stocks To Watch in May—And What to Watch For.txt",
    "2025-05-01 18-16_Court hearing in Exxon's dispute over Chevron-Hess deal set for May 26, sources say.txt"
  ],
  "GS": [
    "2025-04-29 14-31_Alphabet Leads Busiest Day for Euro Bond Sales Since January.txt",
    "2025-05-01 14-00_Goldman Sachs Group Insiders Sold US$69m Of Shares Suggesting Hesitancy.txt",
    "2025-04-29 16-25_Goldman Sachs CEO David Solomon on the stock market chaos_ 'Things will settle down'.txt",
    "2025-04-30 18-28_Is The Goldman Sachs Group Inc. (GS) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-04-30 10-04_Foreign demand for US assets seen waning unless USD slides more, says Goldman Sachs.txt",
    "2025-04-30 11-22_Jim Cramer Says The Goldman Sachs Group, Inc. (GS) CEO David Solomon’s Quarter Call Was ‘Extraordina.txt",
    "2025-04-30 20-05_Mexico Economy Narrowly Dodges Recession Amid US Trade Chaos.txt",
    "2025-04-29 12-44_Goldman’s Solomon Says Markets to ‘Settle Down’ After Chaos.txt",
    "2025-04-30 08-00_M&A is slowing in US but accelerating worldwide during new Trump era.txt",
    "2025-04-29 08-50_Trending tickers_ AB Foods, AstraZeneca, Amazon, Deutsche Bank and Porsche.txt"
  ],
  "JPM": [
    "2025-04-29 14-31_Alphabet Leads Busiest Day for Euro Bond Sales Since January.txt",
    "2025-04-30 12-12_JPMorgan vs. Bank of America_ Which Big Bank Offers Better Value_.txt",
    "2025-04-29 11-00_Is JPMorgan Large Cap Value Fund A (OLVAX) a Strong Mutual Fund Pick Right Now_.txt",
    "2025-04-30 18-15_Visa CEO on economic slowdown, new stablecoin deal, and AI agents that shop for you.txt",
    "2025-05-01 13-39_Morgan Stanley to Offer Crypto Trading to E_Trade Customers.txt",
    "2025-04-30 19-05_Oil Slump Accelerates on Signs OPEC+ Will Maintain Higher Output.txt",
    "2025-04-30 10-20_Is JPMorgan Diversified Return U.S. Mid Cap Equity ETF (JPME) a Strong ETF Right Now_.txt",
    "2025-04-29 06-53_JPMorgan Hires CDH Investments Chief to Strengthen Asia Pacific Push.txt",
    "2025-05-01 20-23_JPMorganChase Files Form 10-Q for the Quarter Ended March 31, 2025.txt",
    "2025-04-30 13-30_JPMorganChase Advances Innovations in Benefits to Improve Financial Health for Consumers.txt",
    "2025-04-30 18-27_Is JPMorgan Chase & Co. (JPM) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-04-29 19-33_Oil Tumbles as Trump’s Trade War Pummels Outlook for Demand.txt",
    "2025-04-30 20-05_Mexico Economy Narrowly Dodges Recession Amid US Trade Chaos.txt",
    "2025-04-30 08-00_M&A is slowing in US but accelerating worldwide during new Trump era.txt",
    "2025-04-30 17-15_51-Year-Old Making $4,970 a Month In Dividends Shares His Top 6 Stocks, Aims To 'Create Generational.txt",
    "2025-04-30 09-44_Oil Traders Brace For Another Saudi-Led OPEC+ Oil Supply Surge.txt"
  ],
  "MCD": [
    "2025-05-01 15-56_McDonald’s to test expanded beverage menu this year.txt",
    "2025-05-01 17-51_McDonald's (NYSE_MCD) Reports Flat Q1 2025 Earnings With Revenue Of US$5,956 Million.txt",
    "2025-05-01 20-42_McDonald's Stock Slides On Earnings; U.S. Traffic Falls.txt",
    "2025-05-01 11-01_McDonald's US sales slump as low, middle-income consumers feel 'heightened anxiety'.txt",
    "2025-05-01 13-41_Tesla & Elon Musk, GM outlook, McDonald's sales_ Trending Tickers.txt",
    "2025-05-01 18-00_'People are visiting less'_ McDonald's joins Starbucks and Chipotle in traffic drop amid consumer 'p.txt",
    "2025-05-01 20-17_McDonald's Says Middle-Income Americans Are Feeling Squeezed Now Too.txt",
    "2025-05-01 11-10_McDonald's_ Q1 Earnings Snapshot.txt",
    "2025-05-01 14-54_McDonald’s U.S. Sales Decline in Shaky Economy.txt",
    "2025-05-01 11-04_McDonald's global sales post surprise drop as tariff chaos hurts consumer confidence.txt",
    "2025-05-01 15-15_McDonald's Q1 Earnings Beat, Revenues Miss Estimates, Stock Down.txt",
    "2025-05-01 13-30_McDonald's (MCD) Q1 Earnings_ How Key Metrics Compare to Wall Street Estimates.txt",
    "2025-05-01 11-33_McDonald's (NYSE_MCD) Reports Sales Below Analyst Estimates In Q1 Earnings.txt",
    "2025-05-01 15-12_Gloomy retail earnings show consumers are feeling the pinch of US tariffs.txt",
    "2025-05-01 14-54_McDonald's Quarterly Same-Store Sales Unexpectedly Decline as Macro Uncertainties Weigh on Consumers.txt",
    "2025-05-01 11-06_McDonald's store traffic falls unexpectedly to start the year as diners grow increasingly uneasy ove.txt",
    "2025-05-01 11-16_McDonald's Stock Slips as Revenue, Comparable Store Sales Disappoint.txt",
    "2025-05-01 23-06_Middle-Income Consumers Feel Pinched. That’s Bad for Some of America’s Best Known Brands..txt",
    "2025-05-01 12-10_McDonald's (MCD) Q1 Earnings Surpass Estimates.txt"
  ],
  "BAC": [
    "2025-04-29 12-52_Bank of America Corporation (BAC)_ One of the Cheap Quarterly Dividend Stocks to Buy Now.txt",
    "2025-04-30 12-18_Wall Street banks finally rid themselves of Elon Musk's X debt.txt",
    "2025-04-30 12-12_JPMorgan vs. Bank of America_ Which Big Bank Offers Better Value_.txt",
    "2025-04-30 08-51_Is Bank of America Corporation (BAC) Among The Best Warren Buffett Stock Picks For Beginners_.txt",
    "2025-04-29 18-37_Eli Manning to Put Together Bid for New York Giants Stake.txt",
    "2025-04-29 04-37_Bank of America Corporation (BAC)_ Among the Best Fintech Stocks to Buy in 2025.txt",
    "2025-04-30 18-15_Visa CEO on economic slowdown, new stablecoin deal, and AI agents that shop for you.txt",
    "2025-04-29 10-00_BofA Awards Critical Funding for Conservation of Historic Artworks.txt",
    "2025-04-29 08-00_Banks, fintech, and crypto are colliding in the new Trump era.txt",
    "2025-04-30 13-24_2025 Specialty Asset Management Outlook Released by Bank of America.txt",
    "2025-05-01 13-00_Possible Bearish Signals With Bank of America Insiders Disposing Stock.txt",
    "2025-04-30 08-07_Mark Mobius Says His Funds Hold 95% in Cash on Trade War Risks.txt",
    "2025-04-30 08-00_M&A is slowing in US but accelerating worldwide during new Trump era.txt"
  ],
  "MMM": [
    "2025-04-30 14-10_3M Announces Upcoming Investor Event.txt",
    "2025-04-30 11-10_Jim Cramer on 3M Company (MMM)_ ‘I Think That This One Could Go Up For A Long Time’.txt",
    "2025-04-30 18-29_Is 3M Company (MMM) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-04-29 14-22_3M Company (MMM)_ Among the Best Stocks to Buy According to D1 Capital’s Daniel Sundheim.txt"
  ],
  "CVX": [
    "2025-05-01 20-46_Chevron’s Buyback Strategy at Center Stage as It Prepares to Report Earnings.txt",
    "2025-04-29 10-42_XOM, CVX, COP_ Don’t Miss the Bargain U.S. Energy Stocks Transcending Trump Tariff Mania.txt",
    "2025-05-01 18-51_Chevron's Q1 Earnings On Deck With EPS Set to Slide 23.5%.txt",
    "2025-05-01 20-03_Exxon Mobil, Chevron To Report As Oil Prices Slide. Are Buyback Cuts On The Table_.txt",
    "2025-04-29 13-04_BP's Q1 Earnings & Revenues Miss Estimates on Weak Refining.txt",
    "2025-05-01 23-00_Jobs report, Big Oil earnings, de minimis closure_ What to Watch.txt",
    "2025-04-29 13-30_Chevron to Initiate Drilling Operations in Namibia's Walvis Basin.txt",
    "2025-04-30 16-54_Why ConocoPhillips, Chevron, and Cheniere Energy Stocks All Dropped Today.txt",
    "2025-04-30 12-45_ExxonMobil's Q1 Earnings on Deck_ Should You Stay Invested or Exit_.txt",
    "2025-04-30 08-42_Is Chevron Corporation (CVX) Among The Best Warren Buffett Stock Picks For Beginners_.txt",
    "2025-05-01 21-27_Chevron & Exxon Mobil Earnings_ What to Expect.txt",
    "2025-04-29 17-31_Chevron's Q1 Earnings Likely Flat Sequentially, RBC Capital Markets Says.txt",
    "2025-05-01 19-48_Last Chevron-chartered vessel starts to return oil cargo in Venezuela, data and source say.txt",
    "2025-04-30 22-05_3 Brilliant High-Yield Stocks to Buy Now and Hold for the Long Term.txt",
    "2025-04-30 13-18_The US economy may have avoided a recession so far. Here's how that could change..txt",
    "2025-04-29 13-27_Should You Stick With Chevron Before Its Q1 Earnings Drop_.txt",
    "2025-04-29 12-40_Jim Cramer on Chevron Corporation (CVX)_ “I doubt they’ll have anything good to say”.txt",
    "2025-05-01 18-16_Court hearing in Exxon's dispute over Chevron-Hess deal set for May 26, sources say.txt"
  ],
  "PFE": [
    "2025-05-01 12-57_Q1 2025 OPKO Health Inc Earnings Call.txt",
    "2025-05-01 12-54_Eli Lilly stock slips despite earnings beat, reaffirmed 2025 guidance.txt",
    "2025-04-30 08-33_Is Healthcare Losing the Status of Safe Haven_ ETFs in Focus.txt",
    "2025-05-01 15-51_LLY's Q1 Earnings Miss, Mounjaro & Zepbound Drive Sales, Stock Down.txt",
    "2025-04-30 13-10_Company News for Apr 30, 2025.txt",
    "2025-04-30 11-07_BridgeBio sales of new heart drug outstrip expectations.txt",
    "2025-05-01 08-50_Zacks.com featured highlights Centene, Pediatrix Medical, Pfizer, StoneCo and Banco Santander.txt",
    "2025-04-30 17-32_Pfizer (NYSE_PFE) Reports Q1 Earnings, Reaffirms 2025 Revenue Guidance at US$61-64 Billion.txt",
    "2025-04-30 11-05_Stock Market Crash_ 3 Absurdly Cheap Stocks to Load Up on for the Long Haul.txt",
    "2025-05-01 08-15_Want Safe Dividend Income in 2025 and Beyond_ Invest in the Following 3 Ultra-High-Yield Stocks..txt",
    "2025-05-01 12-40_Looking for Earnings Beat_ Buy These 5 Top-Ranked Stocks.txt",
    "2025-04-30 12-37_Pfizer First Quarter 2025 Earnings_ EPS Beats Expectations, Revenues Lag.txt",
    "2025-04-30 11-04_Market Rally at Risk as Tariffs Damage Spreads. And 5 Other Things to Know Today..txt",
    "2025-04-30 20-27_BridgeBio Breaks Out After Pfizer-Rivaling Heart Drug Obliterates Sales Expectations.txt",
    "2025-04-30 08-51_Will Pfizer Acquire Altimmune or Viking Therapeutics After Its Obesity Pill Setback_.txt",
    "2025-04-30 07-15_Prediction_ Pfizer's Loss May Be Viking Therapeutics' Gain.txt",
    "2025-05-01 16-06_'Declare victory and move on'_ Eli Lilly CEO on Trump tariff threat.txt",
    "2025-04-30 10-15_Pfizer's Dividend Yield Is 7.5%. Is It Still Safe_.txt",
    "2025-04-30 13-08_Boost Your Portfolio With These 5 Low Price-to-Book Stocks.txt",
    "2025-05-01 07-17_OPKO Health Inc (OPK) Q1 2025 Earnings Call Highlights_ Strategic Moves and Financial ....txt"
  ],
  "META": [
    "2025-05-01 21-11_Google Expands Access to Conversational AI in Search.txt",
    "2025-05-01 20-01_Today's Market_ S&P 500 Climbs as Meta, Microsoft Ease Fears Over AI Slowdown.txt",
    "2025-05-01 21-26_Buy Meta Platforms or Microsoft Stock After Beating Earnings Expectations_.txt",
    "2025-05-01 18-55_Why Is Meta (META) Stock Rocketing Higher Today.txt",
    "2025-05-01 20-58_Equities Advance as Microsoft, Meta Results Help Ease Economic Worries.txt",
    "2025-05-01 20-09_Reddit's strong revenue forecast signals advertising strength.txt",
    "2025-05-01 20-40_Stocks to Watch Recap_ Amazon, Apple, McDonald’s, Kohl’s.txt",
    "2025-05-01 20-45_Reddit Stock Surges Nearly 20% As Social Media Player Crushes Q1 Estimates.txt",
    "2025-05-01 20-12_Why Meta and Microsoft are drawing investors back to Big Tech.txt",
    "2025-05-01 20-05_Flag Top-Rated Stocks Set To Report Like Palantir. Here's How..txt",
    "2025-05-01 21-51_Why the AI Trade May Not Save the Market From Trump’s Tariffs for Long.txt",
    "2025-05-01 20-00_Stock market today_ Nasdaq surges as AI trade reignites amid Big Tech earnings, Dow, S&P 500 rise fo.txt",
    "2025-05-01 19-42_Why Nuclear Stocks Soared Today.txt",
    "2025-05-01 20-02_Why Applied Digital Stock Is Skyrocketing Today.txt",
    "2025-05-02 02-25_Dow Jones Futures Rise As China Says It's 'Evaluating' U.S. Trade Talks. Amazon, Apple Fall On Earni.txt",
    "2025-05-01 20-24_These Stocks Moved the Most Today_ Microsoft, Eli Lilly, Kohl’s, Apple, Tesla, Meta, Qualcomm, CVS, .txt",
    "2025-05-01 20-06_What AI Slowdown_ Nvidia Rallies As Meta, Microsoft Boost Data Center Spending..txt",
    "2025-05-01 20-49_These 3 Stocks Soared Following Strong Quarterly Results.txt",
    "2025-05-01 20-25_The Nasdaq soars as Big Tech earnings have stocks shrugging off recession alarms.txt",
    "2025-05-01 20-40_Stock Market Today_ Nasdaq Surges As Meta, Microsoft Recover Lost Ground; These Two Leading Growth S.txt"
  ],
  "HAL": [
    "2025-04-29 09-20_Old Faithful Fizzled Last Year, But Watch for a Spurt.txt",
    "2025-04-29 13-30_Halliburton Company (HAL)_ One of the Top Energy Companies with the Highest Upside Potential.txt",
    "2025-04-29 10-04_Halliburton Company Just Missed EPS By 60%_ Here's What Analysts Think Will Happen Next.txt",
    "2025-04-30 00-21_Is Halliburton Co. (NYSE_HAL) a Small-Cap Energy Stock Hedge Funds Are Buying_.txt",
    "2025-05-01 10-14_Nabors Q1 Loss Wider Than Expected, Revenues Decline Y_Y.txt",
    "2025-04-29 10-31_NOV's Q1 Earnings Miss Estimates, Revenues Decrease Y_Y.txt"
  ],
  "KO": [
    "2025-04-29 20-19_These Stocks Moved the Most Today_ GM, Tesla, Ford, JetBlue, Wolfspeed, SoFi, Nvidia, and More.txt",
    "2025-04-29 21-05_Why Coke Is Crushing Pepsi—and the S&P 500.txt",
    "2025-04-30 05-20_Q1 2025 Coca-Cola Co Earnings Call.txt",
    "2025-04-30 09-32_Tap Coke-Heavy ETFs on Upbeat Earnings and Guidance.txt",
    "2025-04-30 18-15_Visa CEO on economic slowdown, new stablecoin deal, and AI agents that shop for you.txt",
    "2025-05-01 13-59_The Coca-Cola Company (KO)_ Among the Best Stocks to Buy During Recession.txt",
    "2025-04-30 08-44_Is The Coca-Cola Company (KO) Among The Best Warren Buffett Stock Picks For Beginners_.txt",
    "2025-05-01 08-55_1 Dividend Growth Stock Down 45% to Buy Right Now.txt",
    "2025-04-30 07-09_Coca-Cola Co (KO) Q1 2025 Earnings Call Highlights_ Strong Growth Amid Currency Challenges.txt",
    "2025-04-29 20-02_Coca-Cola (KO) Jumps on Q1 Earnings Beat.txt",
    "2025-04-30 17-11_Coca-Cola's Localized Business Operations Make Tariff Impact 'Manageable,' RBC Says.txt",
    "2025-04-30 18-27_Is Coca-Cola Company (KO) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-05-01 18-00_Coca-Cola Board of Directors Declares Regular Quarterly Dividend.txt",
    "2025-04-30 11-52_Coca-Cola sales slip following boycott among Hispanic consumers.txt",
    "2025-05-01 20-52_Why Coca-Cola Consolidated Stock Plummeted Today.txt",
    "2025-04-30 21-22_Coca-Cola Consolidated_ Q1 Earnings Snapshot.txt",
    "2025-05-01 00-07_The Coca-Cola Company (KO)_ Jim Cramer Still Bullish — “Only Consumer Stock Hanging In There”.txt",
    "2025-05-01 14-00_How prebiotic soda Olipop leveraged social media to grow from a $100,000 investment to a $1.85 billi.txt",
    "2025-04-30 17-16_Buffett's Long-Term Bet on Coca-Cola Delivers 2,824% Return Over 36 Years.txt"
  ],
  "GOOGL": [
    "2025-05-01 21-11_Google Expands Access to Conversational AI in Search.txt",
    "2025-05-01 20-05_Amazon beats on Q1 earnings, but light Q2 guidance sends stock sliding.txt",
    "2025-05-01 09-34_Why Alphabet Inc. (GOOG) is Among the Best Augmented Reality Stocks to Buy According to Hedge Funds.txt",
    "2025-05-01 12-23_Google is reportedly showing ads in chats with some third-party AI chatbots.txt",
    "2025-05-01 19-00_Jim Cramer Says ‘I’ve Left Alphabet (GOOG)’.txt",
    "2025-05-01 16-00_You can now use Google's ChatGPT competitor AI Mode.txt",
    "2025-05-01 23-00_Reddit's AI play is for the Google crowd, not just the community scrollers.txt",
    "2025-05-01 11-00_Want Exposure to the AI Revolution_ This Brilliant Tech ETF Is All You Need..txt",
    "2025-05-01 12-28_Why Nvidia stock is popping after big quarters for Microsoft and Meta.txt",
    "2025-05-01 16-31_Google Adds More Reporting Elements for Performance Max Campaigns.txt",
    "2025-05-01 13-07_The most bought US stocks in Trump's first 100 days.txt",
    "2025-05-01 13-53_Alphabet Inc. (GOOGL)_ Jim Cramer Regrets Selling — “Bet on the United States of Google”.txt",
    "2025-05-01 15-05_CCME launches to take on anti-competitive smartphone platform duopoly.txt",
    "2025-05-01 17-33_Virtusa Leverages AI With Alphabet (NasdaqGS_GOOGL) to Enhance Digital Collaboration and Security.txt",
    "2025-05-01 12-34_Nasdaq Plan Will Bring Zero-Day Option Boom Closer to Single Stocks.txt",
    "2025-05-01 12-16_Why Tesla Stock is Up 18% Since Weak Q1_ Should You Book Profits_.txt",
    "2025-05-01 10-10_Big Tech's fortunes diverge as AI powers cloud, tariffs hit consumer electronics.txt",
    "2025-05-01 15-55_Tesla's Rough Quarter, Alphabet's Resilience, Chipotle's Burrito Slowdown, and More.txt",
    "2025-05-01 16-00_Google's AI Mode gets expanded access and additional functionality.txt",
    "2025-05-01 16-24_Roblox Presents 'Compelling Growth Opportunity,' Wedbush Says.txt"
  ],
  "DAL": [
    "2025-04-30 13-59_JBLU's Q1 Loss Narrower Than Expected, Revenues Decline Y_Y.txt",
    "2025-04-30 10-13_Delta Air Lines offering pay increase to employees for fourth consecutive year_ 'Invest in our peopl.txt",
    "2025-04-30 14-48_DAL vs. UAL_ Which Airline Stock is a Stronger Play Now_.txt",
    "2025-05-01 00-06_Delta Air Lines, Inc. (DAL)_ Jim Cramer Picks His Airline Trade — “Seven Times Earnings_ I’ll Take D.txt",
    "2025-05-01 08-11_Is Delta Air Lines, Inc. (DAL) Among The Lowest PE Ratio Stocks in S&P 500_.txt",
    "2025-05-01 10-55_Prediction_ Delta Air Lines Stock Will Soar Over the Next Few Years. Here's 1 Reason Why..txt",
    "2025-04-29 14-50_JetBlue pulls earnings outlook amid tariff uncertainty, following American and Delta.txt",
    "2025-05-01 04-39_1 Cash-Producing Stock for Long-Term Investors and 2 to Be Wary Of.txt"
  ],
  "CAT": [
    "2025-04-30 19-51_Why Caterpillar Stock Is Volatile Today.txt",
    "2025-05-01 02-34_Q1 2025 Caterpillar Inc Earnings Call.txt",
    "2025-04-30 12-03_5 Things to Know Before the Stock Market Opens.txt",
    "2025-04-30 18-27_Is Caterpillar Inc. (CAT) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-04-30 18-03_Caterpillar Announces Virtual 2025 Shareholder Meeting.txt",
    "2025-04-30 19-02_20 company reactions — good and bad — to Trump’s tariff war.txt",
    "2025-04-30 17-34_Caterpillar (NYSE_CAT) Reports Drop In Q1 Revenue And Net Income.txt",
    "2025-04-30 13-16_Caterpillar Offers Two Full-Year Outlook Scenarios Amid Tariffs as First-Quarter Results Trail Views.txt",
    "2025-04-30 14-30_Caterpillar Expects Tariffs to Cost Up to $350 Million This Quarter.txt",
    "2025-04-30 15-39_Caterpillar Says Tariffs May Cost Up to $350 Million This Quarter.txt",
    "2025-04-30 14-00_Caterpillar Gives Goods News About Trump Tariffs' Impact, But CAT Stock Fades.txt",
    "2025-05-01 15-44_Caterpillar's Strong Backlog, Reduced Cyclicality Drive Performance, Oppenheimer Says.txt",
    "2025-04-30 12-50_Equipment maker Caterpillar says tariffs may increase its Q2 costs by up to $350 million.txt",
    "2025-04-30 12-55_Caterpillar Inc. (CAT)_ Among the Best Stocks to Buy According to the Bill & Melinda Gates Foundatio.txt",
    "2025-05-01 14-41_Caterpillar raised at Baird as negative catalysts now baked into expectations.txt",
    "2025-04-30 16-54_CAT Q1 Earnings & Revenues Miss Estimates on Weak Volumes.txt",
    "2025-04-30 14-07_Caterpillar_ Q1 miss & record-high organic backlog growth.txt",
    "2025-04-30 15-05_Tariff turmoil prompts cloudy forecasts from companies for the year ahead.txt",
    "2025-05-01 23-02_Why Caterpillar Stock Crawled Higher on Thursday.txt",
    "2025-05-01 07-08_Caterpillar Inc (CAT) Q1 2025 Earnings Call Highlights_ Navigating Challenges with Record ....txt"
  ],
  "NVDA": [
    "2025-05-01 20-57_Analyst behind Nvidia's only Sell rating names top AI stock pick.txt",
    "2025-05-01 21-26_Intel Planning A Homegrown Challenge To Nvidia, Says It's 'Not A Quick Fix'.txt",
    "2025-05-01 17-30_Nvidia CEO Warns U.S. AI Controls May Slow Worldwide Tech Adoption.txt",
    "2025-05-01 16-10_Big Tech Stocks Have Had a Magnificent Day So Far.txt",
    "2025-05-01 20-05_Flag Top-Rated Stocks Set To Report Like Palantir. Here's How..txt",
    "2025-05-01 17-27_Nvidia Is Jumping Today -- Is the Artificial Intelligence (AI) Stock a Buy_.txt",
    "2025-05-01 16-11_Nvidia Stock Rises. The AI Trade Is So Back..txt",
    "2025-05-01 15-55_Artificial Intelligence IPO CoreWeave Pops On Microsoft, Meta Earnings.txt",
    "2025-05-01 20-06_What AI Slowdown_ Nvidia Rallies As Meta, Microsoft Boost Data Center Spending..txt",
    "2025-05-01 17-47_Microsoft Briefly Nabs Apple's Crown.txt",
    "2025-05-01 16-40_Why Nvidia Stock Bounded Higher Thursday.txt",
    "2025-05-01 17-27_Nvidia Eyes UAE Export Easing Ahead of Trump Visit.txt",
    "2025-05-01 17-24_Why Are Nvidia Shares Climbing Today.txt",
    "2025-05-01 17-34_Magnificent Seven Stocks_ Nvidia, Tesla Rally; Meta, Microsoft Surge On Earnings.txt",
    "2025-05-01 16-21_Nvidia, Anthropic reportedly clash over US chip export controls.txt",
    "2025-05-01 15-31_US weighs easing Nvidia chip curbs on UAE as Trump plans visit.txt",
    "2025-05-01 17-46_Nvidia takes aim at Anthropic's support of chip export controls.txt",
    "2025-05-01 17-29_Nvidia raised concerns about Huawei's growing AI capabilities with US lawmakers.txt"
  ],
  "MSFT": [
    "2025-05-01 20-05_Amazon beats on Q1 earnings, but light Q2 guidance sends stock sliding.txt",
    "2025-05-01 21-26_Buy Meta Platforms or Microsoft Stock After Beating Earnings Expectations_.txt",
    "2025-05-01 20-05_US Equities Markets End Higher Thursday as Investors Await Apple, Amazon Results.txt",
    "2025-05-01 20-58_Equities Advance as Microsoft, Meta Results Help Ease Economic Worries.txt",
    "2025-05-01 20-49_Why Microsoft Stock Had One of Its Best Post-Earnings Days in a Decade.txt",
    "2025-05-01 20-12_Why Meta and Microsoft are drawing investors back to Big Tech.txt",
    "2025-05-01 20-39_Amazon's Profit Forecast Misses Estimates.txt",
    "2025-05-01 21-51_Why the AI Trade May Not Save the Market From Trump’s Tariffs for Long.txt",
    "2025-05-01 20-02_Why Applied Digital Stock Is Skyrocketing Today.txt",
    "2025-05-02 02-25_Dow Jones Futures Rise As China Says It's 'Evaluating' U.S. Trade Talks. Amazon, Apple Fall On Earni.txt",
    "2025-05-01 20-24_These Stocks Moved the Most Today_ Microsoft, Eli Lilly, Kohl’s, Apple, Tesla, Meta, Qualcomm, CVS, .txt",
    "2025-05-01 21-07_Microsoft swaps law firms in shareholder case, hiring Trump adversary.txt",
    "2025-05-01 20-06_What AI Slowdown_ Nvidia Rallies As Meta, Microsoft Boost Data Center Spending..txt",
    "2025-05-01 20-49_These 3 Stocks Soared Following Strong Quarterly Results.txt",
    "2025-05-01 20-25_The Nasdaq soars as Big Tech earnings have stocks shrugging off recession alarms.txt",
    "2025-05-01 20-40_Stock Market Today_ Nasdaq Surges As Meta, Microsoft Recover Lost Ground; These Two Leading Growth S.txt",
    "2025-05-01 20-43_Microsoft Hikes Xbox And Game Prices Globally.txt",
    "2025-05-01 20-29_S&P 500 Gains and Losses Today_ Index Rises After Strong Start to Big Tech Earnings.txt",
    "2025-05-02 00-12_Why CoreWeave, Inc. (CRWV) Soared On Thursday.txt",
    "2025-05-02 00-11_Why Microsoft Corporation (MSFT) Soared On Thursday.txt"
  ],
  "AAPL": [
    "2025-05-01 22-26_Apple in 'early innings' of post-tariff adjustment phase.txt",
    "2025-05-01 22-43_Apple Says Most of Its Devices Shipped Into U.S. Will Be From India, Vietnam.txt",
    "2025-05-01 21-49_Apple Continues to See Stronger Demand for AI Products.txt",
    "2025-05-01 22-22_Apple warns of $900m hit from Trump’s trade war.txt",
    "2025-05-01 22-30_How Apple stock tends to trade following earnings.txt",
    "2025-05-01 22-22_Consumers Didn't Hoard iPhones in Advance of Tariffs.txt",
    "2025-05-01 21-49_Apple Expects to Pay a Wide Variety of Tariff Rates.txt",
    "2025-05-01 21-27_Apple Q2 earnings_ A breakdown of Apple's services segment.txt",
    "2025-05-01 22-00_Compared to Estimates, Apple (AAPL) Q2 Earnings_ A Look at Key Metrics.txt",
    "2025-05-01 23-15_Apple earnings call_ Biggest takeaways & comments from Tim Cook.txt",
    "2025-05-01 21-40_Apple (AAPL) Q2 Earnings and Revenues Surpass Estimates.txt",
    "2025-05-01 22-02_Apple Tops March-Quarter Targets On Record Services Revenue. But Stock Slips..txt",
    "2025-05-02 02-25_Dow Jones Futures Rise As China Says It's 'Evaluating' U.S. Trade Talks. Amazon, Apple Fall On Earni.txt",
    "2025-05-02 00-11_Apple CEO Tim Cook reveals how much Trump’s tariffs will cost the tech giant this quarter.txt",
    "2025-05-01 22-17_Apple earnings beat expectation as Americans rush to buy iPhones before tariffs.txt",
    "2025-05-01 21-40_Apple_ Growth in a Difficult Environment.txt",
    "2025-05-01 21-31_Apple_ Why this analyst isn't 'too concerned' about China tariffs.txt",
    "2025-05-02 00-25_Gold Heads for Weekly Loss as Traders Pare Back US Rate Cut Bets.txt",
    "2025-05-01 22-58_Tariffs To Take a Bite Out of Apple's Results.txt",
    "2025-05-02 01-01_Spotify submits app update to Apple with external link for purchases in US.txt"
  ],
  "NKE": [
    "2025-04-30 10-27_Publicis acquires Adopt to strengthen connection to sports culture.txt",
    "2025-04-29 14-14_Is Nike, Inc. (NKE) the Worst-Performing Blue Chip Stock So Far in 2025_.txt",
    "2025-05-01 12-37_E-Commerce Update - AI-Powered Payments Revolutionize Global Commerce.txt",
    "2025-05-01 13-00_Is Trending Stock NIKE, Inc. (NKE) a Buy Now_.txt",
    "2025-04-30 01-50_Deckers vs. Nike_ Which Shoe Stock Is the Better Buy Right Now_.txt",
    "2025-04-30 20-44_Nike Stock, Retailers Downgraded On Tariffs, 'Mild' Recession Expectations.txt",
    "2025-04-30 14-40_Wells Fargo downgrades Nike saying turnaround taking longer than expected.txt",
    "2025-04-30 20-36_Why Nike Stock Wilted on Wednesday.txt",
    "2025-05-01 21-15_NIKE, Inc. Declares $0.40 Quarterly Dividend.txt",
    "2025-04-30 12-00_The NFT market fell apart. Brands are still paying the price.txt"
  ],
  "JNJ": [
    "2025-05-01 10-40_FDA approves J&J’s Imaavy for generalised myasthenia gravis.txt",
    "2025-04-30 18-28_Is Johnson & Johnson (JNJ) the Best Dow Stock for the Next 12 Months_.txt",
    "2025-04-29 15-10_4 PFA studies in the spotlight at Heart Rhythm 2025.txt",
    "2025-04-29 12-33_Johnson & Johnson (JNJ)_ Among the Best Long-Term Dividend Stocks to Buy According to Billionaires.txt",
    "2025-05-01 12-00_If A Recession Hits, Will Medical Stocks Be A Safe Haven For Investors — Again_.txt",
    "2025-05-01 01-48_Trump Says Tariffs Politically Risky, But He’s Not Rushing Deals.txt",
    "2025-05-01 08-49_The Zacks Analyst Blog Highlights Amazon, Johnson & Johnson, Cisco Systems and NeurAxis.txt",
    "2025-04-30 12-29_Johnson & Johnson receives FDA approval for IMAAVY™ (nipocalimab-aahu), a new FcRn blocker offering .txt",
    "2025-04-30 20-17_Johnson & Johnson (JNJ)_ Jim Cramer Says “They Love the Weak Dollar” — Is This Quiet Giant Back in F.txt",
    "2025-04-30 17-30_Johnson & Johnson (NYSE_JNJ) Gains FDA Approval For IMAAVY™ To Treat Myasthenia Gravis.txt",
    "2025-05-01 16-06_'Declare victory and move on'_ Eli Lilly CEO on Trump tariff threat.txt",
    "2025-05-01 12-24_Pharma downplays tariff threat, even as risks remains unclear.txt",
    "2025-04-30 21-02_Top Stock Reports for Amazon.com, Johnson & Johnson & Cisco Systems.txt"
  ]
}