[
  "2025-05-01 14-54_McDonald's Quarterly Same-Store Sales Unexpectedly Decline as Macro Uncertainties Weigh on Consumers.txt",
  "2025-05-01 14-54_McDonald’s U.S. Sales Decline in Shaky Economy.txt",
  "2025-05-01 15-12_Gloomy retail earnings show consumers are feeling the pinch of US tariffs.txt",
  "2025-05-01 15-15_McDonald's Q1 Earnings Beat, Revenues Miss Estimates, Stock Down.txt",
  "2025-05-01 15-56_McDonald’s to test expanded beverage menu this year.txt",
  "2025-05-01 17-41_McDonald’s reports a significant sales decline in the U.S. as anxious customers pull back on spendin.txt",
  "2025-05-01 17-51_McDonald's (NYSE_MCD) Reports Flat Q1 2025 Earnings With Revenue Of US$5,956 Million.txt",
  "2025-05-01 18-00_'People are visiting less'_ McDonald's joins Starbucks and Chipotle in traffic drop amid consumer 'p.txt",
  "2025-05-01 20-17_McDonald's Says Middle-Income Americans Are Feeling Squeezed Now Too.txt",
  "2025-05-01 20-42_McDonald's Stock Slides On Earnings; U.S. Traffic Falls.txt",
  "2025-05-01 23-06_Middle-Income Consumers Feel Pinched. That’s Bad for Some of America’s Best Known Brands..txt",
  "2025-05-02 03-57_Q1 2025 McDonald's Corp Earnings Call.txt",
  "2025-05-02 07-04_McDonald's Corp (MCD) Q1 2025 Earnings Call Highlights_ Navigating Consumer Challenges and ....txt",
  "2025-05-02 11-00_‘72-Hour Rule’_ Debt Investors Take Fright at Trump’s Social Media Deluge.txt",
  "2025-05-02 11-58_McDonald’s reports 1% sales dip in Q1 2025.txt",
  "2025-05-02 12-12_Shake Shack Q1 Earnings & Revenues Miss Estimates, Increase Y_Y.txt",
  "2025-05-02 12-24_McDonald's (MCD) Sees Largest U.S. Sales Drop Since Pandemic as Tariffs Squeeze Consumers.txt",
  "2025-05-02 18-22_Airbnb CFO_ 'Absolutely have seen a decline in popularity of foreign travelers coming to the US'.txt",
  "2025-05-02 18-53_McDonald's Set for Recovery, Market Share Gains Despite Macro Pressures, UBS Says.txt",
  "2025-05-02 21-13_The Score_ Meta Platforms, McDonald’s, Kohl’s and More Stocks That Defined the Week.txt"
]