[
  {
    "title": "2025-04-14 07-14_Zacks Value Trader Highlights_ Exxon Mobil, Chevron and EOG Resources",
    "date": "",
    "content": "Title: Zacks Value Trader Highlights_ Exxon Mobil, Chevron and EOG Resources\nDate: 2025-04-14 07:14\nURL: https://finance.yahoo.com/news/zacks-value-trader-highlights-exxon-071400262.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChicago, IL – April 14, 2025 – Zacks Value Trader is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here: https://www.zacks.com/stock/news/2445093/energy-stocks-take-a-dive-values-or-traps\nWelcome to Episode #401 of the Value Investor Podcast.\n \n(0:15) - Can You Find Value In The Energy Industry or Are They Traps?\n(6:30) - Tracey Takes A Deep Dive Into 3 Stocks To Consider For Your Portfolio\n(32:20) - Episode Roundup: XOM, CVX, EOG\nPodcast@Zacks.com\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nIn April 2025, after the Liberation Day tariffs were put into place by the United States, crude oil plunged. WTI traded down to $56 a barrel and has been gyrating between $55 and $65 ever since.\nWhile lower oil prices can mean good news for consumers at the pump, it’s bad news for the energy producers who are unhedged and have certain breakeven levels.\nThe oil and natural gas stocks have gotten hammered due to falling commodity prices and the uncertainty from the tariff turbulence of 2025. Although oil escaped direct American tariffs.\nEnergy companies are lumped into different categories within the oil industry. In this podcast, Tracey talks about “Big Oil” which are the large, integrated oil companies and the American explorers and producers, or the “E & Ps.”\nThe Integrated Oil stocks, as an industry, are down just 3.9% year-to-date. But the American E&Ps, as an industry, are now down 27.8% on the year.\nThe E&Ps, which do not have refining, chemicals, or other divisions to offset their production, are much more volatile when oil sells off.\nJust because a stock sells-off and now has a low price-to-earnings (P/E) ratio, doesn’t mean that it’s a true value in the classical sense of the word.\nRemember, a true value stock is cheap on a P/E basis, but also has rising earning estimates.\nAre the energy stocks cheap, or just traps?\nExxon Mobil is a large American integrated oil company. Shares of Exxon are down 7.1% year-to-date but have finally started sinking in the last month, falling 10.6% in that time.\nExxon appears cheap with a forward price-to-earnings (P/E) ratio of just 14.1. The 2025 Zacks Consensus Estimate is looking for $7.13 but that’s 8.5% under the $7.79 Exxon made last year. One earnings estimate has been revised higher for 2025 and 2 lower in the last week.\nExxon is a dividend all-star, with its dividend currently yielding 3.9%.\nIs Exxon Mobil a value or a trap in 2025?\nChevron is also a large, American integrated oil company. Shares of Chevron are down 6.8% year-to-date but have been hit harder over the last month than Exxon. It’s down 14.3% during that time. But there have been dramatic one-day swings the last week.\nChevron is cheap. It has a forward P/E of 13.3. The Zacks Consensus is looking for $10.30 in 2025, which is earnings growth of 2.5% as it made $10.05 in 2024.\nChevron also pays an attractive dividend, yielding 4.8%.\nIs Chevron a value after the sell-off or a trap?\nEOG Resources is a large cap American exploration and production company. It produces in key basins including the Delaware Basin, Eagle Ford, and Dorado Play. EOG Resources has a strategy of returning at a minimum of 70% of annual free cash flow to shareholders.\nShares of EOG Resources have fallen 14.7% year-to-date but have really taken it on the chin in the last month, declining 16.9%. It’s cheap, with a forward P/E of 9.5. A P/E under 10 is usually considered a dirt-cheap stock.\nThe Zacks Consensus Estimate for 2025 is looking for $11.09. EOG Resources made $11.62 last year so that is a decline of 4.6%.\nEOG Resources is currently paying a dividend yielding 3.5%.\nIs EOG Resources a value or a trap in 2025?\nTune into this week’s podcast to find out.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nTracey Ryniec is the Value Stock Strategist for Zacks.com. She is also the Editor of the Insider Trader and Value Investor services. You can follow her on twitter at @TraceyRyniec and she also hosts the Zacks Market Edge Podcast on iTunes.\nZacks.com is a property of Zacks Investment Research, Inc., which was formed in 1978. The later formation of the Zacks Rank, a proprietary stock picking system; continues to outperform the market by nearly a 3 to 1 margin. The best way to unlock the profitable stock recommendations and market insights of Zacks Investment Research is through our free daily email newsletter; Profit from the Pros.  In short, it's your steady flow of Profitable ideas GUARANTEED to be worth your time!  Click here for your free subscription to Profit from the Pros.\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com/performance\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nEOG Resources, Inc. (EOG) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 13-51_Exxon Mobil Corporation (XOM)_ Among the Best Dividend Paying Stocks According to Hedge Funds",
    "date": "",
    "content": "Title: Exxon Mobil Corporation (XOM)_ Among the Best Dividend Paying Stocks According to Hedge Funds\nDate: 2025-04-14 13:51\nURL: https://finance.yahoo.com/news/exxon-mobil-corporation-xom-among-135138905.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best dividend-paying stocks.\nDividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining the historical performance of the broader market. Between 1960 and 2024, a $10,000 investment in the index would have grown to over $982,000 purely from stock price appreciation, based on data from FactSet and NYU Stern. However, many companies in the index also returned capital to shareholders through dividends. Had an investor reinvested those dividends over the years, the investment would have ballooned to approximately $6.42 million by the beginning of 2025.\nThis outlook seems reasonable, especially when considering how crucial cash flow has become in today’s economic environment. Investors continue to favor income-generating assets, and dividends remain one of the most reliable ways to deliver that income. Reflecting this trend, several companies within the market have recently introduced dividend payments.\nAccording to S&P Global, companies in the S&P index now contribute roughly 85% of the total dividends paid across the market—up from 82% in 2024. This increase includes 2.7% of the total dividend pool coming from firms that only recently began issuing dividends. The top 29 companies in the index alone are responsible for 40% of all dividends paid by the index’s constituents and 35% of the total dividends across the entire US equity market. Under the current base-case forecast, these leading firms are expected to distribute a combined $280 billion in dividends. In a more optimistic (upside) scenario, that figure could climb by 2.75% to $288 billion, with major large cap companies projected to deliver the most significant gains by weighted average. If the most favorable (bull-case) conditions materialize, these 29 companies could boost total dividend payouts by an estimated 4.5%, contributing an additional 1% themselves.\nIt’s no surprise, then, that dividends have become a central theme in many investors’ strategies. According to Brian Bollinger, founder of Simply Safe Dividends, focusing on companies that regularly pay dividends can offer a sense of reassurance. He further noted that younger investors, in particular, have the opportunity to build long-term dividend growth portfolios aimed at maximizing total return and capital appreciation over time.\nAccording to Nuveen, companies that focus on dividend growth tend to possess strong long-term fundamentals and may deliver relatively attractive performance in the year ahead. Historically, firms that consistently increased or initiated dividend payments have produced higher annualized returns and exhibited lower volatility compared to the broader equity market. While such companies may not lead in every market environment, their favorable risk-adjusted returns over extended periods make them a solid foundation for equity portfolios.\nNuveen also suggested that many firms remain in a strong position to continue raising dividends over time. In the US, corporate balance sheets are generally healthy, consumer spending remains steady, and earnings growth is projected to pick up pace in 2025. Data from FactSet shows that dividends per share for the S&P index rose by 7.6% in 2024, with consensus forecasts pointing to a further 4.2% increase in 2025. Given this, we will take a look at some of the best dividend stocks to buy according to hedge funds.\nAerial view of a major oil rig in the middle of the sea, pumping crude oil.\nOur Methodology:\nFor this list, we scanned Insider Monkey’s database of over 1,000 hedge funds, as of the close of Q4 2024. From the top 60 companies, we selected 11 dividend stocks with yields of at least 1% as of April 12. These companies show strong financial performance and have solid records of paying dividends. The stocks are ranked according to the number of hedge funds having stakes in them.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 104\nAn American multinational oil and gas company, Exxon Mobil Corporation (NYSE:XOM) is a global leader in integrated energy and chemical operations, ranks at the top of the best oil and gas dividend stocks to consider. In Q4 2024, the company reported a revenue of $83.4 billion, reflecting a slight 1.1% dip from the previous year. Despite this, its long-term performance remained steady, supported by $12.1 billion in structural cost savings since 2019. These efforts have helped offset inflation and expansion costs while enabling it to outperform industry peers. For 2024, the company recorded a sector-leading return on capital employed at 12.7%, with a five-year average of 10.8%.\nWith a strong cash flow position, Exxon Mobil Corporation (NYSE:XOM) stands out as a reliable dividend payer. It generated $55 billion in operating cash flow during 2024, marking its third-strongest year in the past decade. For Q4 alone, operating cash flow reached $12.2 billion, while free cash flow totaled $8 billion. The company returned $36 billion to shareholders in 2024, including $16.7 billion in dividend payments.\nExxon Mobil Corporation (NYSE:XOM) boasts a rich dividend legacy, having paid shareholders for 143 consecutive years and growing its dividend consistently for the past 42 years. Currently, it pays a quarterly dividend of $0.99 per share and has a dividend yield of 3.84%, as of April 12.\nOverall, XOM ranks 6th on our list of the best dividend paying stocks according to hedge funds. While we acknowledge the potential of XOM as an investment, our conviction lies in the belief that some deeply undervalued dividend stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for a deeply undervalued dividend stock that is more promising than XOM but that trades at 10 times its earnings and grows its earnings at double digit rates annually, check out our report about the dirt cheap dividend stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 21-45_Exxon Mobil (XOM) Gains But Lags Market_ What You Should Know",
    "date": "",
    "content": "Title: Exxon Mobil (XOM) Gains But Lags Market_ What You Should Know\nDate: 2025-04-14 21:45\nURL: https://finance.yahoo.com/news/exxon-mobil-xom-gains-lags-214515916.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIn the latest market close, Exxon Mobil (XOM) reached $103.39, with a +0.24% movement compared to the previous day. This move lagged the S&P 500's daily gain of 0.79%. Elsewhere, the Dow gained 0.78%, while the tech-heavy Nasdaq added 0.64%.\nThe oil and natural gas company's stock has dropped by 7.83% in the past month, exceeding the Oils-Energy sector's loss of 8.15% and lagging the S&P 500's loss of 3.56%.\nInvestors will be eagerly watching for the performance of Exxon Mobil in its upcoming earnings disclosure. The company's earnings report is set to be unveiled on May 2, 2025. The company is forecasted to report an EPS of $1.69, showcasing a 17.96% downward movement from the corresponding quarter of the prior year. In the meantime, our current consensus estimate forecasts the revenue to be $85.77 billion, indicating a 3.23% growth compared to the corresponding quarter of the prior year.\nFor the full year, the Zacks Consensus Estimates project earnings of $7.04 per share and a revenue of $348.38 billion, demonstrating changes of -9.63% and -0.34%, respectively, from the preceding year.\nInvestors should also take note of any recent adjustments to analyst estimates for Exxon Mobil. These latest adjustments often mirror the shifting dynamics of short-term business patterns. With this in mind, we can consider positive estimate revisions a sign of optimism about the company's business outlook.\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. To exploit this, we've formed the Zacks Rank, a quantitative model that includes these estimate changes and presents a viable rating system.\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection has moved 4.97% lower. Exxon Mobil is currently a Zacks Rank #4 (Sell).\nLooking at its valuation, Exxon Mobil is holding a Forward P/E ratio of 14.66. Its industry sports an average Forward P/E of 7.56, so one might conclude that Exxon Mobil is trading at a premium comparatively.\nWe can also see that XOM currently has a PEG ratio of 2.93. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Oil and Gas - Integrated - International industry currently had an average PEG ratio of 1.13 as of yesterday's close.\nThe Oil and Gas - Integrated - International industry is part of the Oils-Energy sector. This group has a Zacks Industry Rank of 148, putting it in the bottom 41% of all 250+ industries.\nThe strength of our individual industry groups is measured by the Zacks Industry Rank, which is calculated based on the average Zacks Rank of the individual stocks within these groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\nMake sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best oil stocks. After an encouraging start to the year, the energy sector is once again lagging behind the […]\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 23-17_Is Exxon Mobil Corporation (XOM) the Best Bargain Stock to Buy in May_",
    "date": "",
    "content": "Title: Is Exxon Mobil Corporation (XOM) the Best Bargain Stock to Buy in May_\nDate: 2025-04-14 23:17\nURL: https://finance.yahoo.com/news/exxon-mobil-corporation-xom-best-231711370.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 10 Best Bargain Stocks to Buy in May. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best bargain stocks to buy in May.\nWhile increasing tariffs and a hard sell-off have resulted in uncertainty, Neuberger Berman, an investment manager, expects that negotiations can bring some relief to initial tariff proposals. Furthermore, the firm anticipates a sharply slower growth than a US recession. Also, it believes that stimulus in Europe and China can rejuvenate global industrial activity, and the firm recommends styles, sectors, and regions that are most geared to it.\nGiven that a significant amount of tariff shock has now been priced in, Neuberger Berman is constructive on global equities for the remainder of the year. The firm expects that an ongoing recovery in the global industrial economy might be dampened but not derailed. The underlying momentum in the goods economy is expected to support equities that are most levered to it. Furthermore, the firm prefers value over growth (which is relatively expensive) and small caps over large caps. While an overdose of growth-inhibiting policy can impact the relatively healthy economy and push it into recession, the investment management firm believes that the US hasn’t yet reached that point. As per the firm, performance during the decline demonstrates relative strength in some of the more cyclical economic sectors in the US and around the world. The goods-oriented sectors, regions, and styles continue to outperform amidst the recent sell-off.\nREAD ALSO: 7 Best Stocks to Buy For Long-Term and 8 Cheap Jim Cramer Stocks to Invest In.\nS&P Global expects inflation to remain closer to 3.0% in 2025 as tariffs raise the prices along the domestic supply chain as well as for the end consumers. For 2026, the firm expects growth to pick up after a slow start. This is because of the abatement of uncertainty associated with the structure of tariffs and the further easing of the policy rate by the Federal Reserve. Also, the growth is expected to be aided partly because of a more favorable growth backdrop in the eurozone, which can help expand US exports.\nNeuberger Berman opines that a combination of improving fundamentals and stabilizing risks increased the optimism in the energy sector. As per the firm, increased global industrial activity is expected to continue to buoy oil demand and keep prices aloft. Furthermore, energy seems to be the most undervalued sector in the S&P 500 relative to the current and expected earnings growth. The investment management firm believes that much of the negative news, including regulatory concerns and geopolitical risks, seem to be factored in. This suggests that energy stocks can increase as the sentiment improves.\nTo list the 10 Best Bargain Stocks to Buy in May, we used a screener to shortlist the companies that trade at a forward P/E of less than ~20.0x. Next, we chose the ones that analysts see upside to, as of April 11. We also mentioned hedge fund sentiments around each stock, as of Q4 2024. Finally, the stocks were arranged in the ascending order of their hedge fund sentiments.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nAerial view of a major oil rig in the middle of the sea, pumping crude oil.\nForward P/E as of April 11: ~13.4x\nAverage Upside Potential: ~22.1%\nNumber of Hedge Fund Holders: 104\nExxon Mobil Corporation (NYSE:XOM) is engaged in the exploration and production of crude oil and natural gas. Jason Gabelman, an analyst from TD Cowen, remains optimistic about the company’s stock, given its focus on maintaining a reasonable near-term valuation. This, together with the clear pathway to FCF growth, continues to support the analyst’s optimism. Furthermore, Exxon Mobil Corporation (NYSE:XOM)’s strategic efforts in upgrading the portfolio while, at the same time, managing its capital expenditures effectively with the help of technology-driven efficiencies and a healthy project organization cement its financial health. Given the structural cost reductions achieved over the past few years and a commitment to value creation, the company exhibits potential for sustainable growth, says the analyst.\nExxon Mobil Corporation (NYSE:XOM)’s expansion into the low-carbon power sector offers strong growth potential. With the global energy markets pivoting towards cleaner sources, its investments in this area can place it well as a leader in the energy transition. Furthermore, the diversification can result in the opening up of new revenue streams, which can attract environmentally-conscious investors and can potentially offset the risks related to the future regulations on fossil fuels. Exxon Mobil Corporation (NYSE:XOM) remains focused on positioning itself for future growth via strategic initiatives. It is expected to leverage synergies from its Pioneer Natural Resources acquisition.\nOverall, XOM ranks 9th on our list of best bargain stocks to buy in May. While we acknowledge the potential of XOM as an investment, our conviction lies in the belief that some deeply undervalued AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for a deeply undervalued AI stock that is more promising than XOM but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nGriffon Corporation's (GFF) stock can provide the diversification that investors may need during an ongoing trade war.\nThe stock market has been in turmoil so far this year amid the tariff-related issues that threaten to send the U.S. economy into a potential recession, and a big drop in consumer sentiment this month has added to the overall negativity.  So, SoundHound is at the beginning of a terrific growth curve, considering that it expects to generate $167 million in revenue this year at the midpoint of its guidance range.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nBofA analyst Michael Ryskin lowered the firm’s price target on Mettler-Toledo (MTD) to $1,250 from $1,500 and keeps a Neutral rating on the shares. Sentiment for Life Sciences and Diagnostic Tools and Contract Research Organizations is “particularly negative” heading into earnings given that these companies “sit at the intersection of a number of policy changes from the Trump Administration,” including headwinds from NIH budget cuts and global tariffs, as well as broader macro concerns, especial\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nFederal borrowers can consolidate to get out of default, but there are caveats.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 09-55_Thinking About Buying Dividend Stocks During the 2025 Nasdaq Bear Market_ Consider These Risks First",
    "date": "",
    "content": "Title: Thinking About Buying Dividend Stocks During the 2025 Nasdaq Bear Market_ Consider These Risks First\nDate: 2025-04-15 09:55\nURL: https://www.fool.com/investing/2025/04/15/buy-dividend-stocks-nasdaq-bear-market-exxonmobil/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=1524d6fe-2345-4f9c-8617-ec8a4da37078&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (^IXIC -3.07%) back upward after a more than 20% that technically put it into a bear market. However, it's apparent that market volatility may be far from over.\nIncome investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside. Here are some risks worth considering before buying dividend stocks and why ExxonMobil (XOM 1.04%) is a good example of a dividend stock that you can buy with confidence during a bear market.\nImage source: Getty Images.\nInvestors who use dividends for financial planning or to supplement income in retirement will want to target companies with reliable payouts. After all, what good is a dividend if a company cuts it at the slightest sign of economic uncertainty?\nExxonMobil has raised its dividend for 42 consecutive years -- which may come as a surprise given the ups and downs in the oil and gas industry. In the last decade alone, there was the crash of 2014 and 2015 and the plunge during the COVID-19 pandemic. In fact, ExxonMobil reported its worst year on record in 2020 -- a staggering $22.4 billion loss.\nEven during a period of high uncertainty and a collapse in the global economy, ExxonMobil kept its dividend streak alive in 2020 because it relied on the strength of its balance sheet.\nExxonMobil's balance sheet is in its best shape in over a decade.\nExxonMobil's net total long-term debt position is just $14.7 billion, which is small for a company of its size. Its financial debt-to-equity ratio of 0.08 and debt-to-capital ratio of 12.5% showcase how the company has reduced its dependence on debt and can rely on free cash flow to fund operating expenses and long-term investments.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nIn fact, ExxonMobil has the lowest debt-to-capital ratio of the major integrated U.S. and European oil and gas companies -- a close second being its U.S. peer Chevron.\n\nBP Debt To Capital (Quarterly) data by YCharts\nExxonMobil can support its dividend even if margins fall due to lower oil and gas prices. The company has considerably improved its cost structure and technological advancements that have reduced production costs.\nExxonMobil has a long-term plan through 2030 built around Brent (the international benchmark) crude oil prices averaging $65 per barrel. However, it also has an optimistic scenario at $85 Brent and a pessimistic outcome at $55 per barrel. Even at $55 per barrel, ExxonMobil expects to earn a cash surplus of $110 billion from 2025 to 2030 thanks to higher free cash flow from its acquisition of Pioneer Natural Resources, development of onshore assets in the Permian Basin, production expansion offshore Guyana, and other moves.\nBrent crude oil prices averaged $81 per barrel in 2024 but have fallen in recent weeks due to tariff tensions, production increases in the Middle East, and recession fears. Brent crude oil is at a three-year low of around $63.60 at the time of this writing. But again, even at this level, the dividend is manageable -- although ExxonMobil may pull back on near-term capital expenditures if prices stay low.\nThe third risk worth considering before scooping up shares of dividend stocks during a bear market is whether the company can endure a prolonged slowdown. Or, in this case, tariffs.\nDividend affordability and a strong balance sheet are part of the equation, but so are competitive advantages. ExxonMobil can profit from its oil and gas production portfolio even at lower prices. Unlike some pure-play companies, ExxonMobil isn't dependent on a single geographic region. ExxonMobil also has a massive refining business and a growing low-carbon division. So, in the event of a slowdown, the company should be well positioned to take market share or even pounce on an acquisition opportunity.\nNot all dividend-paying companies have ExxonMobil's advantages. Some companies had strained balance sheets heading into 2025. Others have a dividend expense that is already eating up the bulk of profits. So, for these companies, if profits come down and stay down for too long, there could be pressure for a dividend cut.\nDividends are an excellent way to collect passive income no matter what stock prices are doing -- allowing investors to book a return without having to sell stock. But a dividend is only as reliable as the company paying it.\nDespite operating in the cyclical oil and gas industry, ExxonMobil is a beacon of dividend reliability. With a yield of 4%, ExxonMobil is an excellent way to generate a sizable amount of passive income while staying invested in the market.\n\n \n\nBefore you buy stock in ExxonMobil, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and ExxonMobil wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nDaniel Foelber has positions in Equinor Asa. The Motley Fool has positions in and recommends Chevron. The Motley Fool recommends BP and Equinor Asa. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-15 11-09_Desiring Durable Passive Income During an Economic Downturn_ These Elite Dividend Stocks Have Hiked ",
    "date": "",
    "content": "Title: Desiring Durable Passive Income During an Economic Downturn_ These Elite Dividend Stocks Have Hiked \nDate: 2025-04-15 11:09\nURL: https://www.fool.com/investing/2025/04/15/desiring-durable-passive-income-during-an-economic/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=9e6099a7-f35f-4994-b308-2fbdcab2177a&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nEconomic forecasters are raising the odds that we could experience a recession in the coming quarters. Goldman Sachs has hiked its recession probability a few times in recent weeks, bumping it from 20% all the way to 45%. Meanwhile, JPMorgan is even more bearish. Its recession model sees a nearly 80% chance the economy goes into a recession, up from 60% not long ago. \nRecessions tend to cause corporate profits to decline, which drives many companies to cut costs through layoffs and other initiatives. Some companies will even cut or suspend their dividend payments to shareholders to conserve cash. \nHowever, other companies are more recession-resistant due to the durability of their cash flows and the strength of their balance sheets. ExxonMobil (XOM 1.04%) and Coca-Cola (KO -0.19%) have proven their ability to weather recessions over the decades. They've both increased their dividends throughout at least the past four recessions. There's a good chance they can withstand the next one with similar ease. \n\nXOM Dividend data by YCharts. Gray bars are recessions.\nExxonMobil hiked its dividend payment by 4% earlier this year, extending its streak to 42 years of annual payment increases. \"We're proud of the fact that we've increased our annual dividend per share for 42 years in a row, something only 4% of S&P 500 companies can claim,\" stated CFO Kathy Mikells during the oil giant's fourth-quarter earnings conference call. She continued, \"And we plan for that track record to continue for decades to come, which is only possible by investing in the high-quality growth opportunities that drive leading returns and higher cash flows.\" \nThe energy company has been investing heavily in transforming its business to dramatically improve its underlying earnings power while also expanding into lower-carbon energy. This strategy has boosted its earnings capacity by nearly $14 billion over the past five years on a constant price and margin basis. Exxon plans to invest over $140 billion into major capital projects and its Permian Basin development program through 2030, which, along with structural cost savings, should add another $20 billion to its annual earnings capacity. \nThat incremental income will give Exxon even more fuel to grow its dividend, which is already on an incredibly safe foundation. Last year, Exxon produced $34.4 billion in free cash flow, easily covering its $16.7 billion dividend outlay. Meanwhile, it has a fortress balance sheet with an ultra-low 6% leverage ratio and a massive $23.2 billion cash balance. These factors put the oil giant's 3.8%-yielding dividend on a rock-solid foundation that should continue withstanding recessions. \nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nCoca-Cola boosted its dividend payment by 5.2% earlier this year. That extended its dividend growth streak to 63 straight years. That raise kept Coca-Cola in the ultra-elite group of Dividend Kings, companies with 50 or more years of annual dividend increases. \nThe company has benefited from the durable and growing demand for its beverage brands. Its portfolio features multiple billion-dollar brands that generate lots of free cash flow for the company. Coca-Cola expects to produce $9.5 billion in free cash flow this year, more than enough to cover its dividend outlay ($8.4 billion last year). The company also has a strong cash-rich balance sheet ($12.9 billion of cash, cash equivalents, and short-term investments) with leverage at the low end of its target range. \nCoca-Cola's long-term target is to organically grow its revenue by 4%-6% annually, which should drive mid-to-high single-digit earnings-per-share growth. Meanwhile, the company can enhance its growth rate by making accretive acquisitions. That puts it in a strong position to continue increasing its 2.9%-yielding dividend. \nExxon and Coca-Cola have increased their dividends every year for several decades, which includes the last four recessions. They're in excellent positions to continue raising their payout during the next downturn, whether that happens later this year or further in the future. Because of that, they're great dividend stocks to buy for a durable passive income stream. \n\n \n\nBefore you buy stock in ExxonMobil, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and ExxonMobil wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nJPMorgan Chase is an advertising partner of Motley Fool Money. Matt DiLallo has positions in Coca-Cola and JPMorgan Chase. The Motley Fool has positions in and recommends Goldman Sachs Group and JPMorgan Chase. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-15 13-35_Exxon Mobil (XOM)_ The Best Undervalued Energy Stock to Invest in Now",
    "date": "",
    "content": "Title: Exxon Mobil (XOM)_ The Best Undervalued Energy Stock to Invest in Now\nDate: 2025-04-15 13:35\nURL: https://finance.yahoo.com/news/exxon-mobil-xom-best-undervalued-133541929.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 11 Best Undervalued Energy Stocks to Invest in Now. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other undervalued energy stocks.\nOn March 18, Tortoise Capital senior portfolio manager Rob Thummel appeared on CNBC’s ‘Squawk on the Street’ to discuss his outlook on the energy sector. He believes that natural gas is positioned to lead growth in the future within the energy sector. This natural gas demand is driven by electricity and energy exports. Thummel noted that the energy and tech sectors are converging due to advancements like AI and data centers. Electricity demand fuels natural gas consumption, while US energy exports help meet global needs for low-cost and low-carbon energy. He also highlighted that the US is now emerging as the largest exporter of LNG, even though it was an LNG importer just years ago. He anticipates that the US LNG exports will soon 2x in volume over time. Thummel also expects Europe and other countries to prioritize energy security and diversify their supply sources. This will ensure reliance on US energy exports.\nThummel emphasized a focus on energy infrastructure companies while discussing his specific investment strategies as they tend to be stable and have high dividend yields even in uncertain market conditions. He thinks that the certainty provided by energy infrastructure investments in an otherwise volatile market should not be neglected. Such companies generate substantial annual cash flows while maintaining disciplined financial practices.\nThummel thinks that the energy sector trades at a discount to historical valuations despite its fundamentals. This offers the potential for high returns.\nWe used the Finviz stock screener to compile a list of the top energy stocks that had a forward P/E ratio under 15 as of April 10. We then selected the 11 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 1000 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nAerial view of a major oil rig in the middle of the sea, pumping crude oil.\nForward P/E Ratio as of April 10: 13.77\nNumber of Hedge Fund Holders: 104\nExxon Mobil Corporation (NYSE:XOM) manufactures, trades, transports, and sells crude oil, natural gas, petroleum products, petrochemicals, and other specialty products. It’s also pursuing lower-emission and other business opportunities, such as carbon capture and storage, hydrogen, lower-emission fuels, Proxxima systems, carbon materials, and lithium.\nThe acquisition of Pioneer assets has strengthened the company’s position in the Permian basin. In 2024, the company achieved record production from both its Heritage ExxonMobil assets and the newly acquired Pioneer assets. The combined strength of these assets is projected to yield an average of more than $3 billion per year in synergies. Production is expected to increase from 1.5 million oil-equivalent barrels per day at the end of 2024 to 2.3 million barrels per day by 2030. This represents ~50% growth.\nThe Permian Basin is a key contributor to Exxon Mobil Corp.’s (NYSE:XOM) overall upstream portfolio, which achieved the highest-ever production from its advantaged assets and the highest liquid production from its overall portfolio in more than 40 years. The company’s focus on low-cost supply, low emissions intensity, and high returns in the Permian ensures that this segment will continue to drive growth.\nOverall, XOM ranks 1st on our list of the best undervalued energy stocks to invest in now. While we acknowledge the growth potential of XOM, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than XOM but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nWe recently published a list of 10 Best Bargain Stocks to Buy in May. In this article, we are going to take a look at where Alibaba Group Holding Limited (NYSE:BABA) stands against other best bargain stocks to buy in May. While increasing tariffs and a hard sell-off have resulted in uncertainty, Neuberger Berman, an investment […]\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\n(Reuters) -Hedge fund Elliott Investment Management has built a stake of more than $1.5 billion in Hewlett Packard Enterprise, a person familiar with the matter said on Tuesday.  Elliott, one of the world's biggest activist investors, now ranks among the information technology company's biggest investors and plans to engage with management, said the person who was not permitted to discuss the campaign publicly.  Details of what Elliott may be pushing HPE, which is valued at $20 billion, to do could not be immediately determined.\nSpeaking on CNBC recently, Chris Caso, a senior analyst at Wolfe Research, said that “the AI space and tariffs in particular are… the best places to hide right now.” More of Caso’s Comments on NVDA Nvidia’s valuation is attractive, and the tech giant’s recently announced decision to manufacture its upcoming chips at Taiwan Semi’s (TSM) […]\nAs previously reported, CIBC upgraded Torex Gold Resources (TORXF) to Outperformer from Neutral with a price target of C$58, up from C$42, citing that company’s progress in achieving its “key milestones.” Torex Gold pre-released Q1 production of 59,630 gold equivalent ounces and with Q1 operational results now priced into the shares and “many of the key transitional risks resolved,” investors can instead look forward to the remainder of 2025, which the firm says will be “an important year for To\nWe recently published a list of the 10 High Growth Forever Dividend Stocks to Invest In. In this article, we are going to take a look at where NextEra Energy, Inc. (NYSE:NEE) stands against other high growth forever dividend stocks. Dividend stocks have trailed the broader market over the past two years, largely due to investors […]\nNo one ever claimed investing in the biotech industry was a smooth ride, but for shareholders of Viking Therapeutics (NASDAQ: VKTX), the turbulence has been extremely challenging thus far.  The stock is down 71% over the past year, amid ongoing uncertainties regarding the timeline for future commercialization of its clinical pipeline and the broader stock market sell-off.  Progress toward regulatory approval with multiple data readouts expected later this year could be the catalyst for shares to rebound sharply.\nWe recently published a list of the 10 High Growth Forever Dividend Stocks to Invest In. In this article, we are going to take a look at where Costco Wholesale Corporation (NASDAQ:COST) stands against other high growth forever dividend stocks. Dividend stocks have trailed the broader market over the past two years, largely due to investors […]\nOne of the biggest two-day sell-offs in stock market history saw investors pile into the stock market earlier this month.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 14-22_2 Stocks Likely to Beat on Q1 Earnings Echoing XOM's Upstream Optimism",
    "date": "",
    "content": "Title: 2 Stocks Likely to Beat on Q1 Earnings Echoing XOM's Upstream Optimism\nDate: 2025-04-15 14:22\nURL: https://finance.yahoo.com/news/2-stocks-likely-beat-q1-142200568.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe are yet to get first-quarter 2025 results from the energy companies, with the oil-energy sector’s earnings season to start this week. In the meantime, Exxon Mobil Corporation XOM has already offered an early glimpse of how the quarter might have shaped up. As oil and natural gas prices were buoyant in the March quarter, we expect BP plc BP and SLB SLB to beat on first-quarter earnings.\nPer the data from the U.S. Energy Information Administration (“EIA”), the average Cushing, OK WTI spot prices for January, February, and March of this year were $75.74, $71.53 and $68.24 per barrel, respectively. Thus, the overall pricing environment was favorable in the first quarter of 2025, as the breakeven costs of the exploration and production companies in the shale plays are significantly lower.\nHowever, although crude prices were advantageous in the March quarter of this year, the overall prices of the commodity were a bit higher at $74.15, $77.25 and $81.28 per barrel in January, February and March of 2024, respectively. Hence, the oil-energy sector is likely to have generated lower total earnings in the first quarter of 2025 as compared to the prior-year quarter.\nOur data suggests that in the March quarter of 2025, the sector will probably generate total earnings of $27.5 billion, lower than $30.5 billion in the first quarter of 2024.\nImage Source: Zacks Investment Research\nNotably, the pricing scenario for natural gas was not only healthier but also favorable in the first quarter of 2025.\nSince the prices of both crude oil and natural gas were favorable for exploration and production activities, upstream energy players will likely report handsome first-quarter results. Oilfield service players will also likely remain in the sweet spot since they help upstream firms set up oil and gas wells effectively.  \nXOM, one of the largest integrated energy players, recently reported in an SEC filing that it expects its upstream earnings for the March quarter to increase sequentially by as much as $800 million. The company attributed advantageous oil and gas prices for the improvement. Moreover, ExxonMobil expects its Energy Products business unit to witness a sequential improvement of $300-$700 million owing to the changes in industry margins.\nWith the existence of a number of players in the sector, finding the right energy stocks that have the potential to beat on earnings can be daunting. Our proprietary methodology, however, makes it fairly simple.\nYou could narrow down the list of choices by looking at stocks that have the combination of a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold), and a positive Earnings ESP. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSLB\nSLB is a leading oilfield service player. As exploration and production activities were favorable, SLB is likely to have witnessed increased demand for its well construction, completions and reservoir characterization activities.\nSLB currently has an Earnings ESP of +0.20% and a Zacks Rank of 3. It is slated to report first-quarter 2025 results on April 25.\nThe company's earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 1.78%. (Find the latest EPS estimates and surprises on Zacks Earnings Calendar.)\nImage Source: Zacks Investment Research\nBP\nBP, a British energy giant, currently has an Earnings ESP of +9.14% and carries a Zacks Rank #3. Supportive commodity prices are likely to have aided BP. The company is slated to report first-quarter 2025 results on April 29.\nHowever, BP expects its production from upstream operations to be lower sequentially. BP’s earnings beat the Zacks Consensus Estimate in two of the last four quarters and missed in the other two, delivering an average negative surprise of 3.04%.\nImage Source: Zacks Investment Research\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nSchlumberger Limited (SLB) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\n↗️ Netflix (NFLX): The streaming company aims to achieve a $1 trillion market capitalization and double its revenue by 2030, The Wall Street Journal reported. Shares closed 4.8% higher. 🔎 MP Materials (MP); USA Rare Earth (USAR): Shares in the rare-earth companies were mixed, after surging Monday following a Financial Times report that President Trump plans to stockpile critical metals to counter China.\nEconomic forecasters are raising the odds that we could experience a recession in the coming quarters.  Goldman Sachs has hiked its recession probability a few times in recent weeks, bumping it from 20% all the way to 45%.  Its recession model sees a nearly 80% chance the economy goes into a recession, up from 60% not long ago.\nLike any news-focused media company, Newsmax (NYSE: NMAX) centers its business on bad news.  Its share price has already fallen over 70% since the initial public offering (IPO) in March.  Is Newsmax stock poised to plunge even more?\nBP expects weak gas trading and a $4B rise in debt in Q1. Refining margins and oil output offer partial support amid its shift to fossil fuels.\nBaker Hughes (BKR) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nThe traditional ways to plan for your retirement may mean income can no longer cover expenses post-employment. But what if there was another option that could provide a steady, reliable source of income in your nest egg years?\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nAn eventful 24 hours in the crypto markets saw VTHO zooming 37%, Story’s IP falling and recovering 20%, with some traders hoping that the worst of the tariffs-driven selloffs are in the past.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 16-58_ExxonMobil Deems Gas Find at Elektra-1 Well Commercially Unviable",
    "date": "",
    "content": "Title: ExxonMobil Deems Gas Find at Elektra-1 Well Commercially Unviable\nDate: 2025-04-15 16:58\nURL: https://finance.yahoo.com/news/exxonmobil-deems-gas-elektra-1-165800026.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nExxon Mobil Corporation XOM, the U.S. oil and gas giant, has failed to find commercially feasible natural gas reserves at an exploratory well, namely Elektra-1, which was drilled offshore Cyprus earlier this year. Earlier, XOM had mentioned that it collected extensive three-dimensional (3D) seismic data and discovered several large prospects offshore Cyprus, including the Electra prospect. Based on the evaluation of the seismic data, the company stated that the Electra prospect was promising.\nThe U.S. energy major recently completed drilling activities at the Elektra-1 well. The Ministry of Energy, Commerce and Industry in Cyprus noted that preliminary assessments and the data collected from the exploratory well indicated that the gas reserves at the prospect were commercially infeasible for development. However, the ministry also noted that XOM’s initial assessments, following the drilling operations, have shown promising results. The initial results of the evaluation confirm the presence of a hydrocarbon system alongside high-quality reservoirs.\nThe drilling operations at the Electra prospect were conducted by a consortium comprising ExxonMobil Exploration and Production Cyprus, and QatarEnergy International E&P LLC, with the former acting as the operator. The Elektra-1 well was drilled in Block 5 of the Exclusive Economic Zone (“EEZ”) in Cyprus. ExxonMobil holds exploration licenses in two offshore blocks in Cyprus, with QatarEnergy as its partner.\nThe country's energy ministry has stated that the information collected while conducting drilling operations will be analyzed further and considered by the consortium before determining its future plans in Block 5. The consortium will now focus on drilling another exploratory well, Pegasus-1, located in a different offshore block in Cyrus’ EEZ.\nThe results pose a major setback for Cyprus as the country is yet to produce natural gas from its offshore discoveries. Cyprus is trying to secure its position as an alternative natural gas supplier to the European Union (EU). After Russia’s invasion of Ukraine in 2022, many European nations are trying to diversify their gas supply sources, and the Mediterranean region has attracted significant attention due to its offshore gas reserves. However, the initial assessment of the Elektra-1 well has dealt a blow to Cyprus’ ambitions to establish itself as an alternative supplier and contribute to the EU’s energy security.\nXOM currently carries a Zacks Rank #4 (Sell).\nSome better-ranked stocks from the energy sector are Archrock Inc. AROC, Nine Energy Service NINE and Kinder Morgan, Inc. KMI. While Archrock currently sports a Zacks Rank #1 (Strong Buy), Nine Energy Service and Kinder Morgan carry a Zacks Rank #2 (Buy) each. You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is an energy infrastructure company based in the United States with a focus on midstream natural gas compression. It provides natural gas contract compression services and generates stable fee-based revenues. With natural gas playing an increasingly important role in the energy transition journey, AROC is expected to witness sustained demand for its services.\nNine Energy Service provides onshore completion and production services for unconventional oil and gas resource development. It operates across key prolific basins in the United States, including the Permian, Eagle Ford, MidCon, Barnett, Bakken, Rockies, Marcellus and Utica, as well as throughout Canada. With a sustained demand for oil and gas in the future, the need for NINE’s services is anticipated to increase, which should position the company for growth in the long run.\nKinder Morgan is a leading North American midstream player with a stable and resilient business model, largely driven by take-or-pay contracts. KMI’s stable business model shields it from commodity price volatility, resulting in predictable earnings and facilitating reliable capital returns to its shareholders.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nKinder Morgan, Inc. (KMI) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nNine Energy Service, Inc. (NINE) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nCVX and XOM are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nKinder Morgan (KMI) delivered earnings and revenue surprises of -2.86% and 2.53%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nEnstor has accepted the FERC certificate, marking a significant milestone for the Mississippi Hub Expansion Project, which is expected to be operational by 2028.\nWe recently published a list of 12 Best Gambling Stocks to Buy According to Analysts. In this article, we are going to take a look at where DraftKings Inc. (NASDAQ:DKNG) stands against other best gambling stocks to buy according to analysts. Gambling stocks include companies that own, run, or manage lawful gambling activities and events […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 17-42_Is Exxon Mobil Corporation (XOM) the Best Oil Stock to Invest in According to Billionaires_",
    "date": "",
    "content": "Title: Is Exxon Mobil Corporation (XOM) the Best Oil Stock to Invest in According to Billionaires_\nDate: 2025-04-15 17:42\nURL: https://finance.yahoo.com/news/exxon-mobil-corporation-xom-best-174210470.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other best oil stocks.\nAfter an encouraging start to the year, the energy sector is once again lagging behind the overall market. At the time of writing this piece, the broader energy sector has slid by almost 8.2% since the beginning of 2025, against declines of around 7.9% by the wider market. The principal reason behind this fall is the decline in the global prices of oil, which have plunged by almost 14.5% since the beginning of the year.\nREAD NEXT: 10 Best Clean Energy Stocks to Buy According to Billionaires\nThe continued uncertainty surrounding the ongoing tariff war and the recent decision by OPEC+ to increase supply in May have taken a toll on the global price, with the West Texas Intermediate (WTI) crude price now hovering around a 3-year low of $61.5. The US Energy Information Administration (EIA) has forecasted WTI price to average $63.88 per barrel for 2025 before dropping to an average of $57.48 next year. Such a sharp decline in prices could threaten US oil production growth this year. According to data from the Federal Reserve Bank of Dallas, the US oil industry needs prices between $61 and $70 per barrel to be profitable.\nThe escalating trade tensions between the US and China have also raised the prospect of a global economic slowdown, potentially leading to a lower-than-forecasted consumption of oil. In its latest report, the EIA now expects global oil consumption to increase by 900,000 b/d in 2025 and 1 million b/d in 2026, down by 400,000 b/d and 100,000 b/d, respectively, from its initial forecast last month. The decrease in demand, coupled with increasing production, will continue putting pressure on crude prices, forcing many industry players to cut back activity to maintain investor payouts.\nThe American oil and gas sector is also frustrated by the back and forth trade policies of President Trump and is questioning how they align with his ‘drill, baby, drill’ mandate to further boost production. According to a survey by the Federal Reserve Bank of Dallas, nearly a third of oil executives have stated that their business outlook has worsened since the end of 2024. Moreover, the imposition of the 25% tariff on steel and aluminum has already led to an estimated 4% increase in costs for drilling a well.\nThe pressing issues surrounding the global oil trade have forced the industry to shift focus to its second major source of revenue – natural gas. In contrast to oil, the benchmark US natural gas price at Henry Hub has surged by more than 123% since last year and by almost 18% since the beginning of 2025. The uptick comes as a result of slowing output in 2024, booming LNG exports, and fast-depleting inventories during the coldest winter in six years. Moreover, natural gas has emerged as a leading candidate to power the ongoing AI boom and its accompanying data centers, with many providers now even aiming to surpass utilities and supply directly to these power-hungry facilities.\nAlso, despite the broad concerns, many billionaires continue to invest and remain bullish on the oil sector. A great example is how Warren Buffett’s Berkshire Hathaway maintains significant holdings in multiple oil majors and even recently invested hundreds of millions of dollars in an oil and gas giant over the last few months.\nAerial view of a major oil rig in the middle of the sea, pumping crude oil.\nTo collect data for this article, we scanned Insider Monkey’s database of billionaires’ stock holdings and picked the top 10 companies operating in the oil sector with the highest number of billionaire investors in the Insider Monkey database in Q4 of 2024. When two or more companies had the same number of billionaires backing them, we ranked them by the revenue of their last financial year. Following are the Best Oil Stocks According to Billionaires.\nAt Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Billionaire Holders: 16\nTopping our list of the Best Oil Stocks According to Billionaires is Exxon Mobil Corporation (NYSE:XOM), one of the largest integrated fuels, lubricants, and chemical companies in the world. The company operates facilities or markets products around the globe and explores for oil and natural gas on six continents.\nAfter the $60 billion acquisition of Pioneer Natural Resources last year, Exxon Mobil Corporation (NYSE:XOM)’s production in the Permian Basin and Guyana hit a record high in 2024. The oil major delivered an industry-leading financial performance last year, with $34 billion in earnings and $55 billion in cash flow from operations, its third-highest result in a decade despite softer market conditions. The company’s total production came in at 4.3 million boed in 2024, with a target to achieve close to 5.4 million boed in 2030.\nExxon Mobil Corporation (NYSE:XOM) has grown its earnings at an annual rate of roughly 30% over the last five years, while its cash flow has increased at a CAGR of about 15%. The company intends to continue this momentum and expects to add a further $20 billion in earnings and $30 billion in cash flow by the end of the decade. Exxon remains committed to its shareholders, having grown its annual dividend for 42 consecutive years. The company announced a quarterly dividend of $0.99 per share for Q1 of 2025 and also revealed plans to repurchase $20 billion in shares annually through 2026.\nOverall, XOM ranks 1st on our list of the best oil stocks to invest in according to billionaires. While we acknowledge the potential of XOM to grow , our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than XOM but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nBeyond analysts' top -and-bottom-line estimates for Comerica (CMA), evaluate projections for some of its key metrics to gain a better insight into how the business might have performed for the quarter ended March 2025.\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Amphastar Pharmaceuticals, Inc. (NASDAQ:AMPH) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big American […]\n- Taxable-bond ETFs reached 30% market share, triple their position from a decade ago. - Long-term fund inflows hit the lowest point since April 2024 amid economic uncertainty. - Gold funds saw the strongest inflows since 2020 as investors sought safe-haven assets.\nThe industry will likely need to speed up its adoption of new technologies – most of which can be capital-intensive – as the need for hydrocarbons shows no signs of abating.\nDespite falling prices, natural gas is actually in short supply right now, and gas producers could come out ahead if prices rebound.\nBioNTech (BNTX) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock suggests that there could be more strength down the road.\nThe stock market is in turmoil right now, and entering this week, the S&P 500 has declined by around 9% since the start of the year.  How can you keep your savings safe and still be invested in the stock market -- or is that even possible nowadays?  One blue chip stock you may be considering is Coca-Cola (NYSE: KO).\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-40_StoneCo   and RH have been highlighted as Zacks Bull and Bear of the Day",
    "date": "",
    "content": "Title: StoneCo   and RH have been highlighted as Zacks Bull and Bear of the Day\nDate: 2025-04-16 10:40\nURL: https://finance.yahoo.com/news/stoneco-rh-highlighted-zacks-bull-104000245.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChicago, IL – April 16, 2025 – Zacks Equity Research shares StoneCo STNE, as the Bull of the Day and RH RH as the Bear of the Day. In addition, Zacks Equity Research provides analysis on — Exxon Mobil Corp. XOM, BP plc (BP) and SLB SLB.\nHere is a synopsis of all five stocks:\nZacks Rank #1 (Strong Buy) stock StoneCo is a leading fintech company based in Brazil. The company runs a complete end-to-end cloud-based platform that allows retailers and businesses to accept electronic payments across storefronts and mobile and online channels. Investors can breakdown StoneCo’s business into three primary segments, including:\n1. Payment Processing: STNE is the leading provider of point-of-sale payment processing services. Like Block(formerly Square) in the United States, STNE’s technology empowers businesses to accept credit cards, debit cards, and digital wallet payments through its point-of-sale payment solution.\n2. Banking Services: StoneCo is much more than a payment processor. Small and medium-sized businesses can use STNE to bank, pay bills, and manage accounts. In addition, because STNE collects transaction data, the company can utilize that data to assess a client’s creditworthiness and offer loans.\n3. Software Tools: Like Canadian e-commerce leader Shopify (SHOP), STNE offers a full suite of products that allow businesses to seamlessly conduct e-commerce transactions, analyze their client base, and manage customers.\nStone allows investors to harness the growth of a largely untapped and rapidly growing Brazilian payments market. Brazil is the world’s ninth-largest economy and boasts the largest economy in Latin America, with more than $2 trillion in annual GDP. In Brazil, retail sales are growing, the middle class encompasses roughly 60% of the population, and the country is modernizing into a digital economy.\nUnlike the United States, Brazil’s digital payment economy is unsaturated, with roughly only 15% of consumers using digital payments currently. However, Statista predicts that, from 2025 to 2029, the Brazilian digital payment market will register a ~29% compound annual growth rate (CAGR) and grow from ~$300 billion to ~$900 billion.\nStoneCO has consistently delivered EPS results above Wall Street expectations. The company has outpaced Zacks Consensus Estimates in twelve of the past thirteen quarters. Last quarter, despite a difficult and uncertain macroeconomic environment, STNE beat Wall Street’s top-and-bottom-line expectations. A positive EPS surprise of 21.88% last quarter suggests that STNE’s business is gaining momentum.\nDespite a more than 15% earnings surge, STNE shares are cheap and trade at a forward P/E ratio of ~8x EPS.\nSTNE’s technical picture echoes its bullish fundamentals. Following last quarter’s earnings results, shares bolted above the 200-day moving average and are breaking out of a multi-week base structure.\nStoneCo’s comprehensive fintech platform, consistent earnings outperformance, and attractive valuation allow investors to profit from Brazil’s digital payment transformation.\nZacks Rank #5 (Strong Sell) stock RH, formerly Restoration Hardware, is a high-end home furnishings company based in California. RH is a staple in many malls and shopping centers across the United States and offers a plethora of upscale home goods via its 70 galleries, outlets, catalogs, and websites.\nSelling products through its sizable galleries, RH’s product line includes home décor, furniture (including outdoor), bathroom products and bathware, and lighting. While RH’s primary focus is upscale interior products, the company expanded into the hospitality business in 2015, offering a handful of RH branded cafés restaurants, and hotels. RH’s core business is in the US, though it has expanded to Europe and Canada.\nThe story of Wall Street and the 2025 market thus far is the Trump Administration’s aggressive tariff policy aimed at bringing manufacturing back to the United States, improving trade imbalances, and seeking to achieve better trade deals with other countries. Unfortunately, as of 2024, RH sources ~72% of its products from Asia (including 35% from Vietnam, 23% from China, and the rest from Indonesia and India).\nRH addressed supply chain issues earlier this month, saying, “The company has been operating with 25% tariffs from China since the last Trump administration and has successfully resourced the majority of its China production to Vietnam at significantly better than pre-tariff landed China pricing. In addition, the company has successfully resourced a meaningful amount of its China production to its own factory in North Carolina.”\nWhile it’s encouraging to see the company adapt, investor concerns remain. RH is still reliant on China, and moving its supply chain to Vietnam will take time and money. In addition, there is little clarity on trade deals with Indonesia and India at the time of this writing.\nThough RH margins are being squeezed due to tariffs, that is not the only concern the company faces. Consumer confidence has been falling recently and RH’s deep-pocketed customer base may temper spending as it waits for a clearer macroeconomic picture to emerge. Gross margins have sunk from more than 50% to 44.8% since 2022.\nMaintaining luxury showrooms, paying rent, and upending its supply chain have led to rampant spending of more than $1 billion last year. To make matters worse, the company’s debt is soaring and there is no end to the spending in sight.\nRH’s earnings trajectory is moving in the wrong direction for bulls, missing Zacks Consensus Estimates by an average of 103.49% over the past four quarters.\nRH shares plunged more than 40% as volume swelled to more than 10x the norm following the company’s latest earnings announcement. Such ugly price and volume action are symbolic of heavy distribution. In addition, RH is carving out a bearish flag pattern.\nLuxury home furnishing retailer RH faces several bearish headwinds, including tariff policy, ballooning debt, and margin pressures. A worst-possible Zacks Rank and a bearish chart pattern add to the concern.\nWe are yet to get first-quarter 2025 results from the energy companies, with the oil-energy sector’s earnings season to start this week. In the meantime, Exxon Mobil Corp. has already offered an early glimpse of how the quarter might have shaped up. As oil and natural gas prices were buoyant in the March quarter, we expect BP plc and SLB to beat on first-quarter earnings.\nPer the data from the U.S. Energy Information Administration (“EIA”), the average Cushing, OK WTI spot prices for January, February, and March of this year were $75.74, $71.53 and $68.24 per barrel, respectively. Thus, the overall pricing environment was favorable in the first quarter of 2025, as the breakeven costs of the exploration and production companies in the shale plays are significantly lower.\nHowever, although crude prices were advantageous in the March quarter of this year, the overall prices of the commodity were a bit higher at $74.15, $77.25 and $81.28 per barrel in January, February and March of 2024, respectively. Hence, the oil-energy sector is likely to have generated lower total earnings in the first quarter of 2025 as compared to the prior-year quarter.\nOur data suggests that in the March quarter of 2025, the sector will probably generate total earnings of $27.5 billion, lower than $30.5 billion in the first quarter of 2024.\nNotably, the pricing scenario for natural gas was not only healthier but also favorable in the first quarter of 2025.\nSince the prices of both crude oil and natural gas were favorable for exploration and production activities, upstream energy players will likely report handsome first-quarter results. Oilfield service players will also likely remain in the sweet spot since they help upstream firms set up oil and gas wells effectively.\nXOM, one of the largest integrated energy players, recently reported in an SEC filing that it expects its upstream earnings for the March quarter to increase sequentially by as much as $800 million. The company attributed advantageous oil and gas prices for the improvement. Moreover, ExxonMobil expects its Energy Products business unit to witness a sequential improvement of $300-$700 million owing to the changes in industry margins.\nWith the existence of a number of players in the sector, finding the right energy stocks that have the potential to beat on earnings can be daunting. Our proprietary methodology, however, makes it fairly simple.\nYou could narrow down the list of choices by looking at stocks that have the combination of a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold), and a positive Earnings ESP. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter. You can see the complete list of today’s Zacks #1 Rank stocks here.\nSLB is a leading oilfield service player. As exploration and production activities were favorable, SLB is likely to have witnessed increased demand for its well construction, completions and reservoir characterization activities.\nSLB currently has an Earnings ESP of +0.20% and a Zacks Rank of 3. It is slated to report first-quarter 2025 results on April 25.\nThe company's earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 1.78%. (Find the latest EPS estimates and surprises on Zacks Earnings Calendar.)\nBP, a British energy giant, currently has an Earnings ESP of +9.14% and carries a Zacks Rank #3. Supportive commodity prices are likely to have aided BP. The company is slated to report first-quarter 2025 results on April 29.\nHowever, BP expects its production from upstream operations to be lower sequentially. BP’s earnings beat the Zacks Consensus Estimate in two of the last four quarters and missed in the other two, delivering an average negative surprise of 3.04%.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nhttps://www.zacks.com\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nSchlumberger Limited (SLB) : Free Stock Analysis Report\nRH (RH) : Free Stock Analysis Report\nShopify Inc. (SHOP) : Free Stock Analysis Report\nStoneCo Ltd. (STNE) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nCVX and XOM are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nLuxury home furnishing retailer RH faces several bearish headwinds, including tariff policy, ballooning debt, and margin pressures. A worst-possible Zacks Rank and a bearish chart pattern add to the concern.\nStoneCo's comprehensive fintech platform, consistent earnings outperformance, and attractive valuation allow investors to profit from Brazil's digital payment transformation.\nEuropean stocks were dropping on Wednesday as investors weighed up trade tensions and reacted to an underwhelming set of earnings from Dutch chip tool maker ASML. The continent's flagship Stoxx 600 index fell 0.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nWe recently published a list of 10 Firms End Stronger on Tuesday. In this article, we are going to take a look at where ADMA Biologics, Inc. (NASDAQ:ADMA) stands against other firms that end stronger on Tuesday. A muted trading persisted on the stock market on Tuesday, with major indices ending in the red, recording minimal […]\nYour day-ahead look for April 16, 2025\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-44_Petrobras' Environmental Hurdles Lead to Oil Blocks Auction in Brazil",
    "date": "",
    "content": "Title: Petrobras' Environmental Hurdles Lead to Oil Blocks Auction in Brazil\nDate: 2025-04-16 10:44\nURL: https://finance.yahoo.com/news/petrobras-environmental-hurdles-lead-oil-104400391.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPetróleo Brasileiro S.A. – Petrobras’ PBR years-long disputes with the environmental authorities on drilling licenses recently led to an oil block auction, whereby Brazil’s oil regulator, ANP, will provide exploration rights in several offshore oil blocks.\nThe auction, which is scheduled to take place on June 17, will offer 172 blocks spanning both land and deep-water zones in northeastern and southern Brazil, including the Equatorial Margin — a region that could be key to Brazil’s energy future. The blocks across five sedimentary basins, including the deepwater Potiguar and Foz do Amazonas, located near the equator, will also be offered, which are considered to hold Brazil’s greatest potential for replenishing reserves and are projected to start declining by 2030.\nOut of the 172 oil blocks, 47 are at the Foz do Amazonas, where Petrobras, currently carrying a Zacks Rank #3 (Hold),won the exploration deal in 2023 and since then, has been awaiting environmental clearance to drill its first well. These oil blocks are expected to contain the same potential as those in Suriname and Guyana, where Exxon Mobil found billions of barrels of oil. The delay in environmental clearance certainly reduces the attractiveness of these blocks for the auction.\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nCertain environmental working groups have suggested dropping some Potiguar Basin oil blocks, like Atol das Rocas and the Fernando de Noronha archipelago as they are in places of extreme environmental sensitivity and ecosystem connectivity.\nHowever, Brazil’s several ministries jointly allowed these sensitive areas to be offered for auction, even though this authorization expires just a day after the auction. This puts the Potiguar Basin at particular risk of exclusion from future rounds.\nDespite the controversies, the auction has attracted interest from the industry’s big players. Thirty-one companies have registered themselves to bid for the upcoming auction, including Petrobras, Exxon Mobil Corporation XOM, Chevron Corporation CVX, BP p.l.c. BP,Shell and Equinor.\nExxon Mobil is a U.S.-based oil and gas giant that has a track record of optimal capital structure and Capex discipline across the commodity price cycle, making it a low-risk energy player producing industry-leading returns. XOM’s expected growth rate for earnings per share for the next year is 21.88%, which aligns favorably with the industry growth rate of 16.30%.\nHouston, TX-based Chevron is one of the largest publicly traded oil and gas companiesthat participates in every aspect related to energy,from oil production to refining and marketing. CVX generates more than $200 billion in annual revenues and produces over three million barrels per day of oil equivalent. The Zacks Consensus Estimate for CVX’s 2025 earnings indicates 2.49% year-over-year growth.\nBP, an integrated oil and gas company, is driven by its strategic shift toward traditional and renewable energy. BP plans to reduce debt and strengthen its balance sheet while prioritizing shareholder returns by generating proceeds from asset sales. XOM’s expected growth rate for earnings per share for the next year is 11.76%.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nPetroleo Brasileiro S.A.- Petrobras (PBR) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nCVX and XOM are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nBP, together with its partner CVX, operates the Far South field, situated 4 miles toward the north of the Constellation field.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 12-05_ExxonMobil Begins Installing Fourth FPSO to Tap Guyana's Reserves",
    "date": "",
    "content": "Title: ExxonMobil Begins Installing Fourth FPSO to Tap Guyana's Reserves\nDate: 2025-04-16 12:05\nURL: https://finance.yahoo.com/news/exxonmobil-begins-installing-fourth-fpso-120500291.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nExxon Mobil Corporation XOM is moving closer to expanding its oil output in Guyana, as its fourth floating production storage and offloading (FPSO) vessel, One Guyana, begins the installation process offshore. This initiative, confirmed by Guyana’s maritime authority earlier this week, marks a significant step toward the rapid development of the country’s prolific Stabroek Block.\nBuilt by SBM Offshore, the One Guyana FPSO has a production capacity of 250,000 barrels per day. It departed Singapore in mid-February and reached Guyanese waters this week. Once operational, the vessel is expected to help push the consortium’s total production capacity to around 940,000 barrels per day by the end of 2025.\nThe FPSO will support the development of ExxonMobil's Yellowtail and Redtail fields, both located within the giant Stabroek Block. With over 11 billion barrels of recoverable resources discovered, the block has become one of the most significant offshore oil finds in recent history.\nAfter recent upgrades, the company produced an average of 616,000 barrels per day from its three operational FPSOs in 2024. The addition of One Guyana marks a significant step toward boosting that number.\nExxonMobil confirmed the vessel's arrival in a recent statement, noting that production from the Yellowtail project is expected to commence later this year, once installation and well work are complete. According to shipping data, One Guyana is currently positioned near Exxon’s three active FPSOs in Guyanese waters.\nWith two more FPSOs scheduled to arrive over the next two years, ExxonMobil is signaling continued confidence in Guyana's role as a key pillar of its upstream growth strategy. The rapid deployment of infrastructure and consistent production ramp-ups suggest that the South American nation is poised to become a major player in global oil markets, with ExxonMobil at the helm.Top of Form\nBottom of Form\nExxonMobil currently carries a Zack Rank #4 (Sell).\nInvestors interested in the energy sector may look at some better-ranked stocks like Archrock Inc. AROC, Delek Logistics Partners, LP DKL and Kinder Morgan, Inc. KMI. While Archrock and Delek Logistics Partners presently sport a Zacks Rank #1 (Strong Buy) each, Kinder Morgan carries a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\nArchrock is an energy infrastructure company based in the United States with a focus on midstream natural gas compression. AROC provides natural gas contract compression services and generates stable fee-based revenues.\nArchrock’s earnings beat estimates in three of the trailing four quarters and met once, delivering an average surprise of 8.81%.\nDelek Logistics Partners manages and owns systems for moving and storing oil and other products. The company operates pipelines that transport crude oil and refined products like gasoline and diesel. DKL also collects crude oil from different areas and stores it in tanks.\nDelek Logistics Partners’ earnings beat estimates in two of the trailing four quarters, met once and missed on the other, delivering an average surprise of 79.75%.\nKinder Morgan is a leading North American midstream player with a stable and resilient business model, largely driven by take-or-pay contracts, which ensure consistent earnings and facilitate reliable capital returns to shareholders. KMI operates one of the largest natural gas pipeline networks, positioning it to benefit from the projected increase in U.S. natural gas demand by 2030.\nKinder Morgan’s earnings beat estimates in one of the trailing four quarters, met once and missed in the other two, delivering an average negative surprise of 1.85%.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nKinder Morgan, Inc. (KMI) : Free Stock Analysis Report\nDelek Logistics Partners, L.P. (DKL) : Free Stock Analysis Report\nArchrock, Inc. (AROC) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nCVX and XOM are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nE signs a MoU with YPF to jointly evaluate a major LNG export project in Argentina. The project is aimed at tapping the Vaca Muerta shale to meet rising global gas demand.\nThese three top-ranked, best-performing and well-managed funds can help you maximize your retirement portfolio returns.\nTravelers (TRV) delivered earnings and revenue surprises of 198.44% and 2.17%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-07_Chevron or ExxonMobil_ Which Big Oil Leads the Permian Charge_",
    "date": "",
    "content": "Title: Chevron or ExxonMobil_ Which Big Oil Leads the Permian Charge_\nDate: 2025-04-16 13:07\nURL: https://finance.yahoo.com/news/chevron-exxonmobil-big-oil-leads-130700866.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChevron CVX and ExxonMobil XOM are two of the largest publicly traded oil and gas companies in the world with operations that span almost every corner of the globe. The Permian Basin has become a linchpin for both as they sharpen their focus on scalable, high-return assets. Each company is doubling down on this prolific region serving as a key source of cash flow, but their paths diverge in strategy and execution.\nAccording to the Energy Information Administration (“EIA”), U.S. crude oil production, largely driven by the Permian, is expected to reach 13.5 million barrels per day (bpd) in 2025 and 13.6 million bpd in 2026. With Permian output set to grow by 290,000 bpd this year from 2024 and an additional 170,000 bpd in 2026, the region will account for nearly half of the nation’s oil supply, solidifying its role in the energy market. This surge in production is backed by record-breaking rig efficiency, robust infrastructure and continued investments in drilling innovations, ensuring long-term sustainability and profitability for key players in the basin.\nChevron holds 1.78 million net acres in the Delaware and Midland sub-basins of Texas and New Mexico, making it one of the largest leaseholders in the Permian. It boosts efficiency by drilling several horizontal wells from a single site, a method known as factory-style development. In 2024, Chevron’s average daily output from the Permian basin stood at 405,000 barrels of oil, 251,000 barrels of NGLs, and 1.6 billion cubic feet of natural gas.Chevron aims to reach 1 million barrels of oil-equivalent per day (BOE/d) in 2025 and is already close, producing 992,000 BOE/d in the fourth quarter of 2024. With layered rock formations, upgraded infrastructure, and sustainability steps like using electric fleets and solar energy, Chevron’s strategy focuses on both growth and reducing environmental impact.Meanwhile, ExxonMobil has aggressively ramped up its Permian presence through acquisitions — most notably its $63 billion buyout of Pioneer Natural Resources in 2024. This move expanded Exxon’s footprint to more than 1.3 million net acres and significantly boosted output. In 2024, ExxonMobil’s Permian production averaged 1.185 million BOE/d, up 570,000 from the prior year. The company plans to double that to 2.3 million BOE/d by 2030. To get there, it’s using advanced methods like special proppants and cube drilling, and it aims to cut emissions to net zero in its original Permian operations by 2030 and in Pioneer’s by 2035.\nChevron leans on a disciplined capital allocation model, emphasizing cost control and asset returns. It supplements operated activity with joint ventures and royalty interests to balance risk and capital intensity. In particular, Chevron’s use of royalty interests allows it to benefit from production upside without committing large amounts of capital. On the other hand, ExxonMobil is leaning heavily into scale and integration. ExxonMobil, on the other hand, is integrating scale through acquisitions and focusing on operational synergies. Its Pioneer deal gave it high-quality, contiguous acreage, which is expected to support production growth at lower costs. Both companies are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nOver the past six months, Chevron has outperformed ExxonMobil despite both stocks being weighed down by trade-related uncertainty and new U.S. tariffs. The market has been jittery amid fears that steep levies could dent global demand.\nImage Source: Zacks Investment Research\nChevron’s valuation remains attractive, too. It trades at an EV/EBITDA multiple of 5.55, which is more favorable compared to ExxonMobil. This suggests better value for investors focused on cash flow and capital discipline.\nImage Source: Zacks Investment Research\nLooking ahead, Chevron appears better positioned in terms of earnings momentum. The Zacks Consensus Estimate calls for a 2.9% decline in its 2025 EPS, followed by a strong 23.1% rebound in 2026.\nImage Source: Zacks Investment Research\nIn contrast, ExxonMobil is projected to see a steeper 10.5% decline this year, with a 21.1% recovery anticipated in 2026. The near-term outlook for ExxonMobil remains more uncertain, weighed down by integration costs from recent acquisitions and ongoing inflationary pressures. (Find the latest EPS estimates and surprises on Zacks Earnings Calendar.)\nImage Source: Zacks Investment Research\nWhile both Chevron and ExxonMobil are deeply invested in the Permian Basin and share a commitment to scale and lower emissions, Chevron currently holds the upper hand. It combines consistent execution with financial discipline and a clear path toward its production goals. While CVX holds a Zacks Rank #3 (Hold), it stands on firmer ground than XOM, which holds a Zacks Rank #4 (Sell). For now, Chevron looks better placed to navigate market headwinds and deliver stable, long-term shareholder value. You can see the complete list of today’s Zacks #1 Rank stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nThe move comes amid an ongoing labor dispute post the expiration of the members' contract on April 4 at Electric Boat, a part of the defense contractor's marine systems segment, which assembles nuclear-powered submarines for the U.S. Navy.  The union members are also seeking the restoration of pensions, as they argue that General Dynamics is pushing for increases of 52% to 161% in weekly medical insurance costs.  General Dynamics has received significant contract awards from the Pentagon for building the Navy's Virginia-class submarines, but is years behind schedule because of skilled labor shortages, design issues, and supply chain challenges stemming from the pandemic.\nMany growth-focused companies don't pay dividends at all, which is why the yield on the S&P 500 (SNPINDEX: ^GSPC) has fallen to just 1.4%.  Stocks with reliable dividends and high yields can be excellent ways to collect passive income no matter what the broader market is doing.  Here's why these three fool.com contributors think Chevron (NYSE: CVX), Brookfield Renewable Partners (NYSE: BEP) (NYSE: BEPC), and MSC Industrial Direct (NYSE: MSM) are three high-yield dividend stocks to buy now.\nWe recently published a list of 10 Dirt Cheap Stocks To Invest In Now. In this article, we are going to take a look at where Bristol-Myers Squibb Company (NYSE:BMY) stands against other dirt cheap stocks to invest in now. Investor’s Guide to Navigating the Volatilitc The stock market has been experiencing volatility and has […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-22_Sector Update_ Energy Stocks Advance Premarket Wednesday",
    "date": "",
    "content": "Title: Sector Update_ Energy Stocks Advance Premarket Wednesday\nDate: 2025-04-16 13:22\nURL: https://finance.yahoo.com/news/sector-energy-stocks-advance-premarket-132254115.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nEnergy stocks advanced premarket Wednesday with the Energy Select Sector SPDR Fund (XLE) 0.6% higher\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nCVX and XOM are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-36_Is Exxon Mobil (XOM) Among The Top Goldman Sachs Value Stocks_",
    "date": "",
    "content": "Title: Is Exxon Mobil (XOM) Among The Top Goldman Sachs Value Stocks_\nDate: 2025-04-16 19:36\nURL: https://finance.yahoo.com/news/exxon-mobil-xom-among-top-193647843.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where Exxon Mobil Corporation (NYSE:XOM) stands against other Goldman Sachs value stocks to invest in.\nAs we recently discussed in another article, growth stocks are massively overvalued and trading at significant premiums, which is why investment firms advise investors to concentrate on value stocks. Near the end of March 2025, artificial intelligence stocks that had taken the market over by storm faced losses, while undervalued stocks gained momentum. Similarly, hedge fund managers believe that now is the time to invest in value stocks, with cheap equities available across all industries. Banks, energy, consumer durables, healthcare, and media companies offer lucrative investment opportunities.\nSo, what is value investing? Matthew Fine, portfolio manager at Third Avenue Management, describes it as identifying companies trading at a notable discount to a conservative estimate of their true value. These opportunities often arise when a business, industry, or region faces challenges that cause investors to overreact and assume current difficulties will persist long-term. This pessimism creates chances to invest at attractive valuations. While broader equity markets currently appear overvalued, largely driven by the United States, Third Avenue sees overlooked value in many individual companies. Despite a rocky economy, the fund manager believes many quality businesses have become even cheaper, offering compelling opportunities for patient investors. However, the key is to avoid buying a company that seems cheap just because it has temporary advantages that might not last.\nWarren Buffett is the king of value investing, and back in 2023, he commented in his annual shareholder meeting that “what gives you opportunities is other people doing dumb things”. Buffett’s Berkshire picks up stocks when others are panic-selling their holdings, and although the Oracle of Omaha understands that the world is rapidly changing, he still sees several value investing opportunities.\nOverall, the stock market is in mayhem because of the uncertainty brought on by US trade wars and tariffs. However, institutional investors like Goldman Sachs align with the market perspective and have a thriving $634 billion portfolio.\nAerial view of a major oil rig in the middle of the sea, pumping crude oil.\nTo compile our list of Goldman Sachs' top value stock picks, we searched the investment firm’s Q4 2024 portfolio, starting from the top and assessing the PE ratios as of April 11. From there, we chose the top 12 stocks with PE ratios of 25 or under as Goldman Sachs' value picks. We have also mentioned the Q4 2024 hedge fund sentiment around the holdings for further insight. The list is ranked in ascending order of Goldman Sachs’ stake value.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nGoldman Sachs' Q4 2024 Stake Value: $2,504,575,163\nP/E Ratio as of April 11: 12.85\nNumber of Hedge Fund Holders: 104\nExxon Mobil Corporation (NYSE:XOM), an American multinational oil and gas titan, is one of the best Goldman Sachs value stocks. The investment firm holds 6.5 million shares of XOM worth $2.5 billion as of Q4 2024. On April 4, TD Cowen reiterated a Buy rating on Exxon Mobil Corporation (NYSE:XOM) but trimmed the price target from $128 to $125. While the company’s financial outlook has slightly shifted, analysts at TD Cowen remain confident in Exxon’s performance and share buyback plans, even if commodity prices dip. They still see it as one of the strongest picks in the energy sector.\nIn 2024, ExxonMobil reported $33.7 billion in earnings, slightly less than last year’s $36 billion. The company generated $55 billion in cash from operations and returned $36 billion to shareholders through dividends and stock buybacks. It also led the industry in shareholder returns over the past 1, 3, and 5 years. Exxon Mobil Corporation (NYSE:XOM) plans to maintain its $20 billion annual share repurchase program through 2026. XOM raised its dividend for the 42nd straight year and ended 2024 with a $23.2 billion cash balance and low debt levels.\nExxon Mobil Corporation (NYSE:XOM) has remodeled its oil and gas portfolio by discarding assets worth $15 billion and focusing on resources like the Permian Basin, Guyana, and LNG. The company’s full-year production came in at 4.3 million BOED, which can potentially reach 5.4 million BOED by 2030. The Pioneer acquisition boosted its Permian position, and innovation is improving recovery rates. XOM also plans to double its LNG capacity through projects in the United States, Papua New Guinea, and Mozambique.\nAccording to Insider Monkey’s fourth quarter database, 104 hedge funds held long positions in Exxon Mobil Corporation (NYSE:XOM), compared to 86 funds in the earlier quarter. Jean-Marie Eveillard’s First Eagle Investment Management was a significant stakeholder of the company, with 8.6 million shares valued at roughly $934 million.\nOverall, XOM ranks 6th among the Goldman Sachs Value Stocks: Top 12 Stock Picks. While we acknowledge the potential of value stocks, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than XOM but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]