[
  {
    "title": "2025-04-16 14-33_After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street",
    "date": "",
    "content": "Title: After surge to record highs, gold overtakes 'Magnificent 7' as the most crowded trade on Wall Street\nDate: 2025-04-16 14:33\nURL: https://finance.yahoo.com/news/after-surge-to-record-highs-gold-overtakes-magnificent-7-as-the-most-crowded-trade-on-wall-street-143338618.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGold has surpassed the \"Magnificent Seven\" tech stocks as the most crowded trade on Wall Street as the precious metal surged to record highs this year amid volatile markets and an uncertain economic backdrop.\nAccording to the latest Bank of America fund managers survey published this week, nearly half of the fund managers surveyed (49%) see long gold, or bets that gold prices will rise, as the most crowded trade in the market right now. This marks the first time in two years that fund managers did not see the Magnificent Seven as Wall Street's most crowded trade, according to the survey.\nGold futures (GC=F) on Wednesday rose to an all-time high of $3,334 as investors continued to favor the safe-haven asset amid a falling US dollar (DX-Y.NYB) and tariff uncertainty.\nGold prices have surged more than 27% year to date, while the Magnificent Seven tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), Tesla (TSLA), and Nvidia (NVDA) — are down considerably.\nRead more: How to invest in gold in 4 steps\nTesla stock has led Magnificent Seven losses and is down about 38% since the start of 2025. Apple stock has fallen 21%.\nNvidia stock has also declined 21% year to date. In a regulatory filing, the AI chip giant warned of a multibillion-dollar impact from US export controls on China, which weighed on shares.\nShares of Alphabet, Microsoft, Meta, and Amazon — the remainder of the Magnificent Seven — are all down by double-digit percentages since the start of the year.\nGold's rally comes as central banks' demand hit all-time highs last year and as investors increased inflows into physical gold-backed exchange-traded funds (ETFs).\n\"The new highs in gold are signaling a shift in appetite for US assets,\" Ryan McIntyre, senior managing partner at asset manager firm Sprott, recently told Yahoo Finance.\n\"Confidence in the US has clearly been shaken, so people are looking to diversify.\"\nWall Street analysts have remained bullish on gold, upping their price forecasts on the precious metal even amid its fast ascent.\nSome 42% of fund managers expect gold will be the best-performing asset of 2025, up from 23% in March, according to Bank of America.\nThe firm's survey also showed investors have rotated out of US assets by a record amount over the past two months, with 73% of respondents saying \"US exceptionalism\" has peaked.\nInes Ferre is a Senior Business Reporter for Yahoo Finance. Follow her on X at @ines_ferre.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nSTH MVRV dropped to 0.82, signaling investor stress — while long-term holders quietly accumulate.\nSemiconductor stocks sank Wednesday after Nvidia and Advanced Micro Devices warned they would take a hit after the Trump administration moved to limit the chipmakers' exports to China.\nOppenheimer analysts on Wednesday initiated coverage of Lyft with an \"outperform\" rating, writing that they expect the company to benefit as ridesharing continues \"to challenge the rising cost of car ownership.\"\nOther companies hit hard include a medical device maker, a semiconductor firm and the maker of Vans sneakers.\nGold futures opened at $3,248.40 an ounce on Wednesday, up from Tuesday's close of $3,218.70. Gold's highest opening price in history follows ongoing uncertainty about changing U.S. tariff policies and the U.S. inflation outlook.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-56_There are 'definitely buying opportunities' in the tech sell-off",
    "date": "",
    "content": "Title: There are 'definitely buying opportunities' in the tech sell-off\nDate: 2025-04-16 14:56\nURL: https://finance.yahoo.com/video/definitely-buying-opportunities-tech-sell-145640214.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNvidia (NVDA), Advanced Micro Devices (AMD), and ASML (ASML) are dragging the market lower as investors weigh the impact of the US-China trade war and a potential economic slowdown fueled by US President Trump's policies.\nSummit Global Investments chief investment officer David Harden sits down with Madison Mills and Brad Smith to discuss how to play the tech sector, comparing Microsoft (MSFT), Nvidia (NVDA), Tesla (TSLA), and Alphabet (GOOG, GOOGL).\nTo watch more expert insights and analysis on the latest market action, check out more Morning Brief here.\nIt's time now for today's strategy session. US stocks opening in the red this morning with tech leading the losses here. Options data showing investors are positioning for further losses in mega cap tech and semis ahead of earnings. That's according to data from Bloomberg. Joining us now with more, David Harden, Summit Global Investments CIO. David, great to speak with you this morning. Certainly a lot of pain for the big tech names this morning.\nThank you.\nAre you buying big tech at these levels?\nWell, I think there's some definitely buying opportunities that are coming available. For example, one of the things that I like is Google. Google has $25 billion in free cash flows last quarter. It's it's it's growing at double digits year-over-year. Its profit margins are great. Its return on equity is around 30%. And the PE is now finally getting down into those reasonable levels you can consider 16, 17, 15. So I think I think these are buying opportunities to start accumulating more positions in something like a Google.\nI think what you're highlighting is the, you know, this one thing is not like the other in the tech trade even as you're looking at what is more of a platform play where there's perhaps more of a reason to believe that the consumers would flow into free products that a Google might offer online versus what we're seeing in some of the products and propensity to spend in some of the other tech plays where there might be a consumer pullback in those discretionary dollars. How do you continue to look across these companies once we get into earnings and see how they're forecasting and guiding for the rest of the year on that?\nYeah, I think that's really important because where did their earnings come from, right? And and how are they tied to tariffs? That's really important. And how does those tariffs impact like advertising for Google. So you want to look kind of through those earnings into the consumer and and see what that consumer's doing and how that consumer's acting. And I think that's another play in tech. There is a separation. What? Are they hardware? Like Apple's had to navigate a lot more tariff news than Google's had to navigate, even though they're both navigating it.\nAnd we're starting to see individual companies being used as tools in this trade war. Obviously with Nvidia's specific chips being impacted by export controls, to what extent does that change any fundamental view you have on these stocks or should investors look past any of that daily headline news on tariffs?\nI I I think absolutely, you have to consider that and you have to manage your your risk here. Risk is really, really important in these markets and managing that is essential. So where you have the H20 chip, for example, invidia, they have clearly shown last night on their earnings that they have a difficult time more difficult time than some of these other tech names. So look for tech names that are more US based. Look for tech names that have more um say high-quality earnings. Even though somebody could question Google's high quality earnings, their earnings scores are not very good, but it is more US based. It is more consumer based in the US. And so that's very, very important in tech.\nIt seems like we've all been asking the question of what's the next big catalyst to drive conviction within the markets. Does that mean the AI trade or the fast-paced growth cycle for the AI trade is dead?\nNo, I don't think so because let's face it. Probably 10 minutes ago you were looking at AI, or I was looking at AI, or somebody was looking at some agent and the and the new things that are coming out with AI agents and things of this nature are absolutely impactful. The power of AI is growing. It's not shrinking. We're using it more. And it will continue to spread. So I think that trade's not done. I think there'll continue to be infrastructure build outs and AI things, but it has to go past just the technology. You have to look into the in industrial side of tech and where are they putting and building these centers at.\nI want to get to one of your cells, but first really quickly, would you buy Nvidia at these levels?\nUh probably not right now. No. I would be if you're if you're in it, it's time to hold and be patient. But if you're looking to buy, I think there's better opportunities to buy.\nAnd I know one of them is Microsoft, correct?\nI if you're looking at the two comparison, yes, Microsoft today, Nvidia's down more 6-7%, Microsoft's down in one, one and a half right now. I I think that's a safer play. It's a little bit more if if you will ingrained in our society. The revenues are are more um consistent. And so that's something that I would look at is more something like a Google or Microsoft. Both of those I would consider buying opportunities, especially at these levels.\nAnd I know a sell for you is one member of the mag 7. Talk to us about Tesla.\nWell, I think Tesla's had some negative earnings. We know that and um it's under pressure. I think every Tesla's uh I I saw a sticker on the back of a Tesla the other day that said something like, I bought this post crazy. So this is this is very, very important right now in our society. But having said that, I think Elon Musk is going to tell you when it's the right time to buy Tesla. And he hasn't done that yet. So he he's outspoken. We know what he's capable of. And until he's ready to let us know it's the right time to buy, I think it's you avoid that stock right now.\nOutside of tech, where's your favorite trade, your top idea right now?\nAnd I think I think outside of tech, you're going to have to look at some of the healthcare companies that have really been hurt with the Pharmatech news and other things.\nIt seems like they're next though in the docket for what potential tariffs may look like.\nOh, absolutely. So look for those healthcare companies that are not necessarily tied to pharma and they get their revenue, surgical centers and other places that are hospital-based, that are US-based, that we are going to use on a daily basis, but really are not tied to that. Those are the ones that have been kind of the baby been thrown out with the bath water. Their their valuations are very good right now.\nAbsolutely. David, great to see you here in studio. Thanks for taking the time with us this morning.\nThank you.\nAbsolutely.\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries.\n“I don’t own Nvidia (NVDA), but this is the first time I’m really starting to look at (Nvidia)” stock, prominent CNBC contributor Stephanie Link said on the channel today. Link suggested that NVDA would rebound significantly over the longer term, and she noted that she had been buying more shares of one of NVDA’s rivals, […]\nGold bumped the 'Magnificent Seven' tech stocks to take the top spot as a crowded trade, according to a BofA survey.\nBuying stocks when overall markets are falling can seem dangerous and counterintuitive.  A great example would have been buying shares of quality companies amid the market chaos of 2020.  While it wasn't an easy time to buy stocks given the uncertainty ahead, doing so could have resulted in some significant gains for investors.\nThe stock market has been in turmoil so far this year amid the tariff-related issues that threaten to send the U.S. economy into a potential recession, and a big drop in consumer sentiment this month has added to the overall negativity.  So, SoundHound is at the beginning of a terrific growth curve, considering that it expects to generate $167 million in revenue this year at the midpoint of its guidance range.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nTSMC, the main global producer of advanced chips used in artificial intelligence applications, is set to report a 57% leap in first-quarter profit on Thursday, though it is also likely to flag risks from U.S. President Donald Trump's trade policies.  Taiwan Semiconductor Manufacturing Co is expected to report a net profit of T$354.6 billion ($10.92 billion) for the three months ended March 31, according to a LSEG SmartEstimate drawn from 18 analysts.\n(Reuters) -Californians further soured on Tesla in the first quarter, pulling down the electric-vehicle maker's registrations by 15% as backlash against Elon Musk's company intensified in the state that has embraced EVs most across the United States.  There have been relentless protests in many cities in California - echoing the backlash in other countries - against Musk's involvement in U.S. President Donald Trump's administration and his embrace of far-right politics in Europe, a key factor behind Tesla's 13% drop in first-quarter deliveries globally.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-00_Trump's trade war unlikely to bring tech manufacturing back to the US",
    "date": "",
    "content": "Title: Trump's trade war unlikely to bring tech manufacturing back to the US\nDate: 2025-04-16 15:00\nURL: https://finance.yahoo.com/news/trumps-trade-war-unlikely-to-bring-tech-manufacturing-back-to-the-us-150053245.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPresident Trump is determined to bring tech manufacturing to the US via massive tariffs. But there's little chance companies like Apple (AAPL) will reinvent their supply chains before Trump leaves office in 2028.\nThe Trump administration hit China with a whopping 145% tariff on Chinese-made goods before announcing exemptions for tech devices ranging from smartphones to laptops on Friday. But Commerce Secretary Howard Lutnick said during an interview with Jonathan Karl of ABC News on Sunday that the move was temporary and only applied to Trump's reciprocal tariffs.\nInstead, he explained, tech products will be tariffed as part of the administration's planned duties on semiconductors, which could be announced later this week.\nStill, even the threat of sky-high tariffs won't be enough to force tech giants like Apple to pick up and move their suppliers to the US en masse.\nRead more: The latest news and updates on Trump's tariffs\n\"Anything is possible, but the setup of smartphone production in India has been a three-year process from site identification through ramped-up production, with at least another two years to achieve full supply chain integration,\" Chris Rogers, head of supply chain research at S&P Global Market Intelligence, told Yahoo Finance.\nIt's not just about timing. Companies would also need the workers to build devices.\n\"While there's a degree of automation possible and while many of the components needed are made in the US, there's still a need for tens of thousands of trained electronics assemblers willing to work long, arduous hours in highly repetitive tasks,\" he added.\nCompanies including Nvidia (NVDA), TSMC (TSM), Apple, and others have announced increased investments in the US to win over Trump and avoid tariffs. On Monday, Nvidia said it will produce $500 billion in AI infrastructure in the US over the next four years through partners including Foxconn (601138.SS), TSMC, and Wistron (3231.TW).\nApple also said it will spend $500 billion, and TSMC has said it will spend $165 billion. Many of those plans, however, were already in the works or don't necessarily go above prior spending levels. Nvidia, for example, talked up building chips in the US last year.\nAnd while that doesn't take away from the fact that the companies are pouring money into the US, it doesn't exactly support the idea that they're moving vast amounts of their manufacturing capabilities to America.\n\"We believe hardware companies will remain focused on accelerating US-bound product assembly out of China, and see India and Mexico as the most-likely incremental beneficiaries of these actions (we'd argue Vietnam and Mexico have been the biggest beneficiaries over the last 5 years),\" Morgan Stanley analyst Erik Woodring wrote in an investor note.\n\"We just don't see large volume hardware production ever reaching US shores — these plans take years to devise, the costs (capex and opex) associated with manufacturing hundreds of millions of products annually in the US are high, and most importantly, tariff exemptions on finished goods disincentivize on-shoring (and is why we didn't see onshoring after President Trump's first administration),\" he added\nEven if companies brought their manufacturing bases to the US, they'd still have to deal with a host of headwinds ranging from worker salaries to the need to continue importing certain parts from abroad.\nAccording to Bank of America's Wamsi Mohan, while Apple may be able to find enough laborers in the US to build its iPhones, importing the company's entire supply chain will still take some time.\n\"This is because, while it may be possible to move final assembly to the US, moving the entire iPhone supply chain would be a much bigger undertaking and would likely take many years, if even possible.\"\nIt's not just Apple that's contending with these issues. Everything from laptop makers to display producers would face the same problems if they were to move to the US. That doesn't even take into account the potential price increases associated with manufacturing tech products in the US.\nAccording to some estimates, prices on devices could jump by hundreds of dollars, resulting in demand destruction as consumers seek out less expensive options or hold onto their existing smartphones and computers for longer periods.\nWhile it's unlikely manufacturing is coming back to the US, there's still plenty of uncertainty about how tech companies and consumers navigate the next four years of tariff shocks.\nEmail Daniel Howley at dhowley@yahoofinance.com. Follow him on Twitter at @DanielHowley.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\nCEOs have warned on the economy because of Trump administration tariff policies. US Treasury Secretary Scott Bessent has a message for them all.\nApple stock fell more than 2% late Wednesday morning, once again putting its market capitalization below the $3 trillion mark after a brief rally.\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nAfter expanding into internet search and exploring consumer gadgets, the company is now reportedly working on a social network.\nASML (NASDAQ: ASML) stock saw a big valuation pullback in Wednesday's trading.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) fell 2.2%, and the Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 3.1%.  ASML reported its first-quarter results before the market opened this morning and posted earnings that actually came in far better than the market's expectations.\nHere's why your water bill is going up.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nWall Street private equity giant Blackstone is teaming up with Vanguard and Wellington Management to get more private assets into the portfolios of everyday investors.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-29_Microsoft Corporation (MSFT)_ UBS Cuts Price Target as Data Center Projects Pause",
    "date": "",
    "content": "Title: Microsoft Corporation (MSFT)_ UBS Cuts Price Target as Data Center Projects Pause\nDate: 2025-04-16 15:29\nURL: https://finance.yahoo.com/news/microsoft-corporation-msft-ubs-cuts-152908161.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 10 AI Stocks on the Move. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other AI stocks on the move.\nMarket uncertainty aside, the AI race is tighter than ever. A report by Stanford University’s Institute for Human-Centered AI (HAI) states that not only has the battlefield become tighter, but also more crowded than previously. The report notes that Google and OpenAI are neck to neck in the race to build cutting-edge AI, and that other companies are fiercely closing in. Meta, Anthropic, and Elon Musk’s xAI are a few of these names. Chinese competitors are also closing in on the AI race. In particular, DeepSeek’s R1 model is very close to the top-performing models of two of the leading AI companies.\n“It creates an exciting space. It’s good that these models are not all developed by five guys in Silicon Valley. Chinese models are catching up as far as performance to the US models..but across the globe, there are new players emerging in the space.”\nIn recent news, OpenAI has launched its new AI model GPT-4.1, along with smaller versions GPT-4.1 mini and GPT-4.1 nano. These models boast major improvements in coding, instruction following, and long context comprehension.\nREAD NOW: 10 AI Stocks to Watch Amid Market Volatility and 14 AI Stocks Catching Wall Street’s Attention\nAccording to OpenAI, the models outperform the company’s most advanced GPT-4o model across the board and are available only on OpenAI’s application programming interface (API). In particular, the GPT-4.1 brags a 21% improvement over GPT-4o and 27% over GPT-4.5 on coding. Moreover, there are improvements in instruction following and long context comprehension, which make these models a better choice for powering AI agents.\n“Benchmarks are strong, but we focused on real-world utility, and developers seem very happy.”\nOpenAI also noted that these models operate at a “much lower cost” compared to GPT-4.5, and that the company would turn off the GPT-4.5 preview that is available in the API in July because the new models offer “improved or similar performance.”\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points  (see more details here).\nA development team working together to create the next version of Windows.\nNumber of Hedge Fund Holders: 317\nMicrosoft Corporation (NASDAQ:MSFT) provides AI-powered cloud, productivity, and business solutions, focusing on efficiency, security, and AI advancements. On April 14, UBS lowered the firm’s price target on the stock to $480 from $510 and kept a “Buy” rating on the shares. The firm’s price target revision comes after Microsoft’s formal acknowledgement that it is slowing or pausing some data center projects. The firm’s evaluation reveals that Microsoft’s adjustments are most likely not AI demand-related, and that the pausing activity isn’t a materially negative AI demand signal. The analyst further told investors in a research note that any capacity changes related to OpenAI can be absorbed by Oracle and others.\nOverall, MSFT ranks 1st on our list of AI stocks on the move. While we acknowledge the potential of MSFT as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than MSFT but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where ServiceNow, Inc. (NYSE:NOW) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-48_Microsoft researchers say they've developed a hyper-efficient AI model that can run on CPUs",
    "date": "",
    "content": "Title: Microsoft researchers say they've developed a hyper-efficient AI model that can run on CPUs\nDate: 2025-04-16 15:48\nURL: https://techcrunch.com/2025/04/16/microsoft-researchers-say-theyve-developed-a-hyper-efficient-ai-model-that-can-run-on-cpus/?.tsrc=rss\nContent:\nLatest\t\n\n\n\n\t\tAI\t\n\n\n\n\t\tAmazon\t\n\n\n\n\t\tApps\t\n\n\n\n\t\tBiotech & Health\t\n\n\n\n\t\tClimate\t\n\n\n\n\t\tCloud Computing\t\n\n\n\n\t\tCommerce\t\n\n\n\n\t\tCrypto\t\n\n\n\n\t\tEnterprise\t\n\n\n\n\t\tEVs\t\n\n\n\n\t\tFintech\t\n\n\n\n\t\tFundraising\t\n\n\n\n\t\tGadgets\t\n\n\n\n\t\tGaming\t\n\n\n\n\t\tGoogle\t\n\n\n\n\t\tGovernment & Policy\t\n\n\n\n\t\tHardware\t\n\n\n\n\t\tInstagram\t\n\n\n\n\t\tLayoffs\t\n\n\n\n\t\tMedia & Entertainment\t\n\n\n\n\t\tMeta\t\n\n\n\n\t\tMicrosoft\t\n\n\n\n\t\tPrivacy\t\n\n\n\n\t\tRobotics\t\n\n\n\n\t\tSecurity\t\n\n\n\n\t\tSocial\t\n\n\n\n\t\tSpace\t\n\n\n\n\t\tStartups\t\n\n\n\n\t\tTikTok\t\n\n\n\n\t\tTransportation\t\n\n\n\n\t\tVenture\t\n\n\n\n\t\tEvents\t\n\n\n\n\t\tStartup Battlefield\t\n\n\n\n\t\tStrictlyVC\t\n\n\n\n\t\tNewsletters\t\n\n\n\n\t\tPodcasts\t\n\n\n\n\t\tVideos\t\n\n\n\n\t\tPartner Content\t\n\n\n\n\t\tTechCrunch Brand Studio\t\n\n\n\n\t\tCrunchboard\t\n\n\n\n\t\tContact Us\t\n\nMicrosoft researchers claim they’ve developed the largest-scale 1-bit AI model, also known as a “bitnet,” to date. Called BitNet b1.58 2B4T, it’s openly available under an MIT license and can run on CPUs, including Apple’s M2.\nBitnets are essentially compressed models designed to run on lightweight hardware. In standard models, weights, the values that define the internal structure of a model, are often quantized so the models perform well on a wide range of machines. Quantizing the weights lowers the number of bits — the smallest units a computer can process — needed to represent those weights, enabling models to run on chips with less memory, faster.\nBitnets quantize weights into just three values: -1, 0, and 1. In theory, that makes them far more memory- and computing-efficient than most models today.\nThe Microsoft researchers say that BitNet b1.58 2B4T is the first bitnet with 2 billion parameters, “parameters” being largely synonymous with “weights.” Trained on a dataset of 4 trillion tokens — equivalent to about 33 million books, by one estimate — BitNet b1.58 2B4T outperforms traditional models of similar sizes, the researchers claim.\nBitNet b1.58 2B4T doesn’t sweep the floor with rival 2 billion-parameter models, to be clear, but it seemingly holds its own. According to the researchers’ testing, the model surpasses Meta’s Llama 3.2 1B, Google’s Gemma 3 1B, and Alibaba’s Qwen 2.5 1.5B on benchmarks including GSM8K (a collection of grade-school-level math problems) and PIQA (which tests physical commonsense reasoning skills).\nPerhaps more impressively, BitNet b1.58 2B4T is speedier than other models of its size — in some cases, twice the speed — while using a fraction of the memory. \nThere is a catch, however. \nAchieving that performance requires using Microsoft’s custom framework, bitnet.cpp, which only works with certain hardware at the moment. Absent from the list of supported chips are GPUs, which dominate the AI infrastructure landscape. \nThat’s all to say that bitnets may hold promise, particularly for resource-constrained devices. But compatibility is — and will likely remain — a big sticking point.\nTopics\n\nAI Editor\n\n Microsoft researchers say they’ve developed a hyper-efficient AI model that can run on CPUs\n\n\n\n Figma ignores the fear, files paperwork for an IPO\n\n\n\n For security, Android phones will now auto-reboot after three days\n\n\n\n Figma sent a cease-and-desist letter to Lovable over the term ‘Dev Mode’\n\n\n\n Notorious image board 4chan hacked and internal data leaked\n\n\n\n Notion releases an AI-powered email client for Gmail\n\n\n\n Hertz says customers’ personal data and driver’s licenses stolen in data breach\n\n\n\n© 2025 Yahoo.\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!\n1,200+ founders & VCs. One epic day in Boston on July 15. Scale smarter, connect deeper — save $210 when you register now!"
  },
  {
    "title": "2025-04-16 16-00_Apple market cap falls back below $3 trillion as 'relief rally' fades amid new tariff uncertainty",
    "date": "",
    "content": "Title: Apple market cap falls back below $3 trillion as 'relief rally' fades amid new tariff uncertainty\nDate: 2025-04-16 16:00\nURL: https://finance.yahoo.com/news/apple-market-cap-falls-back-below-3-trillion-as-relief-rally-fades-amid-new-tariff-uncertainty-160003888.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nApple (AAPL) stock fell nearly 4% on Wednesday, sending the iPhone maker's market capitalization back below $3 trillion as tariff pressures continue to weigh on the company after shares had enjoyed what some analysts called a \"relief rally\" earlier in the week.\nApple stock surged to start the week, leading the \"Magnificent Seven\" stocks higher as investors cheered the Trump administration's temporary tariff exemptions for tech products announced over the weekend.\nThe \"relief rally,\" as Citi's Atif Malik put it, briefly put Apple's value back above the $3 trillion mark after falling to its lowest value in almost a year last week at just under $2.6 trillion.\nApple is still the world's most valuable company, ahead of Microsoft (MSFT).\nUS Customs and Border Protection issued regulations late Friday exempting consumer electronics — and almost all of Apple's products — from reciprocal tariffs.\nOn April 2, Trump announced global reciprocal tariffs that would go into effect on April 9.\nRead more: The latest news and updates on Trump's tariffs\nThe president instead announced a 90-day pause on the reciprocal tariff plan last Wednesday — with the exception of a 145% reciprocal tariff on Chinese imports, a development cheered by Apple investors. Some 90% of Apple's iPhones are made in China.\nApple had shed more than $770 billion from its market cap between April 2 and April 8.\nApple's decline on Wednesday comes after Nvidia (NVDA) disclosed late Tuesday that the Trump administration had effectively banned exports of its H20 chips to China.\nNvidia's disclosure followed reports that Trump had been set to back off plans to restrict Nvidia's chips designed for China to comply with US trade rules.\nTo Jefferies analyst Edison Lee, these developments show that there are “many conflicting opinions within Trump's team on the issue of tariffs, strategies against China and US tech restrictions.\"\n\"The concern about Apple is that it will become harder to avoid the crossfire between the US and China as tariffs and restrictions come into play,\" DA Davidson analyst Gil Luria told Yahoo Finance in an email.\n\"The [export] restrictions on chips that came out from NVIDIA represent an escalation in the trade dispute.\"\nTech stocks fell across the board Wednesday, with the Nasdaq (^IXIC) dropping 3%.\nFellow Magnificent Seven stocks Meta (META) and Microsoft (MSFT) also sank, falling nearly 4%, while Nvidia plummeted almost 7%.\nTrump also set the stage to tariff semiconductors this week — the Commerce Department opened a probe into computer chips Tuesday under Section 232 of the Trade Expansion Act of 1962, which grants the president the ability to impose levies on imports due to national security. And Trump has promised that most electronics will still get wrapped up in his tariffs, which could hurt Apple.\n\"We are taking a look at Semiconductors and the WHOLE ELECTRONICS SUPPLY CHAIN in the upcoming National Security Tariff Investigations,\" he posted Sunday.\nLaura Bratton is a reporter for Yahoo Finance. Follow her on Bluesky @laurabratton.bsky.social. Email her at laura.bratton@yahooinc.com.\nClick here for the latest technology news that will impact the stock market\nRead the latest financial and business news from Yahoo Finance\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedDOGE Places Entire Staff of Federal Homelessness Agency on LeaveLA County Floats Leaner Budget Burdened by Fire and Legal CostsThe five-year note led\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nTSMC, the main global producer of advanced chips used in artificial intelligence applications, is set to report a 57% leap in first-quarter profit on Thursday, though it is also likely to flag risks from U.S. President Donald Trump's trade policies.  Taiwan Semiconductor Manufacturing Co is expected to report a net profit of T$354.6 billion ($10.92 billion) for the three months ended March 31, according to a LSEG SmartEstimate drawn from 18 analysts.\nTrump's Treasury secretary wants business owners to relax. That's hard to do when Trump's tariffs are pushing costs higher and profits lower and threatening a recession.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nAll is not lost when it comes to investing in Nvidia. Here's what Lawrence McDonald of the Bear Traps Report has to say.\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nThe dollar resumed its fall on Wednesday with both safe-havens and risk-sensitive currencies outperforming the greenback as traders waited to see if U.S. President Donald Trump’s administration reaches new trading agreements with partners.  The dollar tumbled last week on concerns over the economic impact of new tariffs and as investors shifted allocations overseas due to uncertainty on the erratic implementation of the trade levies.  The United States is in discussions with countries including Japan, while tensions between China and the U.S. are intensifying.\n(Reuters) -The ripple effects of Donald Trump's global trade war are increasingly being felt across numerous industries all at once and on Wednesday were once again exerting pressure on U.S. stock markets that have been roiled for weeks by his erratic trade policies.  Stocks fell broadly, with tech stocks hit particularly hard after bellwethers like Nvidia that are highly tied into the world's supply chain warned of hits to their bottom line.  Meanwhile, airlines said they are bracing for an uncertain summer travel season, and the head of the Federal Reserve noted slowing economic activity - but also cast a wary eye on the threat that tariffs pose to its goal of lowering inflation.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-00_Should You be Confident in Microsoft Corporation’s (MSFT) Ability to Retain Leadership Position in A",
    "date": "",
    "content": "Title: Should You be Confident in Microsoft Corporation’s (MSFT) Ability to Retain Leadership Position in A\nDate: 2025-04-16 16:00\nURL: https://finance.yahoo.com/news/confident-microsoft-corporation-msft-ability-160007402.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nFred Alger Management, an investment management company, released its “Alger Spectra Fund” first quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter, changing trade, monetary, and fiscal policies created increased volatility in U.S. stocks. The introduction of advanced artificial intelligence (AI) models from China was a further source of uncertainty.  Against this backdrop, the fund’s Class A shares underperformed the Russell 3000 Growth Index in the quarter. In addition, please check the fund’s top five holdings to know its best picks in 2025.\nIn its first quarter 2025 investor letter, Alger Spectra Fund emphasized stocks such as Microsoft Corporation (NASDAQ:MSFT). Microsoft Corporation (NASDAQ:MSFT) is a multinational software company that develops and supports software, services, devices, and solutions. The one-month return of Microsoft Corporation (NASDAQ:MSFT) was 0.54%, and its shares lost 6.34% of their value over the last 52 weeks. On April 15, 2025, Microsoft Corporation (NASDAQ:MSFT) stock closed at $385.73 per share with a market capitalization of $2.868 trillion.\nAlger Spectra Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its Q1 2025 investor letter:\n\"Microsoft Corporation (NASDAQ:MSFT) is a beneficiary of corporate America’s transformative digitization. The company operates through three segments: Productivity and Business Processes (Office365, LinkedIn, and Dynamics), Intelligent Cloud (Server Products and Cloud Services, Azure, and Enterprise Services), and More Personal Computing (Windows, Devices, Gaming, and Search). During the quarter, shares detracted from performance as Azure revenue growth missed analyst estimates, marking the third consecutive quarter of modest disappointment in this segment. However, AI-related sales growth exceeded expectations, accounting for 13% of Azure’s quarterly growth. Management also maintained their fiscal third quarter earnings guidance while highlighting improved operating profitability and lower tax rates. Despite the disappointing quarter, we remain confident in Microsoft’s ability to sustain its leadership position in AI.\"\nA development team working together to create the next version of Windows.\nMicrosoft Corporation (NASDAQ:MSFT) is in second position our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 317 hedge fund portfolios held Microsoft Corporation (NASDAQ:MSFT) at the end of the fourth quarter compared to 279 in the third quarter. In the fiscal second quarter of 2025, Microsoft Corporation (NASDAQ:MSFT) reported $69.6 billion in revenues, up 12% year-over-year. While we acknowledge the potential of Microsoft Corporation (NASDAQ:MSFT) as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is as promising as NVIDIA but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nWe covered Microsoft Corporation (NASDAQ:MSFT) in another article, where we shared the list of best NASDAQ stocks to buy so far in 2025. In addition, please check out our hedge fund investor letters Q1 2025 page for more investor letters from hedge funds and other leading investors.\nREAD NEXT: Michael Burry Is Selling These Stocks and A New Dawn Is Coming to US Stocks.\nDisclosure: None. This article is originally published at Insider Monkey.\nA Wall Street firm cut its price targets on Microsoft and 50 other software stocks on Tuesday, citing a weakening macroeconomic outlook.\nDHI's second-quarter fiscal 2025 results are likely to witness macro pressures and high costs and expenses. Learn more here.\nThe company plans to use the capital to further develop its technology, expand into new markets, among others.\nFred Alger Management, an investment management company, released its “Alger Spectra Fund” first quarter 2025 investor letter. A copy of the letter can be downloaded here. In the first quarter, changing trade, monetary, and fiscal policies created increased volatility in U.S. stocks. The introduction of advanced artificial intelligence (AI) models from China was a further […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 17-40_Veteran Analyst Is Bullish on NVDA, MSFT, AVGO",
    "date": "",
    "content": "Title: Veteran Analyst Is Bullish on NVDA, MSFT, AVGO\nDate: 2025-04-16 17:40\nURL: https://finance.yahoo.com/news/veteran-analyst-bullish-nvda-msft-174009973.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nDespite the stock market's current volatility, the longer-term outlook of technology is bright because large companies are going to invest in AI in order to reduce their costs and grow, Daniel Newman, the CEO of the Futurum Group told Schwab Network today.\nNewman is most bullish on tech names that have a great deal of exposure to large companies and relatively little exposure to consumers.\nHe identified Nvidia (NVDA), Microsoft (MSFT), and Broadcom (AVGO) as three stocks that he likes at this point.\nWhy Newman Is Bullish on NVDA\nNvidia is a leader in its space, and has the \"software framework, (and) stacks\" that it needs to succeed, Newman stated. Additionally, it will benefit from huge capital expenditures by the major cloud players, including Alphabet (GOOG, GOOGL) and Microsoft (MSFT), Newman asserted.\nWhy Newman Is Upbeat on MSFT and AVGO\nMSFT will benefit from the large amount of revenue that it obtains from companies and its low exposure to consumers, Newman stated. Moreover, its high capital expenditures will improve its position coming out of any economic downturn, the tech analyst predicted.\nAVGO is helping the large cloud players develop their own AI infrastructure. Over the longer term, the major cloud developers will want to create a significant amount of such infrastructure to become more independent, according to Newman.\nWhile we acknowledge the potential of NVDA, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than NVDA but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]\nBroadcom's new Incident Prediction uses AI to disrupt cyberattacks by predicting and blocking attackers' next moves, enhancing security without business disruption.\nApple stock fell more than 2% late Wednesday morning, once again putting its market capitalization below the $3 trillion mark after a brief rally.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 18-06_OpenAI In Talks to Buy Windsurf for About $3 Billion",
    "date": "",
    "content": "Title: OpenAI In Talks to Buy Windsurf for About $3 Billion\nDate: 2025-04-16 18:06\nURL: https://finance.yahoo.com/news/openai-talks-buy-windsurf-3-180624723.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- OpenAI is in talks to acquire Windsurf, an artificial intelligence-assisted coding tool formerly known as Codeium, for about $3 billion, according to a person familiar with the matter.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nThe deal would be OpenAI’s largest acquisition to date, and could help the company take on rising competition in the market for AI-driven coding assistants — systems capable of tasks like writing code based on natural language prompting. The terms of the deal haven’t been finalized and talks could still change or fall apart, said the person, who asked not to be identified because the matter is private.\nOpenAI and Windsurf declined to comment.\nWindsurf, formally called Exafunction Inc., had recently been in talks with investors including Kleiner Perkins and General Catalyst to raise funding at a $3 billion valuation. The company was valued at $1.25 billion in a deal led by General Catalyst last year.\nFounded in 2021, Windsurf has raised more than $200 million in venture capital funding, according to PitchBook data. Other investors include Greenoaks Capital Partners and AIX Ventures.\nIf the deal closes, OpenAI would compete more directly with companies like Anthropic, Microsoft Corp.-owned Github and Anysphere, which offer services in the fast-growing field of AI coding. The deal would also be a signal that, as more companies pile into the sector, the number of mergers and acquisitions will rise.\nOpenAI has acquired other startups before, including vector database company Rockset, and Multi, a remote collaboration platform.\nInvestors have recently been enthusiastically backing AI coding tools including Anysphere, the startup behind Cursor, which was in talks with investors to raise money at a valuation of almost $10 billion earlier this year.\nOpenAI last month closed a $40 billion financing led by SoftBank Group Corp., which values the developer of ChatGPT at $300 billion.\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staf\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-00_Microsoft vs. Oracle_ Which Cloud Stock Has More Fuel for Growth_",
    "date": "",
    "content": "Title: Microsoft vs. Oracle_ Which Cloud Stock Has More Fuel for Growth_\nDate: 2025-04-16 19:00\nURL: https://finance.yahoo.com/news/microsoft-vs-oracle-cloud-stock-190000978.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nIn the fiercely competitive cloud computing landscape, Microsoft MSFT and Oracle ORCL have emerged as significant players vying for market dominance. Both technology giants have deeply rooted histories in enterprise software, with Microsoft evolving from its Windows operating system foundation to become a cloud powerhouse, while Oracle built its empire on database technologies. As businesses worldwide accelerate their digital transformation initiatives, these companies continue to position themselves as essential partners in this journey. With artificial intelligence now driving the next wave of cloud innovation, comparing these two technology stalwarts offers valuable insights for investors seeking exposure to this high-growth sector. Let's delve deep and closely compare the fundamentals of the two stocks to determine which one is a better investment now.\nMicrosoft's cloud momentum continues to impress, with its Microsoft Cloud surpassing $40 billion in quarterly revenues for the first time in second-quarter fiscal 2025, representing robust 21% year-over-year growth. This performance demonstrates the company's successful transition from traditional software to cloud services. The Redmond-based tech giant has strategically positioned itself at the forefront of the AI revolution, with its AI business reaching an annual revenue run rate of $13 billion, growing 175% year over year.The Zacks Consensus Estimate for Microsoft’s fiscal 2025 revenues is pegged at $275.39 billion, suggesting 12.35% year-over-year growth. The consensus mark for earnings is pegged at $13.04 per share, indicating a 10.51% year-over-year increase. The figure has moved south by 0.2% over the past 30 days.See the Zacks Earnings Calendar to stay ahead of market-making news.Microsoft's strength lies in its comprehensive cloud ecosystem, spanning infrastructure (Azure), platform services, and software-as-a-service offerings. Azure, Microsoft's cloud infrastructure business, remains a key growth driver. Amazon Web Services, Google Cloud and Microsoft Azure combined accounted for a whopping 68% of the global cloud market in the fourth quarter of 2024, according to new data from IT market research firm Synergy.Microsoft has been steadily gaining share with fruitful strategic partnerships like one with OpenAI's APIs, exclusively running on Azure, providing Microsoft customers access to industry-leading AI models.On the innovation front, Microsoft continues to lead with groundbreaking solutions. In March 2025 alone, the company introduced several powerful innovations, including Azure AI Foundry's Responses API and Computer-Using Agent for AI-powered applications, as well as Microsoft Dragon Copilot for clinical workflows in healthcare. The company's commitment to data sovereignty is evident through its completion of the EU Data Boundary for Microsoft Cloud, enhancing its appeal to European customers.Microsoft's financial health remains strong, with operating income growing 17% in its most recent quarter. The company's strategic expansion of Copilot+ PC experiences across all major silicon platforms signals a significant pivot to increase market penetration of its AI capabilities. Furthermore, MSFT's introduction of AI agents to its Security Copilot platform addresses the escalating cybersecurity challenges facing organizations worldwide, with the company detecting more than 30 billion phishing emails and 7,000 password attacks per second in 2024.\nImage Source: Zacks Investment Research\nOracle has made strides in cloud infrastructure with its Oracle Cloud Infrastructure (“OCI”), reporting 51% revenue growth in its recent quarter. The company crossed a milestone with its 101st cloud region coming online, positioning itself to eventually have more regions than its competitors combined. Oracle's Gen 2 cloud architecture gives customers flexibility, which the company claims is a strategic advantage.However, Oracle's overall performance raises concerns. In its third-quarter fiscal 2025 earnings report, the company missed both earnings and revenue expectations, with EPS of $1.47 missing analyst estimates by $0.02 and revenue of $14.13 billion falling short by $259 million. While Oracle touts its cloud revenue growth, its total revenue growth of just 6.4% year over year pales in comparison to Microsoft's double-digit growth rates.The consensus mark for fiscal 2025 earnings is pegged at $6.04 per share, down a penny over the past 30 days.More troubling are the recent security challenges that could significantly impact Oracle's market position and investor confidence. Following two confirmed security breaches within a single month, questions have arisen about the company's ability to protect sensitive client data. After initially denying claims that its cloud storage had been compromised, Oracle later acknowledged to clients that an attacker had infiltrated what it described as a legacy environment. This comes on the heels of a separate breach where hackers accessed Oracle servers and copied patient data in an apparent attempt to extort multiple U.S. medical providers.Oracle's partnerships with hyperscalers like Microsoft through the Oracle Database@Azure service show promise, but the company faces execution challenges as it plays catch-up in the competitive cloud market. While Oracle claims its remaining performance obligations reached $130 billion, up 63% year over year, the company still struggles with capacity constraints, as demand continues to dramatically outstrip supply.\nImage Source: Zacks Investment Research\nFrom a valuation perspective, MSFT trades at a premium to Oracle, with a forward 12-month price/sales ratio of 9.43 compared to Oracle's 5.83. This premium valuation reflects investor confidence in Microsoft's stronger growth prospects and market position.\nImage Source: Zacks Investment Research\nWhile both companies have seen their shares decline in 2025, Microsoft has shown greater resilience, with shares declining 8.6% year to date, significantly outperforming the Zacks Computer & Technology sector and Oracle's steeper 13.9% and 19.6% drop, respectively, during the same period.\nImage Source: Zacks Investment Research\nThe sector as a whole has faced headwinds, including concerns about AI spending and the impact of tariff measures under the Trump administration. Microsoft has announced that it is \"slowing or pausing\" some of its AI data center projects, though the company remains committed to long-term AI investments. Oracle, meanwhile, faces more significant challenges with component delays that have slowed cloud capacity expansion, potentially limiting its ability to capture market share during this crucial growth phase.\nWhile both Microsoft and Oracle offer exposure to the booming cloud computing and AI markets, MSFT emerges as the more compelling investment opportunity. With its superior growth rates, broader cloud ecosystem, stronger financial performance, and innovative AI solutions, Microsoft is better positioned to capitalize on these technological trends. Oracle's recent security breaches, capacity constraints, and weaker financial performance raise concerns about its ability to compete effectively in the rapidly evolving cloud landscape. For investors seeking long-term growth potential in cloud computing, Microsoft, with its Zacks Rank #3 (Hold) compared to Oracle's Zacks Rank #4 (Sell), presents a more promising bet with stronger upside potential in this AI-driven era. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\nOracle Corporation (ORCL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nPresident Donald Trump’s tariffs, which are expected to slow economic growth, could cause companies to reduce their technology budgets in the face of uncertain demand and profits.  Already, chief information officers surveyed by Morgan Stanley software analyst Keith Weiss have indicated they expect to grow their budgets by just over 3% this year on average, down from an expectation of just over 4% before Trump’s tariff announcements.\nA federal judge’s decision, which stated agencies lacked authority to pause funding, follows the president’s executive order to freeze the money on his first day in office.\nNvidia's announcement brings Big Tech’s investment pledges to US AI infrastructure to just north of $1.6 trillion since Trump's inauguration.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Amazon.com Inc. (NASDAQ:AMZN) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nAlphabet is strengthening its competitive position in the search and cloud with the infusion of AI amid challenging macroeconomic conditions.\nThe integration of Popmenu's online ordering solutions with Oracle Simphony will improve efficiency.\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-12_Microsoft (MSFT) Faces Capex Shift but Analysts Stay Bullish on Long-Term AI Plans",
    "date": "",
    "content": "Title: Microsoft (MSFT) Faces Capex Shift but Analysts Stay Bullish on Long-Term AI Plans\nDate: 2025-04-16 19:12\nURL: https://finance.yahoo.com/news/microsoft-msft-faces-capex-shift-191243770.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 10 AI Stocks You Shouldn’t Overlook Right Now. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other AI stocks you shouldn’t overlook right now.\nAccording to Adam Thierer, a senior fellow at the center-right think tank R Street Institute, Trump’s tariffs could prove to be a massive gift for China, even helping it catch up in the AI race.\n“It’s going to be very hard for the U.S. to win the so-called AI Cold War if America’s trade policies are simultaneously tanking global markets, discouraging technological investments, and potentially undermining traditional alliances with key allies.”\nTrump’s policies are disrupting supply chains and causing volatility in global markets, which may lead US allies to turn to China to meet their technological needs.\n“Suddenly, in the wake of this trade fiasco, we see EU officials saying, ‘Let’s get on the phone with China and talk. Huawei has this telecommunications hardware system they want to sell, and there’s also these AI models that are free of charge.”\nREAD ALSO: 10 AI Stocks on the Move and  10 AI Stocks to Watch Amid Market Volatility.\nWith all the tensions caused by the US tariffs, China’s President Xi Jinping has recently called for stronger ties with Vietnam on trade and supply chains as he attended the signing of dozens of cooperation agreements between the two nations. While Beijing faces 145% U.S. duties, Vietnam has been negotiating a reduction of U.S. tariffs of 46% that would otherwise apply in July after a global moratorium expires, Reuters reported.\n“The two sides should strengthen cooperation in production and supply chains,” Xi\nThe President has also urged increased trade and stronger ties with Hanoi on artificial intelligence and the green economy.\nDiscussing the meetings, U.S. President Donald Trump said that the two countries’ discussions were focused on harming the United States. However, he said that he did not blame them for holding such talks.\n“I don’t blame China; I don’t blame Vietnam. That’s a lovely meeting. Meeting like, trying to figure out, ‘how do we screw the United States of America?'”\nFor this article, we selected AI stocks by going through news articles, stock analysis, and press releases. These stocks are also popular among hedge funds. The hedge fund data is as of Q4 2024.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points  (see more details here).\nA development team working together to create the next version of Windows.\nNumber of Hedge Fund Holders: 317\nMicrosoft Corporation (NASDAQ:MSFT) provides AI-powered cloud, productivity, and business solutions, focusing on efficiency, security, and AI advancements. On April 15, Bank of America reiterated the stock as “Buy” and lowered its price target on the stock to $480 per share from $510.\n“There have been rumors that Microsoft is pulling back on capex. While Microsoft is likely shifting capex within geographies, the company remains building capacity for the long term.”\nA day prior, UBS also lowered the firm’s price target on the stock to $480 from $510 and kept a “Buy” rating on the shares. The firm’s price target revision also came after Microsoft’s formal acknowledgement that it is slowing or pausing some data center projects. The firm’s evaluation reveals that the company’s adjustments are most likely not AI demand-related, and that the pausing activity isn’t a materially negative AI demand signal.\nOverall, MSFT ranks 2nd on our list of AI stocks you shouldn’t overlook right now. While we acknowledge the potential of MSFT as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than MSFT but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nTariff announcements and pauses have led to high volatility within the stock market and have investors trying to decide what to do with investments and personal savings. A personal finance expert recently offered up some advice and commentary on President Donald Trump's potential tariffs. Author Ramit Sethi is best known for the book \"I Will Teach You To Be Rich,\" hosting the \"Money For Couples\" podcast and hosting \"How To Get Rich\" on Netflix. Sethi offered some expert advice on how to survive\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-26_Magnificent Seven Stocks Sell Off_ Nvidia Plunges; Apple, Tesla Dive",
    "date": "",
    "content": "Title: Magnificent Seven Stocks Sell Off_ Nvidia Plunges; Apple, Tesla Dive\nDate: 2025-04-16 19:26\nURL: https://finance.yahoo.com/m/4205eaa9-f620-3a0b-a81a-0e82c7c9fd0b/magnificent-seven-stocks-sell.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nDubbed the Magnificent Seven stocks, Apple, Microsoft, Google parent Alphabet, Amazon.com, Nvidia, Meta Platforms and Tesla lived up to their name in 2024 with solid gains. Through the first three months of 2025, however, performance for these mega-cap stocks has been negative thus far.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staf\n(Bloomberg) -- US Treasuries rallied for a third day as Federal Reserve Chair Jerome Powell said the central bank will aim to prevent tariffs from leading to stickier inflation.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveThe five-year note led\nNissan will cut Japanese production of its top-selling U.S. model, the Rogue SUV, over May-July, said a person familiar with the matter, becoming the latest global automaker to alter manufacturing plans in response to new U.S. import tariffs.  U.S. President Donald Trump's decision to slap a 25% levy on cars built overseas has upended the global automotive supply chain.  Nissan, Japan's third-largest carmaker, is more exposed than some rivals.\nApple (AAPL) will effectively develop Apple Intelligence, while “new form factors” will boost the tech giant’s 2026 revenue, Angelo Zino, a senior equity analyst at CFRA Research predicted recently on the Schwab Network. Zino has a $235 price target and a Buy rating on the shares. Apple’s Positive Catalysts The development of Apple Intelligence, which […]\nThe stock market took a downward turn on Wednesday after Nvidia said it would take a $5.5 billion charge due to U.S. export restrictions on H20 processors to China and other countries. Get Heard on the ...\nThe automaker joins a growing list of companies tapping the EV segment leader’s fast-charging technology.\n(Bloomberg) -- Hertz Global Holdings Inc. shares had their biggest gain ever after CNBC reported that Pershing Square Capital Management had amassed a position of almost 20% in the beleaguered car rental company.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Age\nCatch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: TARIFF EXEMPTION: According to new guidance from U.S. Customs and Border Protection, President Trump has exempted smartphones, computers, and other electronic devices and components, including semiconductors, solar cells, flat panel TV displays, flash drives, and memory cards from the reciprocal\n↘️ Nvidia (NVDA): The chip maker warned it will take a $5.5 billion charge after the U.S. said it will need a license to export H20 processors to certain countries. Shares slid 7% early Wednesday. ↘️ Advanced Micro Devices (AMD): AMD stock fell nearly 7%.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Tesla, Inc. (NASDAQ:TSLA) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-27_Software Stocks Are Way Down, But Shouldn’t Be. Microsoft and 2 More to Buy.",
    "date": "",
    "content": "Title: Software Stocks Are Way Down, But Shouldn’t Be. Microsoft and 2 More to Buy.\nDate: 2025-04-16 19:27\nURL: https://finance.yahoo.com/m/74311f55-b5e8-3d85-97da-6a10a1128dfe/software-stocks-are-way-down%2C.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPresident Donald Trump’s tariffs, which are expected to slow economic growth, could cause companies to reduce their technology budgets in the face of uncertain demand and profits. Already, chief information officers surveyed by Morgan Stanley software analyst Keith Weiss have indicated they expect to grow their budgets by just over 3% this year on average, down from an expectation of just over 4% before Trump’s tariff announcements.\nMSFT outpaces ORCL with stronger cloud growth, AI innovation, and financial resilience, thus offering superior long-term investment potential.\nThe stock market has been in turmoil so far this year amid the tariff-related issues that threaten to send the U.S. economy into a potential recession, and a big drop in consumer sentiment this month has added to the overall negativity.  So, SoundHound is at the beginning of a terrific growth curve, considering that it expects to generate $167 million in revenue this year at the midpoint of its guidance range.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nMichael Saylor says Bitcoin is “strategy” as MicroStrategy’s 133% gain beats Tesla, Nvidia, and the Magnificent 7.\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nWe recently published a list of Goldman Sachs Value Stocks: Top 12 Stock Picks. In this article, we are going to take a look at where The Home Depot, Inc. (NYSE:HD) stands against other Goldman Sachs value stocks to invest in. As we recently discussed in another article, growth stocks are massively overvalued and trading […]\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-58_Sector Update_ Tech Stocks Tumble Late Afternoon",
    "date": "",
    "content": "Title: Sector Update_ Tech Stocks Tumble Late Afternoon\nDate: 2025-04-16 19:58\nURL: https://finance.yahoo.com/news/sector-tech-stocks-tumble-afternoon-195807502.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nTech stocks tumbled late Wednesday afternoon with the Technology Select Sector SPDR Fund (XLK) dropp\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-24_Nvidia's $5.5B charge_ 'Nobody' should be 'surprised'",
    "date": "",
    "content": "Title: Nvidia's $5.5B charge_ 'Nobody' should be 'surprised'\nDate: 2025-04-16 20:24\nURL: https://finance.yahoo.com/video/nvidias-5-5b-charge-nobody-202431372.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNvidia (NVDA) and Advanced Micro Devices (AMD) plunge after comments from Federal Reserve Chair Jerome Powell deepened losses sparked by costs associated with new US restrictions on exports to China.\nFuturum CEO Daniel Newman sits down with Josh Lipton, joined by Defiance ETFs CEO and chief investment officer Sylvia Jablonski, to discuss the latest chip news and what it means for investors.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\nNvidia sinking. So after the chip maker disclosed that it would take a $5.5 billion dollar hit from the US government's surprise new controls on its semiconductor exports to China. For more on the latest, let's welcome now Daniel Newman, Futurum CEO. Daniel, it is great to see you here on set. Appreciate it from Texas. Um, you know, before J. Powell, frankly, this was the story of the day. It was chips, it was Nvidia. Nvidia is down here, Dan. It's not about 10%. It's getting clobbered in today's trade. I guess two, two questions to start. One, Dan, were you surprised by that news when you saw those headlines? And two, do you think down 10%, is that move justified in your opinion?\nYeah, first of all, nobody should have been surprised by this move. Really the administration's been giving the signal that it was going to clamp down. Now, what was interesting is this week, there was a bit of gyration because they cut this deal, they announced 500 billion dollars of AI supercomputers being built here in the United States. And then a day later, he pulls back on this new export licensing requirement.\nThat that, you bring that, Dan. That is an interesting point because there were some folks who thought Jensen Wong was going to be kind of shielded from this. Right?\nThey made a deal. I had a few reporters actually hit me up, do you think there was some tip for tat going on. And first of all, I think Trump needs to show, President Trump needs to show that there is no tip for tat. So whether it's, you know, Tim Cook bringing more manufacturing here, whether it's TSMC coming here. But I actually think on the other side of this, and maybe we come back to this, is that I actually think creating some certainty with the, with the community, the business community, about what type of benefit they can expect by onshoring and bringing manufacturing back here. I think that would be a great start. Having said that, national security, economic security, and AI are tightly correlated. Us giving the chips to China, whether it's the tuned down chips or the best chips coming through intermediaries, which they shouldn't be getting. This is something that's giving an advantaging China. There's a lot of people out there that are like, oh, well, this is going to only push their resolve. Do you think China is waiting because we're sending Nvidia chips, they're not investing in Huawei and building their own chips? You can be absolutely certain that they are. This war, this trade war, is largely being fought on the grounds of long-term economic domination. Long-term economic domination will only be had if we control the technology trade. Nvidia is at the forefront of that trade.\nAnd what do you think of from an investor standpoint? Here you have Nvidia falling yet again, 8 to 10%. You know, look what happened over the last couple days. It had recovered from its lows, right? And a lot of investors who got in short term experienced that bounce. Where, where do you think that looks like this week?\nYeah. I, I look at that line of people around the corner at $150 that just couldn't wait to buy. And you go, what is really changed? Well, first of all, you've got GPUs melting over at, at X and at OpenAI. There's so much demand there. Could Nvidia pivot some of its capacity, not focus so much on building specialized products for China, and make sure we meet all the capacity and demand that's out there for companies that are in the US that are trying to build? You've got $325 billion of CAPEX. And it's been reiterated. So whether it's been Sunder Pichai, whether it's been Satya Nadella, they're all planning to spend. And I genuinely believe, Sylvia, that the companies with, you know, the big operating leverage are going to look at this pullback as the moment to build AI infrastructure out. Because when we come out of this, and we will come out of this, there will be deals made. Calling that on the record right now. It may be a tough couple of months. When deals are made, we will see the economy accelerate. And those companies want to build the future and have that AI infrastructure in place. So the Googles and the Microsofts and the Amazons, they're going to buy Nvidia. Um, and one other thing, if I, if I may, I find it very interesting that everybody thinks that China and their push to build Huawei is going to be so successful. When AMD came out with a competitive product, no one believed they could build the software. Broadcom's making chips for the hyperscalers and everyone said, well, that's great, but they don't have CUDA. So it's not going to work as well. But suddenly, everybody believes that China and Huawei is going to build the CUDA competitive product that's going to undo Nvidia? I believe in China, I believe in their resolve. I don't believe that they have as much competition or much competitive capability today as people are suggesting.\nU.S. markets fell sharply Wednesday, with chip stocks leading the retreat as U.S.-China trade tensions spooked investors. The tech-heavy Nasdaq closed down 3.1%, the S&P 500 lost 2.2%, and the Dow Jones Industrial average fell 700 points, or 1.7%. Losses rippled across sectors, dragging the Russell 2000 down 1.4%.\nDavid Kostin, chief US equity strategist at Goldman Sachs, discusses expectations for US economic growth, the lack of liquidity in markets, and the outlook for earnings growth. He speaks on \"Bloomberg Open Interest.\"\nWorld stocks fell into a downward spiral on Wednesday led by tech losses after Washington said it is putting new curbs on AI chip exports to China, marking an escalation in the global trade war.  The Trump administration's latest broadside sparked huge demand for safe-haven assets like gold, the Swiss franc and U.S. Treasuries, even though Fed Chair Jerome Powell signalled he is in no rush to cut interest rates.  If U.S. Big Tech had acquired a safe-haven status in the eyes of some investors in recent years, it is disappearing fast.\nThe March retail sales report comes as investors are closely watching for any signs of slowing in US economic growth before the implementation of President Trump's tariffs.\nNextEra (NEE) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.\nTrump wants to bring tech manufacturing to the US. There's little chance it will happen.\nWhales dumped more than $370 million in XRP this month, causing price drops and raising concerns among traders as selling pressure weighs on market sentiment.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOGL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nTaiwan Semiconductor Manufacturing (NYSE: TSM) stock got hit with significant sell-offs in Wednesday's trading.  Meanwhile, the S&P 500 (SNPINDEX: ^GSPC) and Nasdaq Composite (NASDAQINDEX: ^IXIC) fell 2.2% and 3.1% in the session, respectively.  TSMC's valuation moved lower today in conjunction with news of new export restrictions on Nvidia's processors, higher tariffs on China, and cautious commentary from Federal Reserve Chairman Jerome Powell.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveInterior Secretary Doug Burgum ordered the pause on\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 20-26_Why Microsoft Stock Tumbled 3.7% Today",
    "date": "",
    "content": "Title: Why Microsoft Stock Tumbled 3.7% Today\nDate: 2025-04-16 20:26\nURL: https://www.fool.com/investing/2025/04/16/why-microsoft-stock-tumbled-37-today/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=06ed7c72-35a7-4445-a691-04e80eb52ab9&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nMicrosoft (MSFT -3.67%) had one of its more forgettable sessions on the stock market Wednesday, with its share price melting by 3.7% at closing time. Yet this had less to do with its own operations, and more to do with a move by a business in which it's invested. That decline was steeper than even the gloomy S&P 500 index's 2.2% fall on the day.\nIn an article published this morning and citing an unnamed \"person familiar with the matter,\" Bloomberg wrote that leading artificial intelligence (AI) company OpenAI is in active talks to acquire another privately held AI business called Windsurf. The deal's price tag is rumored to be around $3 billion. \nWhile OpenAI is a separate entity from Microsoft, the tech giant has invested considerably in the company. It also uses its technology in a number of its products. \nIf a deal is reached at anywhere near the mentioned price, it would be OpenAI's priciest acquisition in its relatively short history. Windsurf is a developer of AI-assisted coding tools, which streamline the coding process by allowing users to use natural-language prompts to create programs.\nNeither OpenAI nor Windsurf had commented on the Bloomberg report. Microsoft had also kept mum on the matter.\nOf course any acquisition OpenAI makes doesn't directly affect Microsoft. The company has said, however, that it is entitled to share of profit distributions from OpenAI. Investors might feel that OpenAI -- and by extension, Microsoft -- is better off spending billions of dollars to continue developing still-fresh AI technology rather than a bolt-on acquisition.\n\n \n\nBefore you buy stock in Microsoft, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Microsoft wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nEric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 20-59_Microsoft Target Slashed to $472 as Demand Slips, but AI Bet Keeps Bulls Hopeful",
    "date": "",
    "content": "Title: Microsoft Target Slashed to $472 as Demand Slips, but AI Bet Keeps Bulls Hopeful\nDate: 2025-04-16 20:59\nURL: https://finance.yahoo.com/news/microsoft-target-slashed-472-demand-205901567.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMorgan Stanley reduced its price target on Microsoft (MSFT, Financials) to $472 from $530, citing weakening demand trends and cautious investor sentiment. The firm maintained its Overweight rating on the stock, with the revised target implying a potential upside of more than 22% from the prior closing price.\nWarning! GuruFocus has detected 1 Warning Sign with MSFT.\nIn a note to clients, analysts at Morgan Stanley said Microsoft shares have lagged behind peers in the large-cap software sector amid a wall of worry over macroeconomic and operational challenges. Slowing momentum in core segments such as Azure and Microsoft 365 was flagged as a key factor behind the downgrade.\nThe analysts projected Azure revenue growth of 31% in constant currency for the March quarter, down from earlier expectations of a stronger rebound in the second half. They now expect further deceleration of 100 basis points in the June quarter. Growth forecasts for Microsoft 365 Commercial Cloud were also revised downward to 13.5% for the third quarter from a prior estimate of 14%, with the team attributing the slowdown to muted adoption of Copilot and lengthening sales cycles.\nFeedback from Microsoft's channel partners pointed to continued execution issues and a more cautious approach by customers toward large-scale technology investments, Morgan Stanley said. The firm also anticipates further downside risk to consensus earnings estimates, projecting a 1.4% reduction in forecasts for fiscal year 2025 and a 5.1% decline for fiscal year 2026.\nDespite these near-term challenges, Morgan Stanley emphasized that the company's long-term positioning in generative artificial intelligence remains solid. The analysts believe Microsoft shares are approaching a valuation floor and see the long-term risk-reward as favorable, estimating a 3-to-1 upside-to-downside ratio at current levels.\nAdditionally, the note highlighted that every 1% decrease in capital expenditures could result in a 1.5% increase in free cash flow, potentially offsetting some of the pressure from softer demand trends.\nThis article first appeared on GuruFocus.\nWithin the largest companies in the sector, the players least affected by China risk are Alphabet and Meta Platforms.\nWhile analysts remain bullish overall on Amazon (AMZ) stock, several Wall Street firms have cut their price targets for the tech giant's shares ahead of its first quarter earnings report. Concerns about the impact of President Donald Trump's tariff plan have weighed on Amazon shares in recent weeks. Amazon stock had sold off on a Q4 earnings report that included...\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nJanus Henderson's Denny Fish says the US is penalizing Nvidia and giving the market to Huawei as President Trump's administration curbs chips export to China. He joins Ed Ludlow on \"Bloomberg Technology\" to discuss.\nThe chairman of the Federal Reserve has warned that Donald Trump’s trade war will fuel inflation and keep interest rates higher for longer, triggering a steep sell-off on Wall Street.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-06_Is Microsoft (MSFT) the Best NASDAQ Stock to Buy So Far in 2025_",
    "date": "",
    "content": "Title: Is Microsoft (MSFT) the Best NASDAQ Stock to Buy So Far in 2025_\nDate: 2025-04-16 21:06\nURL: https://finance.yahoo.com/news/microsoft-msft-best-nasdaq-stock-210643117.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other NASDAQ stocks to buy in 2025.\nOn April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact of current tariffs and compared the situation to an economic armageddon. If the current tariffs remain in place, Ives thinks it would lead to a 15% to 20% demand reduction across the board. He thinks that investor anxiety is much higher considering how things were in the March 2020 COVID-19 crash earlier. The analyst thinks that investors should now focus on the likelihood of tariff adjustments from comments about negotiations, the impact on consumer-focused companies, and the potential for demand destruction. He even thinks that companies may refuse to provide guidance in the first-quarter earnings calls due to the persistent tariff uncertainty.\nIves thinks that a lot of tech companies will not be able to absorb high tariff increases and rather this cost will be passed on to the consumers which will lead to significant margin erosion and even potential sales declines. He indicated that tech stocks are currently pricing in a 10% to 15% cut to numbers. He suggests that investors should now look at companies with strong long-term potential as he believes earnings may normalize in 2025 and 2026. The analyst also addressed the defensive performance of defense contractors. While acknowledging the relative stability here, Ives cautioned that even these even such sectors are not immune to tariffs. He noted the significant foreign component, specifically 40% to 50% in some instances, in hardware and other sectors.\nWe sifted through the financial media reports to compile a list of the top NASDAQ stocks to buy for 2025. We then selected the 13 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 900 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA development team working together to create the next version of Windows.\nNumber of Hedge Fund Holders: 317\nMicrosoft Corporation (NASDAQ:MSFT) develops and supports software, services, devices, and solutions. One of its main businesses is its Productivity and Business Processes segment. It offers Office, Exchange, SharePoint, Microsoft Teams, office 365 Security & Compliance, Microsoft Viva, and Microsoft 365 Copilot. Its products are sold through OEMs, distributors, and resellers.\nOn March 31, Jefferies analyst Brent Thill reaffirmed a Buy rating on the company but lowered the price target from $550 to $500. While this sentiment came from software sector adjustments in general, the firm is confident in the company’s ability to capitalize on the expanding AI sector. Brent Thill believes that the company’s integration of AI into Azure and Microsoft 365 Commercial Cloud will significantly help its growth.\nMicrosoft Corp.’s (NASDAQ:MSFT) AI platform helps it accelerate the development of advanced AI models and is called the Azure AI Foundry. It gained over 200,000 monthly active users within just 2 months of its launch. Similarly, the company also offers Copilot Studi0 which creates personalized AI agents. It helped 160,000 organizations create 400,000 agents in 3 months.\nColumbia Seligman Global Technology Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its Q4 2024 investor letter, believing that Oracle is positioned to capitalize on the AI-driven cloud demand:\n“Within software, the fund maintained an underweight position to Microsoft Corporation (NASDAQ:MSFT), which proved beneficial as share price for the company fell during the fourth quarter. Microsoft’s outlook for its Azure business came down slightly, which hampered the stock price at times during the quarter and, combined with losses on the Open AI business, led to a disappointing end to 2024. The company has guided its capital expenditure spending up slightly and investors continue to wait for additional monetization from the company’s large commitment to AI infrastructure spending. The fund continued to hold an overweight allocation to Oracle as we believe Oracle is positioned to be a major beneficiary of the AI rollout and has the potential to compete with other large cloud providers, such as Amazon, Alphabet and Microsoft. Oracle shares moved lower during the quarter and the stock suffered its worst day of the year in December, as the company narrowly underperformed analysts’ average estimates. Oracle’s business model remains strong as demand for computer power that can handle AI is increasing and the company’s revenues from its cloud infrastructure unit moved higher year over year.”\nOverall, MSFT ranks 2nd on our list of the best NASDAQ stocks to buy so far in 2025. While we acknowledge the growth potential of MSFT, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than MSFT but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of the 11 Most Undervalued Quality Stocks to Buy Now. In this article, we are going to take a look at where Qualcomm Inc. (NASDAQ:QCOM) stands against other undervalued quality stocks to buy now. On February 24, Kayne Anderson Rudnick chief market strategist Julie Biel joined ‘The Exchange’ on CNBC […]\nEvery month, the Treasury Department publishes delayed data on U.S. assets sold and bought by foreign central banks and investors.\nWe recently published a list of 15 Best Blue Chip Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other best blue chip stocks to buy according to billionaires. Is A Potential Trade War on the Horizon? The US stock market […]\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nHere are our top picks for the best online brokers for bonds.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 21-27_Microsoft Rethinks AI Growth as Recently Greenlit Ohio Project Gets Shelved",
    "date": "",
    "content": "Title: Microsoft Rethinks AI Growth as Recently Greenlit Ohio Project Gets Shelved\nDate: 2025-04-16 21:27\nURL: https://finance.yahoo.com/news/microsoft-rethinks-ai-growth-recently-212712209.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nApril 16 - Microsoft (NASDAQ:MSFT) has put the brakes on several planned data center developments, including a newly greenlit site in Heath, Ohio, just weeks after gaining local support.\nThe company reportedly halted progress on at least three Ohio locations, including a $1 billion facility near Columbus, and has delayed or scrapped projects in other regions such as Illinois, North Dakota, Wisconsin, Indonesia, the UK, and Australia.\nWarning! GuruFocus has detected 1 Warning Sign with MSFT.\nThe abrupt shift follows reports that Microsoft recently walked away from hundreds of megawatts of leased power capacity for U.S. data centers, suggesting a broader reassessment of infrastructure needs.\nWhile the company hasn't provided a detailed explanation, analysts point to tepid demand for generative AI services and a possible oversupply of capacity. In February, CEO Satya Nadella acknowledged AI had yet to deliver major returns, hinting at a mismatch between investment and usage.\nBloomberg also noted that Microsoft's evolving relationship with OpenAI may be influencing the decision. Earlier this year, Microsoft gave OpenAI the option to procure computing resources from rival cloud providers, shortly before OpenAI was linked to a separate $500 billion cloud project.\nMicrosoft has described the changes as part of long-term strategic planning.\nThis article first appeared on GuruFocus.\nA federal judge’s decision, which stated agencies lacked authority to pause funding, follows the president’s executive order to freeze the money on his first day in office.\nMSFT outpaces ORCL with stronger cloud growth, AI innovation, and financial resilience, thus offering superior long-term investment potential.\nOne of the rare Wall Street analysts who is bearish on Meta Platforms further cut his price target for the stock, saying the Facebook parent company is \"starting to look vulnerable to a growth slowdown.\"  BNP Paribas Exane analyst Stefan Slowinksi cut his price target for Meta stock to 448 from a previous 505 in a client note late Tuesday.  Slowinski initiated coverage of Meta with the sell-equivalent call nearly 12 months ago.\nWe recently published a list of 13 Best NASDAQ Stocks to Buy So Far in 2025. In this article, we are going to take a look at where Microsoft Corporation (NASDAQ:MSFT) stands against other NASDAQ stocks to buy in 2025. On April 4, Wedbush analyst Dan Ives appeared on CNBC to discuss the potential impact […]\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 22-14_Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial",
    "date": "",
    "content": "Title: Meta Saw TikTok as ‘Highly Urgent’ Threat, Zuckerberg Says at Antitrust Trial\nDate: 2025-04-16 22:14\nURL: https://finance.yahoo.com/news/meta-saw-tiktok-highly-urgent-221403450.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Mark Zuckerberg, the first witness in the Federal Trade Commission’s trial to break up his social media empire, gave a rare window into how he makes business decisions: by fighting for survival, even when his company is ahead.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nDOGE Places Entire Staff of Federal Homelessness Agency on Leave\nOver a marathon three days of testimony, the Meta Platforms Inc. co-founder and chief executive officer clearly articulated how the social media market has evolved rapidly over time — which, if the judge agrees, could make it more difficult for the FTC to prove Meta dominates it.\nZuckerberg was composed, but occasionally evasive, when challenged to explain past emails and other private messages indicating a concerted effort to muscle out competitors.\nThose old messages and emails, gathered during the pre-trial discovery process, were more damning than his present-day testimony. The messages, often between Zuckerberg and other top Meta executives, painted a picture of an executive who was paranoid about his rivals and willing to buy competitors whenever possible.\nThe FTC is seeking to force Meta to sell off Instagram and WhatsApp, arguing that the two acquisitions have given Meta an illegal monopoly over parts of the social networking industry. Emails and documents presented at trial show that Meta, then called Facebook Inc., struggled to compete in the mobile app boom in the early 2010s, buying up successful competitors. The FTC said Meta bought the companies to eliminate direct competitive threats.\nMultiple Competitors\nZuckerberg and Meta’s lawyers, meanwhile, argued that Meta faces a wide array of competitors that fight for user attention, including ByteDance Ltd.’s TikTok, Google’s YouTube, Apple Inc.’s iMessage and Microsoft Corp.’s LinkedIn. On Wednesday, Zuckerberg said that TikTok, in particular, posed a “highly urgent” competitive threat when it sprang up in 2018.\n“We observed that our growth slowed down dramatically,” as TikTok gained popularity, Zuckerberg said Wednesday. “It was highly urgent, this has been a top priority for the company for several years.” Meta eventually rolled out a direct competitor, called Reels, that now drives a significant amount of video traffic for the company.\nZuckerberg was at times vague over his three days in court, and regularly disputed the FTC’s interpretations of his prior emails. As a leader, the way he communicated with staff was often blunt or harsh, and he spent time on the stand trying to add more nuance to what was written by his younger self. He occasionally clashed with the FTC’s lead lawyer, Daniel Matheson, who objected at one point that Zuckerberg wasn’t answering his questions.\nWhat’s unclear is how much weight those emails will ultimately have as US District Judge James Boasberg, who is presiding over the case, makes his decision. Meta has argued that the intent behind the purchases doesn’t matter, only whether those deals lead to consumer harm, which it disputes.\nBoasberg previously said the FTC will have a difficult time. Despite allowing the bulk of the case to proceed last November, Boasberg struck a skeptical tone about the FTC’s chances at trial. “Prevailing here, however, does not obscure the fact that the Commission faces hard questions about whether its claims can hold up in the crucible of trial,” the judge said. “Indeed, its positions at times strain this country’s creaking antitrust precedents to their limits.”\nBoasberg also said in a ruling shortly before the trial that the FTC must prove Meta is harming competition in the present day.\nSheryl Sandberg, the company’s former chief operating officer, followed Zuckerberg on the witness stand, facing sharp questioning from FTC lawyer Susan Musser.\nIf the FTC prevails, a spinoff of Instagram and WhatsApp would undo years of integration between the apps, disrupt two of the most popular digital consumer products in the world and potentially erase hundreds of billions of dollars in Meta’s market value. It would also raise serious questions about how the government evaluates and approves deals because the government allowed the transactions to go through at the time.\n‘Network Effects’\nPart of the FTC’s case involves the technical concept of “network effects,” meaning that the more users a company like Meta has, the more likely they are to retain a dominant position, because people are unlikely to switch to a service used by few people.\nBoasberg has remained largely silent during the questioning, but interjected during Zuckerberg’s testimony Wednesday to ask if network effects still really matter.\n“How much does it matter if your friends are on a particular platform if you can send content out of that platform? Why does it matter if your friends are there?” the judge said.\nZuckerberg said it doesn’t. “These apps now serve primarily as discovery engines,” he said. “People can take that content to messaging engines.”\nBigger Company\nUnder questioning by Meta lawyer, Mark Hansen, Zuckerberg refuted the FTC’s argument that Meta bought Instagram to bury a competitor. Instagram would not likely have been able to grow to the extent it has had it remained independent, he said. “Instagram has been built out into a much more vibrant service” as a result of the deal, Zuckerberg said.\nTaking a small online platform to a billion users and beyond is unlikely to happen without the backing of a larger company, he said. “Every company that has this level of scale is owned by a bigger company,” he said, citing TikTok and YouTube as examples.\nEarlier in the trial, it was revealed that Snap Inc.’s Evan Spiegel turned down a $6 billion acquisition offer from Facebook in 2013 for its Snapchat app. Zuckerberg said that the app would have grown more rapidly had it joined his company.\nZuckerberg sought to walk back some statements that he made in previous internal communications. He acknowledged that he sent a 2013 email saying that Facebook blocked advertising for messaging apps WeChat, Kakao and Line, in which he wrote the apps were “trying to build social networks to replace us.” On the stand this week, however, he said “it’s hard for me to characterize what their intent was.”\nMatheson also sought to show that Meta was aware of its antitrust risk years ago, including a possible breakup.\nHe displayed an email from 2018 in which Zuckerberg suggested that Meta should consider spinning off Instagram into a standalone company. “As calls to break up the big tech companies grow, there is a non-trivial chance that we will be forced to spin out Instagram and perhaps WhatsApp in the next 5-10 years anyway,” he wrote.\nAt one point, Zuckerberg was asked by Hansen to describe how he was evaluating the competitive threat posed by Instagram and others at the time of the deals. He referenced a quote from former Intel Corp. CEO Andy Grove: “Only the paranoid survive.”\n(Updates with color on Zuckerberg testimony starting in the first paragraph)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nTrump's trade war is causing all sorts of extreme dislocations in market and economic sentiment.\n(Bloomberg) -- Shale fracker Liberty Energy Inc. posted its worst earnings in three years amid plunging oil prices and mounting concerns about energy demand.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveAdjusted first-quarter profit fell to 4 cen\nEven in the midst of a sharp drop in his company’s stock price and a freight market that is not supporting the bottom line at Triumph Financial, CEO Aaron Graft touted milestones reached and signaled a new aggressiveness in pricing the company’s products. In his quarterly letter to investors released in conjunction with the company’s […] The post Despite quarterly loss and battered stock, Triumph Financial stays aggressive appeared first on FreightWaves.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nNEW YORK (Reuters) -Investors who may have been hoping the Federal Reserve is poised to come to the aid of tariff-rattled markets took away an unwelcome message from the central bank's chief on Wednesday: the Fed may be in a bind.  Fed Chair Jerome Powell said the central bank would wait for more data on the economy's direction before changing interest rates.  Speaking to the Economic Club of Chicago, he noted that there was a potentially tough situation developing for the Fed in which inflation is pushed higher by tariffs while growth and potentially, employment, weaken.\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\n(Bloomberg) -- The Trump administration halted work on an offshore wind farm being built off New York amid a broader review of the sector’s projects.Most Read from BloombergTrump Signs Executive Orders on Federal Purchasing, Office SpaceHow Did This Suburb Figure Out Mass Transit?Why the Best Bike Lanes Always Get BlamedLA County Floats Leaner Budget Burdened by Fire and Legal CostsDOGE Places Entire Staff of Federal Homelessness Agency on LeaveInterior Secretary Doug Burgum ordered the pause on\nChina-founded e-commerce sites Temu and Shein say they plan to raise prices for U.S. customers starting next week, a ripple effect from President Donald Trump's attempts to correct the trade imbalance between the world's two largest economies by imposing a sky-high tariff on goods shipped from China.  Temu, which is owned by the Chinese e-commerce company PDD Holdings, and Shein, which is now based in Singapore, said in separate but nearly identical notices that their operating expenses have gone up “due to recent changes in global trade rules and tariffs.”  Both companies said they would be making “price adjustments” starting April 25, although neither provided details about the size of the increases.\nA federal judge’s decision, which stated agencies lacked authority to pause funding, follows the president’s executive order to freeze the money on his first day in office.\nAll is not lost when it comes to investing in Nvidia. Here's what Lawrence McDonald of the Bear Traps Report has to say.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]