[
  {
    "title": "2025-04-15 15-20_Johnson & Johnson expects $400 million in tariff-related costs, mostly related to China",
    "date": "",
    "content": "Title: Johnson & Johnson expects $400 million in tariff-related costs, mostly related to China\nDate: 2025-04-15 15:20\nURL: https://finance.yahoo.com/news/johnson-johnson-expects-400-million-152058261.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHealth care giant Johnson & Johnson (JNJ) expects about $400 million in tariff-related costs this year.\nThe costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products. The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nThe company's estimate also includes the impact from tariffs on aluminum and steel, along with tariffs against key U.S. trading partners Canada and Mexico. Johnson & Johnson said that contractual agreements already in place limit its leverage on price increases that could potentially soften the impact.\nThe cost estimate does not include possible tariffs on imports of pharmaceuticals. The Trump administration has launched an investigation into imports of pharmaceuticals, which is a step towards imposing tariffs.\nTariffs, especially on pharmaceutical products, could lead to supply chain issues and shortages, said CEO Joaquin Duato. He said the best way to build up manufacturing in the U.S. is through tax policy, not tariffs.\nThe company is investing more than $55 billion over the next four years with the goal of making all of its advanced medicines that are used in the U.S., within the U.S.\nBofA analyst Tim Anderson notes Pfizer (PFE) announced danuglipron, an oral GLP-1 obesity, is being discontinued, following a case of liver injury seen in the phase 1 study. The firm points out that it has argued that this program has received almost too much attention – not because obesity isn’t important, but because this was only phase 1 data. Without danuglipron, Pfizer’s obesity pipeline now consists of a GIP receptor antagonist in phase 2 and a phase 1 oral GLP-1 in T2D with Nxera Pharma.\nFutures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow trading just below break-even, as investors braced for a flurry of corporate earnings. The muted open followed Monday’s tech-led rally, which briefly masked deeper market jitters tied to tariffs and macro uncertainty.\nJohnson & Johnson is holding its earnings outlook steady despite President Donald Trump signaling he could put tariffs on the pharmaceutical industry. The administration announced earlier it would conduct an investigation into drug imports. That move is widely seen as a first step toward imposing new levies. Earnings and revenue both beat estimates for the quarter. Johnson & Johnson CFO Joe Wolk joined Bloomberg Open Interest to talk about how tariffs could hit the industry and the drug maker's bottom line.\nInsurance bellwether Travelers' first-quarter profit exceeded analysts' expectations on Wednesday, as strong underwriting gains helped soften the hit from over $2 billion of catastrophe losses driven by the Los Angeles wildfires.  The results shed a light on the fallout from one of the costliest natural disasters in California's history, which claimed several lives and destroyed property, with some estimates pegging the economic losses at $250 billion.  Travelers' catastrophe losses, net of reinsurance, touched a record $2.27 billion for the quarter ended March 31, compared with $712 million a year earlier.\nJohnson & Johnson (NYSE:JNJ), on Tuesday, reported a first-quarter 2025 adjusted EPS of $2.77, up 2.2% year over year, beating the consensus of $2.60. The pharmaceutical giant reported sales of $21.89 billion, up 2.4% year over year and beating the consensus of $21.58 billion. Operational growth was 4.2%, and adjusted operational growth was 3.3%. Innovative Medicine sales increased 2.3% or 4.2 operationally to $13.90 billion. Also Read: Johnson & Johnson, Protagonist Tout Positive Results For Ps\nWhile J&J expects tariffs will cost it $400 million this year, the company maintained its earnings estimate and upped its sales guidance for 2025.\nFrom smartphones to fast food, major U.S. brands are rapidly losing market share in China to domestic rivals. Consumers are increasingly embracing local brands, including Luckin Coffee, tech company Huawei, sportswear seller Anta and fast-food restaurant chain Mixue.\nZURICH (Reuters) -Optimism in parts of the U.S. construction industry has fallen in the wake of President Donald Trump's unpredictable trade policies, construction chemicals maker Sika's Chief Executive Thomas Hasler said on Tuesday.  \"We had a very strong start to the year and people were very optimistic about infrastructure investments and reshoring,\" Hasler told Reuters after the Swiss company reported first-quarter sales on Tuesday.  But the mood changed following Trump's announcement of tariffs on Mexico and Canada, which created uncertainty among U.S. companies, he said.\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nDeckers (DECK) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 15-50_Top Midday Stories_ Elliott Takes Stake of Over $1.5 Billion in HP Enterprise; Johnson & Johnson Lif",
    "date": "",
    "content": "Title: Top Midday Stories_ Elliott Takes Stake of Over $1.5 Billion in HP Enterprise; Johnson & Johnson Lif\nDate: 2025-04-15 15:50\nURL: https://finance.yahoo.com/news/top-midday-stories-elliott-takes-155050555.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAll three major US stock indexes were up in late-morning trading on Tuesday as the earnings season m\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nJ&J faces several headwinds at the start of the year, including patent expiry, talc litigation, and, now, tariffs.\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nJohnson & Johnson reports strong first-quarter 2025 results, raises revenue guidance and boosts its quarterly dividends.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 15-51_J&J sees tariff impact from exports to China more than global imports_ CFO",
    "date": "",
    "content": "Title: J&J sees tariff impact from exports to China more than global imports_ CFO\nDate: 2025-04-15 15:51\nURL: https://finance.yahoo.com/news/jj-sees-tariff-impact-from-exports-to-china-more-than-global-imports-cfo-155153851.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJohnson & Johnson (JNJ) reported a beat on first quarter earnings Tuesday, even as concerns linger about how President Trump's tariffs will impact its medical device business, as well as how a probe into pharmaceutical tariffs will impact its business.\nJ&J reported first quarter revenue of $21.9 billion, beating Wall Street estimates by 1.4%. Adjusted earnings per share came in at $2.69, beating Wall Street by 6.7%. Despite the beat, J&J's stock traded down less than 1% Tuesday.\nThe company raised its 2025 sales guidance Tuesday by $700 million, putting the new target at 3.3% to 4.3% growth, or a midpoint of $92 billion. That is despite a decline in sales after the patent expiry of Stelara, the company's blockbuster inflammatory condition treatment, this year.\nOn an earnings call Tuesday, executives said that China, Canada, and Mexico are where the company has the most exposure on tariffs.\nCFO Joe Wolk estimated about $400 million in tariff impact, saying it would primarily hit the medical devices business.\n\"It would include, to some small degree, some of the steel and aluminum tariffs that impact some of our products. It includes the China tariffs, as well as the China retaliatory tariffs — and that is probably the most substantial out of all the tariffs,\" Wolk said.\nHe told Yahoo Finance that up to 70% of the tariff impact is from the products exported to China from the U.S.\nThe hit from tariffs is being taken on as cost of goods and will \"sit on the balance sheet ... in future periods,\" Wolk said.\nAsad Haider, Goldman Sachs Global Investment Research head of the healthcare business unit, told Yahoo Finance that the company reduced its research costs and also has a lot more leverage, due to its size, to whether the current tariff confusion.\n\"We don't really know line items...it speaks a little bit to the leverage they have across the P&L to make these types of investments,\" Haider said.\nThe industry is also bracing for the impact of the investigation into pharmaceutical tariffs, which the Trump administration announced Monday.\nHowever, CEO Joaquin Duato said, \"It is also important that companies in healthcare partner with the administration to look to mitigate some of the vulnerabilities that exist today in our healthcare supply chain so as to avoid any continuity of supply effect.\"\nJ&J has also faced some of the same industry pressures as its peers in recent years, including the Inflation Reduction Act's Medicare price negotiations. But it is also pressured by the ongoing talc litigation and recently faced a major setback in the courts, with a judge rejecting a potential $10 billion settlement.\nJ&J has since returned about $7 billion from the intended settlement amount back to the company's coffers and is pursuing a different legal avenue that should play out in the second half of the year, according to analysts.\n\"Although JNJ’s effort to resolve talc litigation through Red River Talc bankruptcy failed, the company will return to the tort system to challenge plaintiffs’ experts via Daubert motions. JNJ expects important Daubert hearings and rulings within 6 months (by the end of Oct 2025),\" wrote Leerink Partners analyst David Risinger in a note to clients Tuesday.\nAnjalee Khemlani is the senior health reporter at Yahoo Finance, covering all things pharma, insurance, care services, digital health, PBMs, and health policy and politics. That includes GLP-1s, of course. Follow Anjalee on social media platforms X, LinkedIn, and Bluesky @AnjKhem.\nClick here for in-depth analysis of the latest health industry news and events impacting stock prices\nThe project focuses on intelligent decision-support in capacity planning and patient flow optimisation.\nWe came across a bullish thesis on Heartland Express, Inc. (HTLD) on Substack by Unemployed Value Degen. In this article, we will summarize the bulls’ thesis on HTLD. Heartland Express, Inc. (HTLD)’s share was trading at $8.44 as of April 14th. HTLD’s forward P/E was 833.33 according to Yahoo Finance. Heartland Express (HTLD) presented at the JP […]\nPresident Donald Trump’s latest trade move is hitting the gas pedal on car sales. With a 25% tariff on imported vehicles and parts set to take effect, buyers are racing to dealerships to lock in prices before they climb. Some industry experts say it could add thousands of dollars to the cost of a new car, prompting a last-minute shopping spree. Don't Miss: ‘Scrolling To UBI' — Deloitte's #1 fastest-growing software company allows users to earn money on their phones. You can invest today for just\nCatch up on the top industries and stocks that were impacted, or were predicted to be impacted, by the comments, actions and policies of President Donald Trump with this daily recap compiled by The Fly: TARIFF EXEMPTION: According to new guidance from U.S. Customs and Border Protection, President Trump has exempted smartphones, computers, and other electronic devices and components, including semiconductors, solar cells, flat panel TV displays, flash drives, and memory cards from the reciprocal\nJosé Muñoz, the CEO of Hyundai Motor Company, says he'll keep car prices steady until June 2 as customers try to get ahead of any tariffs and uncertainty. After that, they'll reevaluate. Muñoz&nbsp;says free trade is good for business and they're still investing in the US. He's on \"Bloomberg Open Interest.\"\nThe token appeared on a Binance delisting list alongside FTX's FTT token.\nCanadian asset managers Purpose Investments, Evolve, CI Global and 3iQ will launch North America’s first spot Solana exchange-traded funds on the Toronto Stock Exchange April 16. Meanwhile, Kaiko analysts say the U.S. will likely approve XRP or Solana ETFs and Bitcoin ETFs face major outflows amid trade tensions. CoinDesk's Christine Lee dives into the latest crypto ETF news on \"CoinDesk Daily.\"\nWe came across a bullish thesis on American Express Company (AXP) on Substack by Daan Rijnberk. In this article, we will summarize the bulls’ thesis on AXP. American Express Company (AXP)’s share was trading at $255.38 as of April 14th. AXP’s trailing and forward P/E were 18.23 and 16.75 respectively according to Yahoo Finance. American Express (AmEx) […]\nJohnson & Johnson plans to seek a U.S. indication for multiple general surgery procedures, including gastric bypass, which was performed in the clinical trial.\nJohnson & Johnson (JNJ) delivered earnings and revenue surprises of 7.78% and 1.26%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 16-05_J&J beat on earnings, but tariffs still pressure pharma sector",
    "date": "",
    "content": "Title: J&J beat on earnings, but tariffs still pressure pharma sector\nDate: 2025-04-15 16:05\nURL: https://finance.yahoo.com/video/j-j-beat-earnings-tariffs-163000679.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJohnson & Johnson (JNJ) reported stronger-than-expected earnings. Goldman Sachs Global Investment Research head of the healthcare business unit Asad Haider joins Catalysts with Madison Mills and StoneX senior adviser Jon Hilsenrath to take a closer look at the earnings print and Johnson & Johnson's position as US President Trump pushes for tariffs on pharmaceutical imports.\nTo watch more expert insights and analysis on the latest market action, check out more Catalysts here.\nJohnson & Johnson topped the street's expectations in its latest quarter, thanks to strong cancer drug sales during the 3-month period. The company boosted its full-year sales outlook, but tempered expectations for its adjusted operational profit, citing the impact of a recent acquisition and, of course, tariffs. President Trump has warned that levies will be placed on the sector very soon. Joining us now to discuss is Saad Hater, Goldman Sachs Global Investment Research Head of the Healthcare Business Unit. Saad, great to speak with you. Let's start on Johnson & Johnson maintaining the EPS outlook. How were they able to do that in your view and what are your other big takeaways?\nYeah, thanks for having me. Um so, there there were some questions. I mean, overall, we thought that the quarter was actually very encouraging and very much in line with the thesis uh that we have on Johnson & Johnson. And just to zoom out for a second, we upgraded the stock to buy last week, uh based on our view that the innovative medicine business is going to continue to surprise on the upside and show encouraging trends. And that's really what you saw. Now, there was some gross margin related pressure, um which they cited, uh they attributed to Part D dynamics. This is the first quarter that the pharma industry is going to see uh some headwinds from the inflation reduction act, uh particularly related to Part D. Uh and there were also some tariff related costs that they that they talked about, um about $400 million that they attributed to the MedTech business. But beneath the hood, uh the pharma business did really well and their operating margins actually beat because they flex the P&L by cutting costs and cutting R&D. And to us, that was actually a very encouraging sign. And I think the combination of those things, along with a little bit of an FX tailwind, had them maintain uh the earnings for the year.\nAnd how are you thinking about the impact of tariffs, both on on Johnson & Johnson, and then just moving forward? Because they are the first pharma name to report, what does the what what did their results tell you about how the rest of the industry might be impacted by tariffs as well?\nWell, the short answer is not much. And I think uh it's still all very uncertain. I think uh we all have been waiting to see what the announcement for tariffs is. I think what's known, of course, is that uh the the pharmaceutical industry is going to have be tariffed, the way semiconductors and autos and several other industries are. Uh we've been waiting for this for a while. What we also know is that there has already been a section 232 investigation that has begun. Uh and uh depending on how that goes, uh what we're all going to be waiting for is to see what level of tariffs are going to be applied to the industry. And uh at this point, I just don't think we have a lot of clarity on any of that. And so, what that's been doing is creating a lot of uncertainty across the entire pharmaceutical sector. It's making people question the traditional orthodoxy around the margin structure and the profitability of this sector. But we just don't know a lot right now, and I think it would be too early for me to speculate on where this all lands. Uh but this is a cloud that the sector that it's an overhang on the sector. And until we get a real off-ramp, uh it's going to be hard to see how that uh um you know, how that overhang goes away.\nAnd Saad, my guest host, John Hilsenrath, is still with me. John, you got a question for Saad?\nSaad, you you talk about J&J flexing their earnings muscle by cutting costs and cutting R&D. Uh I'm listening to hear how all of this affects the economy, and that sounds like bad news to me.\nWell, I don't think it's I don't think it's bad news necessarily. I mean, I think we don't we don't really know uh line items on what exactly they did on the SG&A and the R&D side. I think it just speaks a little bit to the leverage that they have across the P&L to uh you know, make these types of investments. I think what's more interesting is just the way that Johnson & Johnson is has been responding, as I expect others to to to these tariff threats, which is uh building uh infrastructure, manufacturing facilities in the US. I think everyone saw that uh about 3 weeks ago, they announced a $55 billion manufacturing commitment to the US that is higher, that's about 25% higher than what they had initially said they'd do. Uh they opened a new facility in North Carolina, which they are going to use to manufacture in the US. And there's three other facilities that they're going to bring on the manufacturing side that are yet to come. So, I think those types of measures are probably more important for, as far as the overall economy goes, than them, these pharma companies, really flexing the the the the P&L in there with with things like SG&A and and R&D.\nYeah, Saad, I'm also curious how you're thinking about the impact of China and any China demand on this. John, I wonder if you have a question to that end as well.\nWell, I I mean, I'm I'm interested in in China, and I'm also interested in, you know, the risk that that they cut off supply chains and that that affects the supply chain of the pharma industry.\nI mean, John, I just don't think we know. I just think it's just too early to speculate how this all plays out. Um like I said, uh there are we are right now navigating navigating a period in the pharmaceutical sector where there are just a lot more questions than there are answers. I think it would be too premature for me to speculate uh on, you know, where uh what gets tariffed, what happens with China, what happens with demand. Um but our focus is just on fundamentals, and our call on J&J really has to do with the fact that their pharma business and some of the new product cycles within their pharma business are actually underappreciated, based on some of the diligence that we've done. And once this blows through, I mean, that's really where we'd be guiding investors.\nJohnson & Johnson plans to seek a U.S. indication for multiple general surgery procedures, including gastric bypass, which was performed in the clinical trial.\nNew tariffs, primarily on medical technology products, are projected to add $400 million in costs this year, Chief Financial Officer Joseph Wolk said.\nJohnson & Johnson is holding its earnings outlook steady despite President Donald Trump signaling he could put tariffs on the pharmaceutical industry. The administration announced earlier it would conduct an investigation into drug imports. That move is widely seen as a first step toward imposing new levies. Earnings and revenue both beat estimates for the quarter. Johnson & Johnson CFO Joe Wolk joined Bloomberg Open Interest to talk about how tariffs could hit the industry and the drug maker's bottom line.\nJohnson & Johnson (JNJ) delivered earnings and revenue surprises of 7.78% and 1.26%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Bristol-Myers Squibb Company (NYSE:BMY) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the end […]\nJ&J beats first-quarter earnings and sales estimates. It raises sales guidance for 2025 to reflect the addition of Caplyta from the Intra-Cellular acquisition.\nPer the latest discussion with the FDA, a confirmatory phase III study is required to seek approval for IRWD's apraglutide in short bowel syndrome with intestinal failure.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Alphabet Inc. (NASDAQ:GOOG) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 17-30_Johnson & Johnson (NYSE_JNJ) Increases Dividend and Reports Strong Q1 Earnings Growth",
    "date": "",
    "content": "Title: Johnson & Johnson (NYSE_JNJ) Increases Dividend and Reports Strong Q1 Earnings Growth\nDate: 2025-04-15 17:30\nURL: https://finance.yahoo.com/news/johnson-johnson-nyse-jnj-increases-173039383.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJohnson & Johnson recently announced a 4.8% increase in its quarterly dividend and released positive Phase 3 clinical data for icotrokinra, an oral treatment for plaque psoriasis. These events occurred alongside solid earnings reports, with a significant rise in net income and earnings per share compared to the previous year. While the company's stock price increased by 6.64% over the last quarter, the broader market also trended upward, climbing 5.9% in the past year. These company developments likely complemented the overall market movements and investor sentiment, rather than diverging from broader trends.\nYou should learn about the 1 warning sign we've spotted with Johnson & Johnson.\nOutshine the giants: these 25 early-stage AI stocks could fund your retirement.\nJohnson & Johnson's recent dividend increase and positive Phase 3 clinical data for icotrokinra could significantly bolster investor confidence by enhancing perceptions of future earnings potential and revenue growth. The company's total return, including dividends, was 17.11% over the past five years, indicating steady but moderate financial performance. This is set against the backdrop of a one-year underperformance relative to the US Pharmaceuticals industry's 7% decline.\nLooking forward, these announcements could positively influence earnings forecasts, especially with expected boosts from TREMFYA and RYBREVANT within the Innovative Medicine segment. This aligns with strategic acquisitions and product launches that have been projected to grow revenue and expand market footprint. Despite these gains, competition and economic pressures remain considerations, particularly in international markets like China.\nCurrently trading at US$150, the share price reflects a modest discount to the analyst consensus price target of US$171.11. This implies potential upside and suggests market expectations are still reconciling with Johnson & Johnson's future growth prospects. Revenue and earnings forecasts will likely incorporate these developments, while still being mindful of existing risks such as biosimilar competition and macroeconomic pressures.\nReview our historical performance report to gain insights into Johnson & Johnson's track record.\n This article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\nCompanies discussed in this article include NYSE:JNJ.\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nJohnson & Johnson on Tuesday reported better-than-expected first-quarter results and lifted its sales forecast for the full year.\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nJ&J beats first-quarter earnings and sales estimates. It raises sales guidance for 2025 to reflect the addition of Caplyta from the Intra-Cellular acquisition.\nFutures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow trading just below break-even, as investors braced for a flurry of corporate earnings. The muted open followed Monday’s tech-led rally, which briefly masked deeper market jitters tied to tariffs and macro uncertainty.\nJohnson & Johnson is holding its earnings outlook steady despite President Donald Trump signaling he could put tariffs on the pharmaceutical industry. The administration announced earlier it would conduct an investigation into drug imports. That move is widely seen as a first step toward imposing new levies. Earnings and revenue both beat estimates for the quarter. Johnson & Johnson CFO Joe Wolk joined Bloomberg Open Interest to talk about how tariffs could hit the industry and the drug maker's bottom line.\nFulton Financial (FULT) delivered earnings and revenue surprises of 18.18% and 1.53%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nWhile the top- and bottom-line numbers for Johnson & Johnson (JNJ) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nJ&J is projecting a $400m hit due to US tariffs in 2025, but reaffirmed its profit outlook while raising its sales forecast.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 18-07_Equities Little Changed Intraday After Corporate Earnings",
    "date": "",
    "content": "Title: Equities Little Changed Intraday After Corporate Earnings\nDate: 2025-04-15 18:07\nURL: https://finance.yahoo.com/news/equities-little-changed-intraday-corporate-180750271.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nFigma confidentially filed for an IPO, setting up a hotly anticipated software listing in the face of economic gloom.\nThe International Energy Agency on Tuesday reduced its projections for global oil demand growth in 2\nAlbertsons (ACI) issued a full-year earnings outlook below Wall Street expectations on Tuesday, even\nBank of America's (BAC) first-quarter results surpassed Wall Street's projections as record trading\nNetflix (NFLX) likely faces \"limited\" risks from a potential global or US economic downturn amid the\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nJ&J faces several headwinds at the start of the year, including patent expiry, talc litigation, and, now, tariffs.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 18-40_J&J projects $400m tariff hit but raises sales outlook",
    "date": "",
    "content": "Title: J&J projects $400m tariff hit but raises sales outlook\nDate: 2025-04-15 18:40\nURL: https://www.pharmaceutical-technology.com/news/jj-projects-400m-tariff-hit-but-raises-sales-outlook/?.tsrc=rss\nContent:\nJ&J is projecting a $400m hit due to US tariffs in 2025, but reaffirmed its profit outlook while raising its sales forecast. \nJohnson & Johnson Innovative Medicine (J&J) addressed the potential impact of pharmaceutical tariffs during its Q1 2025 earnings call, as the US government intensifies its scrutiny of foreign drug supply chains. The company’s chief financial officer Joseph Wolk said the company expects a $400m cost tied to newly proposed and existing tariffs, with the largest burden stemming from China’s retaliatory duties on US-origin goods.\nWith the possibility of pharma-specific tariffs looming and the Department of Commerce announcing the launch of a Section 232 investigation into pharmaceutical imports on 14 April, investors were watching closely for commentary from J&J on US trade policy. The investigation gives President Donald Trump 90 days to determine whether tariffs should be imposed on national security grounds.\n\n                The gold standard of business intelligence.\n            \n\n                    Find out more\n                    \n\n\n\n\nCEO Joaquin Duato said the company is analysing the Section 232 process, noting it had been anticipated and would be treated as a normal regulatory development. “It’s important that companies in healthcare partner with the administration to look to mitigate some of the vulnerabilities that exist today in our healthcare supply chain,” Duato said.\n“We plan to do it in this process to make sure that we have enough manufacturing capacity here in the US to be able to address multiple scenarios. We want to be deferential to the administration and their process,” he added.\nMany large pharma companies like MSD and Novartis have announced plans to increase manufacturing activity in the US against the backdrop of these tariff announcements, and J&J announced its own $55m US investment in March 2025.\n“Since President Trump’s 2017 tax reform, the investment in manufacturing – both in medtech and in pharmaceuticals – has significantly increased. When you think about our recent announcement of investing $55bn over the next four years at the completion of this investment plan, essentially all our advanced medicines that are used in the US will be manufactured in the US,” said Duato.\nJ&J indicated that most of the projected $400m tariff impact will affect its Medtech division. The total includes duties from China, as well as import tariffs from Mexico and Canada not excluded under the United States–Mexico–Canada Agreement (USMCA). Wolk noted that mitigation strategies are limited due to existing price controls and contractual agreements, particularly in the pharmaceutical segment. Tariff-related costs will primarily be recorded as inventory before impacting future profit and loss statements.\nDespite the headwinds, J&J posted Q1 results above analyst expectations. Revenue for the quarter rose by 2.4% to $21.9bn, with operational growth of 4.2% and adjusted operational growth of 3.3%. Oncology products, including multiple myeloma drug Darzalex (daratumumab), remained key contributors.\nThe company raised its 2025 sales forecast by $700m to $92bn at the midpoint, reflecting the addition of Caplyta (lumateperone) following its $14.6bn acquisition of Intra-Cellular Therapies. However, J&J lowered its adjusted operational EPS growth projection to 6.2%, down from 8.7%, citing dilution from the acquisition. Adjusted reported EPS growth remains unchanged at 6.2%, consistent with guidance first issued in January 2025.\nJ&J also reported regulatory approvals for two key therapies in 1Q: the US Food and Drug Administration (FDA) cleared Tremfya (guselkumab) for Crohn’s disease, and the European Commission (EC) approved Rybrevant (amivantamab-vmjw) for specific lung cancer indications.\nMedtech operational sales rose 4.1%, with growth driven by cardiovascular and general surgery segments. Orthopaedics showed weakness, particularly in spine and sports medicine.\nLegal challenges remain ongoing. In April 2025, a Texas court blocked J&J’s attempt to resolve talc-related liabilities via a bankruptcy filing by its subsidiary Red River Talc. J&J previously expressed its intention to defend itself against the claims, which it insists are “meritless” and “premised on junk science”. J&J intends to recover up to $7bn from legal reserves.\n\n\n                The gold standard of business intelligence.\n            \n\n\n                    Find out more\n                    \n\n\n\n\nGive your business an edge with our leading industry insights.\nGive your business an edge with our leading industry insights. \n\n\n\n\n\n\n\n\n\n\n\n\n                                                                                                                        Pharma Technology Focus : Pharmaceutical Technology Focus (monthly)                                                                                                                        \n\n\n\n\n\n\n\n\n                                                                                                                                Thematic Take (monthly)                                                                                                                        \n\n\n\n\n\n\n\nVisit our Privacy Policy for more information about our services, how we may use, process and share your personal data, including information on your rights in respect of your personal data and how you can unsubscribe from future marketing communications. Our services are intended for corporate subscribers and you warrant that the email address submitted is your corporate email address. \n\n\nView all newsletters from across the GlobalData Media network.\n\n\t\tThe leading site for news and procurement in the pharmaceutical industry\n\n\t\t\t\tPowered by\n\t\t\t\t\n\n© Verdict Media Limited 2025\nThese cookies are necessary for the website to function and cannot be switched off in our systems. They are usually only set in response to actions made by you which amount to a request for services, such as setting your privacy preferences, logging in or filling in forms. You can set your browser to block or alert you about these cookies, but some parts of the site will not then work. These cookies do not store any personally identifiable information.\nThese cookies enable the website to provide enhanced functionality and personalisation. They may be set by us or by third party providers whose services we have added to our pages. If you do not allow these cookies then some or all of these services may not function properly.\nThese cookies may be set through our site by our advertising partners. They may be used by those companies to build a profile of your interests and show you relevant adverts on other sites. They do not store directly personal information, but are based on uniquely identifying your browser and internet device. If you do not allow these cookies, you will experience less targeted advertising.\nThese cookies allow us to count visits and traffic sources so we can measure and improve the performance of our site. They help us to know which pages are the most and least popular and see how visitors move around the site. All information these cookies collect is aggregated and therefore anonymous. If you do not allow these cookies we will not know when you have visited our site, and will not be able to monitor its performance."
  },
  {
    "title": "2025-04-15 19-01_Johnson & Johnson (JNJ)_ Stuck in a Range but Ready to Break Out if Legal Clouds Clear – Jim Cramer ",
    "date": "",
    "content": "Title: Johnson & Johnson (JNJ)_ Stuck in a Range but Ready to Break Out if Legal Clouds Clear – Jim Cramer \nDate: 2025-04-15 19:01\nURL: https://finance.yahoo.com/news/johnson-johnson-jnj-stuck-range-190144848.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses.\nOn Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing to earnings reports from major banks.\n“Rumor, innuendo, intrigue these are the stuff of great novels, of fabulous miniseries, riveting plays, and now they’re the stuff of the stock market.”\nREAD ALSO: Jim Cramer Discussed These 12 Stocks and 10 Stocks on Jim Cramer’s Radar Recently.\nHe noted the chaotic nature of the current environment and remarked that “this tape has it all,” and emphasized how unpredictable developments from the White House have added to the turbulence. Cramer noted that information is being released constantly, through press conferences, posts on Truth Social, or casual remarks, and that each has the potential to move vast sums of money across asset classes.\n“Trillions of dollars in and out of bonds, of currency, of gold, of crypto,” he said, all based on impulsive statements. He pointed out the sheer volume of contradictions in the news cycle and stressed, “Except this isn’t an eight-part blockbuster, it’s our money.” Cramer lamented how even social media activity, like tweets, can trigger massive swings in the markets. He noted that Friday’s market action felt like it was shaped entirely by this dynamic.\nCramer questioned whether the market might be in the process of forming what he called a “liberation day bottom,” a moment when selling pressure finally ends because investors feel that all the bad news is out. But he acknowledged the uncertainty of that theory as he said, “Not sure, I’m just not sure.” He added:\n“Have you ever noticed the weekends don’t provide relaxation anymore because the president’s got advisors? He’s got to put people out. He wants to tweet. He’s got meetings. No relaxation time, no downtime…. Monday’s trading, well, let’s just say that it looks like that it’s earning season so it’s gonna be even harder than usual.”\nFor this article, we compiled a list of 15 stocks that were discussed by Jim Cramer during the episode of Mad Money aired on April 11. We listed the stocks in the order that Cramer mentioned them. We also provided hedge fund sentiment for each stock as of the fourth quarter of 2024, which was taken from Insider Monkey’s database of over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 98\nDiscussing drug stocks, Cramer mentioned Johnson & Johnson (NYSE:JNJ) and discussed:\n“The drug stocks have been having a huge conundrum, right? I mean they have danced to the tune of a new FDA, which falls under the purview of a different kind of guy, RFK Jr. at Health and Human Services. He’s not exactly pharma-friendly. Meanwhile, they’re supposed to be manufacturing all their drugs here or else they’ll be hit with big tariffs.\nJohnson & Johnson (NYSE:JNJ) is a healthcare company engaged in researching, developing, manufacturing, and marketing a broad range of medical products.\nOverall, JNJ ranks 4th on our list of stocks that Jim Cramer discusses. While we acknowledge the potential of JNJ as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than JNJ but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nJPMorgan Chase Bank of America  and  Bank of New York Mellon  are seeking other ways to send sensitive information to the Office of the Comptroller of the Currency due to concerns around an email hack that is still under investigation, according to people familiar with the matter.  Banks have expressed alarm about the breach and the OCC’s communication and slow response to the incident, the people said.  The OCC posted a notice about the hack on its website in February.\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nBank of America and Citigroup post better-than-expected first-quarter earnings, a report says China ordered a halt to Boeing jet deliveries as part of the escalating trade war with the U.S., and Tesla stock rises after its chart forms a ‘death cross.’\nJ&J is projecting a $400m hit due to US tariffs in 2025, but reaffirmed its profit outlook while raising its sales forecast.\nJohnson & Johnson  stock slipped on Tuesday, even after the company reported first-quarter earnings that surpassed expectations, and boosted its full-year sales forecast.  The company said it now expects operational sales of $92 billion, versus a prior forecast of $91.3 billion.  J&J also guided for estimated reported sales of $91.4 billion, up from a previous $89.6 billion.\nJ&J faces several headwinds at the start of the year, including patent expiry, talc litigation, and, now, tariffs.\nTariffs, and the economic uncertainty and market volatility they have unleashed, are top of of mind for investors. On Wednesday, a monthly report on retail sales will be an important data point. The figures will be scrutinized for signs that U.\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nThe chaotic activity in the usually staid Treasury market has opened the door to some potential buying opportunities.  The Treasury market has been responding to mixed messages for weeks, even before President Donald Trump’s tariff announcement.  As Treasury yields rose, the dollar fell—both reversing the typical-safe haven moves those markets make when investors are worried.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 19-26_J&J Forecasts $400 Million in Tariff-Related Costs This Year",
    "date": "",
    "content": "Title: J&J Forecasts $400 Million in Tariff-Related Costs This Year\nDate: 2025-04-15 19:26\nURL: https://finance.yahoo.com/m/99cc1f40-f58d-3f24-b134-22a5c0860954/j%26j-forecasts-%24400-million-in.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview. Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs. J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nWhile J&J expects tariffs will cost it $400 million this year, the company maintained its earnings estimate and upped its sales guidance for 2025.\nJohnson & Johnson on Tuesday reported better-than-expected first-quarter results and lifted its sales forecast for the full year.\nThe headline numbers for Bank of America (BAC) give insight into how the company performed in the quarter ended March 2025, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals.\nCitigroup (C) delivered earnings and revenue surprises of 6.52% and 1.95%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nWhile the top- and bottom-line numbers for Johnson & Johnson (JNJ) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nBank of America and Citigroup post better-than-expected first-quarter earnings, a report says China ordered a halt to Boeing jet deliveries as part of the escalating trade war with the U.S., and Tesla stock rises after its chart forms a ‘death cross.’\nJohnson & Johnson stock fell alongside the broader market, despite beating first-quarter calls and hiking its 2025 sales guidance.\nJ&J beats first-quarter earnings and sales estimates. It raises sales guidance for 2025 to reflect the addition of Caplyta from the Intra-Cellular acquisition.\nVeeva Systems (VEEV) closed the most recent trading day at $222.72, moving -0.42% from the previous trading session.\nNew tariffs, primarily on medical technology products, are projected to add $400 million in costs this year, Chief Financial Officer Joseph Wolk said.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 19-49_J&J expects a $400M hit from tariffs, mostly from China",
    "date": "",
    "content": "Title: J&J expects a $400M hit from tariffs, mostly from China\nDate: 2025-04-15 19:49\nURL: https://finance.yahoo.com/video/j-j-expects-400m-hit-194926931.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJohnson & Johnson (JNJ) beat first quarter earnings expectations, but concerns over a $400 million tariff impact, mainly from China, are keeping shares flat. Yahoo Finance Senior Reporter Anjalee Khemlani joins Market Domination to show how the company's medical device business is feeling the pressure.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\nJohnson & Johnson tops first quarter earnings estimates, but the pharma company expecting a tariff impact on business. And Yahoo Finance's Anjalee Khemlani joins us now with the very latest, Anj.\nThat's right, Josh. And we know that of course, tariffs are top of mind for the entire pharma sector as, we know, we heard the announcement from the administration yesterday about the specific pharmaceutical tariffs. Uh, Johnson & Johnson sort of bridges two gaps. It's it also sells medical devices and that includes to China. So that is where a lot of the impact comes from for the business. Just taking a quick look at the earnings, they did beat on both the revenue as well as earnings per share, but that doesn't seem to really have helped their stock. It's been trading largely flat, but, you know, slightly negative all day long. And that's because Wall Street is still waiting to hear about the final impacts. We took a look at what they said during the earnings call and they said they were expecting about $400 million in terms of impact and that's largely coming from those medical devices. I had a chance to catch up with CFO Joe Wolk earlier today and here's what he had to say specifically about where that $400 million is coming from. Take a listen.\nThe tariffs that we've included in that 400 million relate to products that are not exempt under USMCA, some of the aluminum and steel tariffs that currently exist and apply to our MedTech products, and then the China tariffs, both, uh, uh, from China as well as the retaliatory, uh, tariffs that China had levied upon us. That last piece makes up probably about 70% of the total $400 million. So those are products of origin here in the US being shipped to China, and that's the impact that we we actually have. So we'll have to see with respect to pharmaceutical tariffs.\nSo they're still waiting like the rest of the industry for the rest of the, you know, the other shoe to drop, essentially. And that's where things stand right now for, uh, for the medical devices. Uh, we've seen analyst notes all day talking about how they have less protection, uh, from China in particular, but also the Mexico, Canada, as you as they mentioned, or as he mentioned earlier, about the steel and aluminum there. Uh, looking at what's ahead and how to sort of, you know, wait for everything else to fall out for the year, I asked him how he's thinking about this, in particular how to, you know, run the company knowing that the the situation is still kind of fluid. And here's what Joe had to say.\nMy only role, I guess, as CFO at this point would be to look at the profitability of business. If these tariffs continue to escalate, then you just have to make decisions like we would in any other part of our business. And we're currently doing within our orthopedics and surgery portfolio, rationalizing skews that are on the less profitable and perhaps even unprofitable side, in either certain markets or certain product portfolios. And that would be no different.\nSo, as you can see, just looking at, uh, you know, rationalizing the business, and this is already impacting the company, the first of the major pharmaceuticals to report in this quarter. So we'll just have to wait and see how the rest stack up by comparison.\nAll right, thank you, Anj. Appreciate it.\nJ&J is projecting a $400m hit due to US tariffs in 2025, but reaffirmed its profit outlook while raising its sales forecast.\nWe recently published a list of the 10 High Growth Forever Dividend Stocks to Invest In. In this article, we are going to take a look at where Tractor Supply Company (NASDAQ:TSCO) stands against other high growth forever dividend stocks. Dividend stocks have trailed the broader market over the past two years, largely due to investors […]\nHP (HPQ) concluded the recent trading session at $23.74, signifying a -1.25% move from its prior day's close.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nIn the latest trading session, Siga Technologies Inc. (SIGA) closed at $6.04, marking a -1.79% move from the previous day.\nVeeva Systems (VEEV) closed the most recent trading day at $222.72, moving -0.42% from the previous trading session.\nASML reported lower-than-expected orders, citing weakness in the chip sector. The Dutch company reported bookings of 3.94 billion ($4.47 billion) in the three months through March, lower than the average analyst expectation of 4.82 billion. ASML is the sole producer of cutting-edge lithography machines used by semiconductor companies like TSMC to make advanced chips. Bloomberg's Charlotte Hughes-Morgan reports.\nIn the most recent trading session, Eli Lilly (LLY) closed at $757.18, indicating a +0.38% shift from the previous trading day.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nJ&J beats first-quarter earnings and sales estimates. It raises sales guidance for 2025 to reflect the addition of Caplyta from the Intra-Cellular acquisition.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-42_These Stocks Moved the Most Today_ Bank of America, Citigroup, Netflix, Boeing, Tesla, HPE, Applied ",
    "date": "",
    "content": "Title: These Stocks Moved the Most Today_ Bank of America, Citigroup, Netflix, Boeing, Tesla, HPE, Applied \nDate: 2025-04-15 20:42\nURL: https://finance.yahoo.com/m/4acd1581-8487-308e-9a2a-48ddeb05703c/these-stocks-moved-the-most.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBank of America and Citigroup post better-than-expected first-quarter earnings, a report says China ordered a halt to Boeing jet deliveries as part of the escalating trade war with the U.S., and Tesla stock rises after its chart forms a ‘death cross.’\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nBoeing  stock fell after China ordered its airlines to halt deliveries of the company’s jets as part of an escalating trade war with the U.S., according to a report.  Chinese airlines have been told not to accept any more Boeing deliveries and asked that carriers not buy any further aircraft-related gear from U.S. companies, Bloomberg reported, citing people familiar with the matter.  Boeing didn’t respond to a request for comment.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nThe streamer’s shares have climbed 51% over the past year, powered higher by a password-sharing crackdown and a new ads business.\nChina tells domestic airlines not to place new orders for Boeing jets, adding new pressure to the struggling American plane maker.\nOver the past five years, China has already cut Boeing deliveries by 84% compared with the five years before.\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nJohnson & Johnson is holding its earnings outlook steady despite President Donald Trump signaling he could put tariffs on the pharmaceutical industry. The administration announced earlier it would conduct an investigation into drug imports. That move is widely seen as a first step toward imposing new levies. Earnings and revenue both beat estimates for the quarter. Johnson & Johnson CFO Joe Wolk joined Bloomberg Open Interest to talk about how tariffs could hit the industry and the drug maker's bottom line.\nRivian Automotive (RIVN) concluded the recent trading session at $11.91, signifying a -1% move from its prior day's close.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-44_Stocks fizzle after two-day rally driven by bank earnings and tech",
    "date": "",
    "content": "Title: Stocks fizzle after two-day rally driven by bank earnings and tech\nDate: 2025-04-15 20:44\nURL: https://finance.yahoo.com/news/wall-street-banks-cashing-trade-123249767.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nThe S&P 500 slipped 0.22%, the Dow fell 0.36%, and the Nasdaq edged down 0.05%. Despite recent gains, all three major indices remain well below their pre-April 2 levels, when President Trump’s “Liberation Day” tariff announcements first rattled markets.\nRead more: Wall Street banks are cashing in on trade war chaos.\nAuto stocks fell despite fresh rumors of a possible reprieve on tariffs. Ford, GM, and Rivian each ended the day lower, following a new forecast from S&P Global Ratings (SPGI) projecting a 700,000-unit drop in annual U.S. car sales if tariffs move ahead. “Affordability challenges and elevated interest rates are already pressuring demand,” analysts wrote. “Tariffs would only exacerbate those headwinds.”\nTech and financial names led the upside among individual stocks. Palantir surged more than 6% following news that NATO finalized its purchase of the company’s AI-powered Maven Smart System. Hewlett Packard Enterprise jumped 5% amid ongoing activist investor pressure, and Netflix (NFLX) added nearly 5%. Bank of America and Citigroup also posted solid gains after beating first-quarter earnings expectations, fueled by strong trading revenue and consumer banking results.\nInvestors are now looking ahead to fresh earnings from United Airlines (UAL) and The Trade Desk (TTD), both due after the bell, and to a Wednesday slate that includes Abbott Labs (ABT) and U.S. Bancorp (USB)—reports that should offer further insight into consumer health and the state of regional lending.\nStocks opened higher Tuesday, with tech and bank names leading the charge as investors welcomed a morning packed with strong earnings and fresh deal buzz. Big banks were in rally mode: Citigroup, Bank of America, and Goldman Sachs all ticked higher after posting better-than-expected results, fueled by strong trading revenues.\nPalantir Technologies jumped 4% after NATO finalized its purchase of the company’s AI-powered Maven Smart System — another boost for the defense-tech darling after Monday’s rally. Apple also edged higher, extending its 2% gain from Monday, which followed a surprise tariff exemption from the Trump administration.\nMeanwhile, Hewlett Packard Enterprise (HPE) caught a wave of investor enthusiasm after activist firm Elliott Investment Management revealed a $1.5 billion stake and backed the company’s newly announced strategic review. The broader market got a lift as chipmakers, software stocks, and AI plays rode the wave, with early signs pointing to a tech-led session and plenty of earnings drama still to come.\nAuto stocks gave back some of Monday’s gains, with Rivian (RIVN), Ford, and GM trading lower despite President Trump floating a potential delay in auto tariffs. “A US car with all US parts made in the US is a fictional tale,” analysts at Wedbush wrote, warning that the proposed tariffs — if not paused — could send the industry into “upside down mode” and trigger widespread supply-chain disruption.\nU.S. stock futures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow Jones Industrial Average trading just below the break-even line as investors braced for a flurry of corporate earnings.\nThe subdued start followed a tech-driven rally on Monday, a temporary lift amid lingering concerns around tariffs and broader economic uncertainty.\nGoldman Sachs (GS) kicked off the week’s earnings slate with a profit jump, even as CEO David Solomon warned of a “markedly different” environment in the current quarter. Echoing Solomon’s sentiments, in March, hedge funds unloaded global stocks at the fastest pace in over a decade — a sign that institutional investors may be growing more cautious as economic uncertainty deepens.\nTuesday’s earnings lineup includes Bank of America (BAC), Citigroup (C), Johnson & Johnson (JNJ), and Rent the Runway (RENT) before the bell, offering a pulse check across finance, healthcare, and consumer spending.\nBank of America beat expectations in the first quarter, with EPS of $0.90 on $27.37 billion in revenue, lifted by a strong showing in its trading division. Like Goldman Sachs, the bank benefited from market volatility, which juiced results even as the broader economic outlook remains uncertain.\nLooking to Bank of America’s consumer banking division, revenue rose 3% to $10.5 billion, with combined credit and debit card spend hitting $228 billion — up 4% from a year ago. The bank added about 250,000 new consumer checking accounts, marking its 25th straight quarter of growth, and saw 4 billion digital logins, with 65% of sales now digitally enabled.\nStill, CEO Brian Moynihan struck a cautious tone, noting that “we potentially face a changing economy in the future.”\nCitigroup posted first-quarter 2025 net income of $4.1 billion, or $1.96 per share, on $21.6 billion in revenue — a 3% increase from a year ago. Growth was broad-based across all five core businesses, with standout performances in the markets and wealth divisions.\nU.S. personal banking revenue rose 2% to $5.2 billion, powered by gains in branded cards and retail banking, though partially offset by a drop in retail services. Net interest income climbed 6%, fueled by loan growth in branded cards and wider deposit spreads in its retail banking.\nJohnson & Johnson beat Wall Street expectations in the first quarter, reporting adjusted earnings per share of $2.77 on revenue of $21.89 billion. Sales of cancer drug Darzalex jumped 20% year over year to $3.24 billion, helping drive 4.2% growth in the company’s “innovative medicine” segment.\nThe healthcare giant raised its full-year revenue guidance to between $91.6 billion and $92.4 billion, reflecting the impact of its Intra-Cellular Therapies acquisition and the addition of Caplyta, a treatment for bipolar depression. However, adjusted EPS guidance held steady at $10.50 to $10.70 as the company factors in tariffs, deal-related costs, and currency headwinds.\nJ&J also moved to reverse $7 billion previously set aside for talc-related legal settlements, after courts rejected its bankruptcy-based strategy for resolving lawsuits over its discontinued baby powder. The company maintains the claims are without merit and says it will defend them in state courts.\nDuring a television appearance on Monday, former Treasury Secretary Janet Yellen warned that Trump’s economic strategy is eroding global trust in U.S. financial assets, with volatility in Treasury yields reflecting broad investor unease.\nTreasury yields continued to climb on Tuesday, with the 10-year yield reaching 4.43%, as investors reacted to ongoing trade tensions and concerns over inflation. The bond market’s volatility has raised questions about the long-term stability of U.S. financial assets.\nBoth the Dow and the S&P 500 added about 0.8% on Monday, while the Nasdaq climbed about 0.6%. All three indexes briefly slipped into the red before rebounding, buoyed by tech stocks after the Trump administration issued a surprise tariff exemption. Apple (AAPL) stock gained more than 2% on Monday, while Palantir Technologies (PLTR) surged almost 5% following news that NATO had finalized its Maven Smart System purchase.\nAuto stocks also rallied Monday after President Donald Trump suggested his administration may offer tariff relief for automakers moving parts production. General Motors (GM) and Ford (F) each rose more than 3%, though no specifics were provided.\nFor the latest news, Facebook, Twitter and Instagram.\nBank stocks were on track for their largest increase in a week after Citi and Bank of America each reported first-quarter earnings that topped analysts’ expectations. On Tuesday the SPDR S&P Bank ETF rose 2.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nJohnson & Johnson reports strong first-quarter 2025 results, raises revenue guidance and boosts its quarterly dividends.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nOmnicom (OMC) delivered earnings and revenue surprises of 4.29% and 0.15%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nWhile the top- and bottom-line numbers for Omnicom (OMC) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nFutures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow trading just below break-even, as investors braced for a flurry of corporate earnings. The muted open followed Monday’s tech-led rally, which briefly masked deeper market jitters tied to tariffs and macro uncertainty.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 05-26_Q1 2025 Johnson & Johnson Earnings Call",
    "date": "",
    "content": "Title: Q1 2025 Johnson & Johnson Earnings Call\nDate: 2025-04-16 05:26\nURL: https://finance.yahoo.com/news/q1-2025-johnson-johnson-earnings-052648551.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJessica Moore; Vice President - Investor Relations; Johnson & Johnson\nJoaquin Duato; Chairman of the Board, Chief Executive Officer; Johnson & Johnson\nJohn Reed; Executive Vice President - Innovative Medicine, Research and Development; Johnson & Johnson\nJoseph Wolk; Chief Financial Officer, Executive Vice President; Johnson & Johnson\nJennifer Taubert; Executive Vice President, Worldwide Chairman, Innovative Medicine; Johnson & Johnson\nTim Schmid; Executive Vice President, Worldwide Chairman of MedTech; Johnson & Johnson\nLarry Biegelsen; Analyst; Wells Fargo Securities, LLC\nChris Schott; Analyst; JPMorgan Chase & Co.\nAsad Haider; Analyst; Goldman Sachs\nDanielle Antalffy; Analyst; UBS Equities\nTerence Flynn; Analyst; Morgan Stanley\nJoanne Wuensch; Analyst; Citi\nVamil Divan; Analyst; Guggenheim Securities LLC\nMatt Miksic; Analyst; Barclays\nTim Anderson; Analyst; Bank of America\nOperator\nGood morning and welcome to Johnson & Johnson's first quarter 2025 earnings conference call. (Operator Instructions) I now turn the conference call over to Johnson & Johnson. You may begin.\nJessica Moore\nHello, everyone. This is Jessica Moore, Vice President of Investor Relations for Johnson & Johnson. Welcome to our company's review of business results for the first quarter of 2025, and our updated financial outlook.A few logistics before we get into the details. As a reminder, you can find additional materials, including today's presentation and associated schedules on the Investor Relations section of the Johnson & Johnson website at investor.jnj.com.Please note that this presentation contains forward-looking statements regarding among other things the company's future operating and financial performance, market position, and business strategy. You are cautioned not to rely on these forward-looking statements, which are based on the current expectations of future events using the information available as of the date of this recording and are subject to certain risks and uncertainties that may cause the company's actual results to differ materially from those projected.A description of these risks, uncertainties, and other factors can be found in our SEC filings, including our 2024 Form 10-K, which is available at investor.jnj.com and on the SEC's website. Additionally, several of the products and compounds discussed today are being developed in collaboration with strategic partners or licensed from other companies. This slide acknowledges those relationships.Moving to today's agenda. Joaquin Duato, our Chairman and CEO, will open with a few comments on our performance and key catalysts for the company. John Reed, our Executive Vice President, Innovative Medicine, R&D, will highlight recent data from select assets.I will then review the first quarter sales and P&L results. Joe Wolk, our CFO, will then close by sharing an overview of our cash position, capital allocation priorities, and guidance for 2025. Jennifer Taubert, Executive Vice President, Worldwide Chairman, Innovative Medicine; and Tim Schmid, Executive Vice President, Worldwide Chairman, MedTech, will be joining us for Q&A.To ensure we provide enough time to address your questions, we anticipate the webcast will last slightly over 60 minutes. With that, I will now turn the call over to Joaquin.\nJoaquin Duato\nThank you, Jess and hello everyone. In the first quarter, we delivered strong operational sales growth of 4.2% across our business. Our Q1 performance reinforces my confidence in our 2025 guidance and reflects the strength of Johnson & Johnson's uniquely diversified business, with year-over-year sales increases in both our Innovative Medicine and MedTech sectors.No other healthcare company has delivered growth through the first year of losing exclusivity for a multi-billion dollar product, in our case, STELARA, and yet that is exactly what we are doing. Our resiliency is a testament to what makes us unique. We are not just a pharmaceutical company or a MedTech company, we are a healthcare company, innovating across the full spectrum of disease.Our consistent strong performance is a testament to our capabilities across commercial, R&D, and supply chain. It is also a reflection of our strength in execution, which you can see in our quarterly results. We have described 2025 as a catalyst year. It is a year that will set us up for accelerated growth through the second half of the decade and beyond.In Q1, the power of our portfolio and pipeline was on full display. In Innovative Medicine, we delivered 4.2% operational sales growth despite an approximate 810 basis points headwind from STELARA, with 11 key brands growing double digits.With our third consecutive quarter of sales above $3 billion, DARZALEX continues to set the standard in multiple myeloma with another quarter of over 20% growth. In fact, just last week, we expanded our DARZALEX indication in Europe with the approval of DARZALEX based quadruplet regimen for patients with newly diagnosed multiple myeloma, regardless of transplant eligibility.It is further proof of the impact of this medicine, which together with CARVYKTI, TALVEY and TECVAYLI is changing the conversation from treating to progression to treating to cure. Other significant oncology portfolio advancements in Q1 included Phase 3 data presented at ELCC last month, showing RYBREVANT plus LAZCLUZE extended overall survival by more than one year versus the current standard of care in first-line EGFR mutated lung cancer.Our last week, the European Commission approved subcutaneous RYBREVANT in combination with LAZCLUZE for the treatment of EGFR mutated non-small cell lung cancer. This was an important milestone for patients as subcutaneous RYBREVANT reduces administration time from hours to minutes.Our aspiration is for RYBREVANT to LAZCLUZE to become the new standard of care for these patients, and you can see our progress in Q1. In immunology, we are seeing the impact of TREMFYA's entry into inflammatory bowel disease, with our launch in ulcerative colitis, helping accelerate operational sales growth to 20%. And with our recent FDA approval in colon disease, I'm more confident than ever that this blockbuster drug will become the gold standard for IBD patients and a $10 billion plus product.Turning to MedTech. In Q1, we delivered 4.1% operational sales growth with strong performance in our recently acquired cardiovascular businesses Abiomed and Shomed as well as in surgical vision and wound closure.In addition to their contribution to MedTech growth, Abiomed and Shomed continue to meet deal model expectations and both announced important portfolio milestones this quarter. These included updates to the American College of Cardiology and American Heart Association guidelines for our Impella heart pump, which based on evidence from the DanGer Shock trial was upgraded from Class 2b to Class 2a.And in Shomed, the team launched the first of its kind, Javelin Peripheral IVL catheter for the treatment of difficult to cross lesions in peripheral artery disease. In electrophysiology, we resumed US VARIPULSE cases. And to date, we have completed more than 5,500 cases globally.Turning to surgery. We recently announced we have started OTTAVA clinical trials with a procedure that supports submission for US FDA de novo in general surgery with an indication for multiple upper abdomen procedures.This is an important milestone as we continue to strengthen our presence in robotic surgery. Beyond our existing portfolio and pipeline, we also fortified our leadership as an innovation powerhouse with two major announcements.In March, we announced our commitment to invest more than $55 billion in the US over the next four years in manufacturing, R&D, and technology. This represents a 25% increase in investment compared to the previous four years.It builds upon the company's already elevated commitment to the US economy while expanding our capacity to manufacture next generation medicine and devices for patients in America and around the world.The investment includes four planned new manufacturing facilities, the first of which broke ground last month in North Carolina. And at the beginning of April, we announced the completion of our acquisition of Intra-Cellular Therapies, which extends Johnson & Johnson's industry leading portfolio in central nervous system disorders.With the addition of CAPLYTA, we have expanded our lineup of therapies with at least $5 billion plus potential in peak year sales, further solidifying sales growth above analyst expectations now through the rest of the decade.Turning to the Talc bankruptcy ruling. As we shared a few weeks ago, we will return to the tort system where we expect continual success in litigating these meritless claims. In terms of next steps, we will immediately pursue our merchant spending in the [multi-dislitigation] to exclude plaintiffs experts known as the downward challenge.And finally, as announced this morning, we increased our dividend for the 63rd consecutive year, which we know is important to our shareholders. We had a strong start to 2025, and I'm looking forward to sharing many more successes throughout the year.Recognizing that there have been many important milestones and data readouts in the quarter, I will now pass the call to John Reed for an Innovative Medicine R&D update.\nJohn Reed\nThank you, Joaquin. I'm excited to share a few highlights from our industry leading Innovative Medicine pipeline that occurred throughout the quarter. With the successful acquisition of Intra-Cellular, I want to focus on CAPLYTA, a remarkable medicine with balanced pharmacology that delivers robust efficacy, combined with a favorable tolerability profile for neuropsychiatric disorders.CAPLYTA is already approved for the treatment of schizophrenia and is the only medicine approved for the treatment of depression in both bipolar 1 and 2 as either monotherapy or adjunctive therapy.On this slide, we're sharing data for major depressive disorder, showing very impressive and consistent improvements in the standard depression scoring metric MADRS in both Phase 3 studies that served as the basis for submission of the supplemental new drug application to the FDA. We anticipate approval of CAPLYTA later this year as an adjunctive treatment for major depressive disorder, representing the largest of the indications for novel antidepressant drugs today.Turning to oncology. We are so excited about our recent overall survival data for RYBREVANT plus LAZCLUZE in first-line non-small cell lung cancer, harboring EGF receptor gene mutations. Non-small cell lung cancer is the most prevalent type of lung cancer, making up about 85% of lung cancer diagnosis.Sadly, less than 20% of people diagnosed with this form of the disease are alive after five years and only a fraction live long enough to try a second treatment. That's why it is so important to use the best treatment first.In a head-to-head study against today's standard of care, our RYBREVANT plus LAZCLUZE regimen improved overall survival by more than a year with the Kaplan-Meier survival curves continuing to separate at 37.8 months median follow-up.With RYBREVANT's triple mechanism of action, we're looking to reset the standard five year survival expectations in a never before same way. In simplest terms, we are giving patients more hope that they may live to celebrate another birthday, anniversary, or other important family event, a truly practice-changing achievement.Now moving on to immunology. I draw your attention to the recent FDA approval of TREMFYA in Crohn's disease, our fourth indication for TREMFYA. TREMFYA is currently the only IL-23 inhibitor, with the flexibility of subcutaneous administration for both induction and maintenance dosing for the treatment of Crohn's disease, which means patients can start their treatment by self-administering with results as rapid and robust as receiving the IV in a clinic or doctor's office.Additionally, in a recent head-to-head study in adult patients with moderately to severely active Crohn's disease, TREMFYA demonstrated superiority versus STELARA in all pooled endoscopic endpoints. As the only dual-acting IL-23 inhibitor, TREMFYA neutralizes IL-23, while also binding to CD64 and immune cells that produce IL-23, thus localizing TREMFYA right at the source of inflammation. TREMFYA continues to offer an exceptional solution for patients struggling with inflammatory bowel disease.Lastly, highlighting some of our latest data for our investigational oral IL-23 pathway inhibitor, icotrokinra, we are aiming to redefine the standard of care for people living with plaque psoriasis. Icotrokinra is the first and only targeted oral peptide that selectively blocks the IL-23 receptor.In two placebo-controlled Phase 3 studies, icotrokinra demonstrated impressive complete skin clearance and a favorable safety profile in a once daily pill. Our Phase 3 data demonstrated that nearly half of adult patients and three quarters of adolescents with moderate to severe plaque psoriasis treated with icotrokinra achieved completely clear skin by week 24.We also reported that icotrokinra achieved the prespecified endpoints in additional Phase 3 psoriasis studies, comparing our molecule head-to-head with the most commonly prescribed TYK2 inhibitor. Those data will be shared in an upcoming medical Congress.Looking forward, we are initiating the first ever head-to-head study seeking to demonstrate the superiority of a pill, icotrokinra, compared to an injectable biologic, STELARA, in moderate to severe plaque psoriasis, representing an important step forward in psoriasis research. As a reminder, we intend to file icotrokinra for approval later this year.Finally, beyond psoriasis, we recently announced positive top line results from ANTHEM-UC, our Phase 2b study of icotrokinra in adults with moderate to severe ulcerative colitis. That study showed that icotrokinra achieved impressive clinical remission rates, combined with a favorable safety profile, again, dosed as a once-daily pill.With all this progress, you can understand why we continue to be excited about the potential of icotrokinra to transform the treatment paradigm for patients battling with autoimmune diseases. Overall, across all our therapeutic areas, we are absolutely thrilled with the progress that our pipeline has made in the first quarter of this year, and we are eager to report on other significant milestones scheduled for the remainder of 2025.And now I will turn the call over to Jess.\nJessica Moore\nThank you, John. Moving to our financial results. Unless otherwise stated, the percentages quoted represent operational results, and therefore exclude the impact of currency translation. Starting with Q1 2025 sales results. Worldwide sales were $21.9 billion for the quarter.Sales increased 4.2% despite an approximate 470 basis point headwind from STELARA. Growth in the US was 5.9% and 2.1% outside of the US. Worldwide growth was positively impacted by 90 basis points due to acquisitions and divestitures.Turning now to earnings. For the quarter, net earnings were $11 billion, and diluted earnings per share was $4.54, versus diluted earnings per share of $1.34 a year ago, primarily driven by the reversal of $7 billion related to the Talc settlement proposal.Excluding after tax intangible asset amortization expense and special items for both periods, adjusted net earnings for the quarter were $6.7 billion, and adjusted diluted earnings per share was $2.77, representing increases of 1.9% and 2.2%, respectively, compared to the first quarter of 2024.We are proud to deliver bottom line growth despite the loss of exclusivity of STELARA and the impact of Part D redesign. I will now comment on business sales performance in the quarter. Beginning with Innovative Medicine. Worldwide sales of $13.9 billion increased 4.2%, despite an approximate 810 basis point headwind from STELARA. Growth in the US was 6.3% and 1.5% outside of the US.Starting with oncology. DARZALEX growth was 22.5%, primarily driven by continued share gains of approximately 3 points across all lines of therapy and approximately 5 points in the frontline setting as well as market growth.CARVYKTI achieved sales of $369 million and growth of over 100%, driven by share gains and capacity expansion. This reflects sequential growth of 10.5% as we continue to expand outside of the US. TECVAYLI and TALVEY growth was 15% and 50.2%, respectively, reflecting strong launches in the relapsed refractory setting.Patient demand remained strong despite continued adoption of longer dosing intervals. ERLEADA continued to deliver strong growth of 14.6% despite the impact of Part D redesign, primarily driven by share gains and market growth. RYBREVANT plus LAZCLUZE continued its strong launch trajectory with sales of $141 million and growth over 100%.Within immunology, TREMFYA delivered growth of 20.1% despite the impact of Part D redesign, driven by share gains and market growth across all indications, including our newly launched indication in ulcerative colitis.STELARA declined 32.3% driven by the impact of biosimilar competition and Part D redesign. As a reminder, REMICADE and SIMPONI distribution rights in Europe were returned in Q4. This positively impacted results in the quarter and is anticipated to continue for the remainder of the year. REMICADE sales also include a one-time patient mix benefit in the US.In neuroscience, SPRAVATO growth of 42.9% was driven by increased physician and patient demand. Finally, other assets that were impacted by Part D redesign include INVEGA long-acting injectables, which declined 13.5%. Pulmonary hypertension, which declined 1.2% and was partially offset by market growth and share gains. And XARELTO, which increased by 33% and also included a one-time patient mix benefit.I'll now turn your attention to Medtech. Worldwide sales of $8 billion increased 4.1%, with growth of 5.1% in the US and 3% outside of the US. Acquisitions and divestitures had a net positive impact of 280 basis points on worldwide growth, 420 basis points in the US and 120 basis points outside of the US.Underlying Medtech performance was driven by commercial execution and strength of new products, partially offset by several one-time events, disproportionately impacting orthopedics, in addition to continued competitive PFA pressures in electrophysiology and headwinds in China. Results were negatively impacted by approximately 210 basis points worldwide, 240 in the US and 180 outside of the US due to these one-time events.In cardiovascular, electrophysiology growth was roughly flat versus prior year, driven by lapping of prior year inventory dynamics in Asia, impacting worldwide results by roughly 310 basis points and competitive PFA ablation catheter pressure.This was mostly offset by global procedure growth, new product uptake, and commercial execution. Abiomed delivered growth of 14%, driven by strong growth in all regions and continued adoption of Impella 5.5 and Impella CP technology.Cardiovascular results also included $258 million associated with the acquisition of Shockwave. As a reminder, we will lap the acquisition benefit at the end of May. Envision, contact lenses and other grew 2.7%, driven by continued strategic price actions and strong performance in the ACUVUE OASYS 1-Day family of products.Surgical vision growth of 6.2% was driven by our recent innovations, TECNIS Odyssey, PureSee, and Eyhance, as well as commercial execution, partially offset by competitive pressures in the US. Surgery grew 1.1%, with divestitures negatively impacting results by approximately 180 basis points.Performance was driven primarily by commercial execution and the continued strength and adoption of new products across wound closure and biosurgery. Growth was partially offset by competitive pressures in energy and endocutters as well as the negative impact of China VBP.Given the disproportionate impact of the one-time events to orthopedics, I'd like to draw your attention to this additional slide. Orthopedics declined 3.1%, primarily driven by the lapping of a one-time revenue recognition timing change related to certain products across all platforms in the US, fewer selling days and revenue disruption from the previously announced orthopedics transformation.These one-time events negatively impacted worldwide orthopedics growth by approximately 480 basis points, 650 basis points in the US and 210 basis points outside of the US. This was partially offset by success of new product launches and commercial execution.Now turning to our consolidated statement of earnings for the first quarter of 2025. I'd like to highlight a few noteworthy items that have changed compared to the same quarter of last year. Cost of products sold deleveraged by 320 basis points, driven by unfavorable transactional currency and product mix, primarily due to the decline of STELARA in Innovative Medicine as well as the fair value step-up and amortization associated with the Shockwave acquisition in MedTech.Selling, marketing and administrative expenses improved 130 basis points, driven by operating spend management and phasing of investments, primarily in Innovative Medicine. Research and development expenses leveraged by 190 basis points, primarily driven by portfolio progression towards commercialization and phasing of investments in Innovative Medicine, partially offset by investments associated with the recent acquisitions of Shockwave and V-Wave in MedTech.Interest income and expense was a net income of $128 million as compared to $209 million in the first quarter of 2024, primarily driven by higher interest rates paid on higher average debt balances. Other income and expense was a net income of $7.3 billion compared to an expense of $2.4 billion in the prior year, driven by the $7 billion Talc reserve reversal in the first quarter of 2025 and the $2.7 billion Talc settlement proposal recorded during the first quarter of 2024.Regarding taxes in the quarter, our effective tax rate was 19.3% versus 12.4% in the same period last year, primarily driven by the tax effect of the reversal of the Talc settlement accrual. Excluding special items, the effective tax rate was 16.3% versus 16.5% in the same period last year.I encourage you to review our upcoming first quarter 10-Q filing for additional details on specific tax related matters. Lastly, I'll direct your attention to the box section of the slide where we have also provided the company's income before tax, net earnings, and earnings per share adjusted to exclude the impact of intangible amortization expense and special items.Now let's look at adjusted income before tax by segment for the quarter. New this quarter and to continue our efforts of increased financial transparency, you will find GAAP to non-GAAP reconciliations by segment in the supplemental schedules of our press release.Innovative Medicine margin declined from 42.9% to 42.5%, primarily driven by unfavorable transactional currency and product mix and cost of products sold and Part D redesign, partially offset by operating leverage.MedTech margin declined from 26.4% to 25.9%, primarily driven by R&D and selling, marketing and administrative investments associated with the recent acquisition of Shockwave and V-Wave. As a result, adjusted income before tax for the enterprise as a percentage of sales decreased from 36.8% to 36.6%. This concludes the sales and earnings portion of the call, and I will now turn the call over to Joe.\nJoseph Wolk\nHello, everyone, and thank you for joining us today. Thanks, Jessica. Not just for the transition now but also for how well you have led the Investor Relations function in the past few years. The investment community will miss you, but we look forward to seeing you in the lead finance role for Innovative Medicine. Our first quarter results demonstrate the strength and reliability of Johnson & Johnson's diversified business model.Innovative Medicine achieved robust growth in the face of STELARA biosimilar entrants and we advanced our pipeline, attaining significant clinical and regulatory milestones. In MedTech, as indicated in January, we anticipate pockets of challenge early on and are planning for higher second half growth in those areas of our business.The team is focused on commercial execution and accelerating the recently launched products to deliver MedTech's commitments that are included in the company's full year guidance. The recent acquisitions of Abiomed and Shockwave continue to expand our presence in higher growth markets.In addition, we continue to take steps to improve MedTech's future margin profile, implementing a restructuring program designed to simplify and focus the operations of our surgery business, similar to what we launched in orthopedics in 2023.Focusing on portfolio renewal, we plan to exit certain non-strategic product lines globally and optimize select sites across the network. We anticipate some modest short term revenue disruption in surgery of approximately $250 million in total over the next two years, but these actions will improve our ability to accelerate growth and enhance profitability. The program is expected to be completed in 2027, with cost estimated at approximately $900 million.Let's now turn to cash and capital allocation. We are pleased with free cash flow generation in the quarter of approximately $3.4 billion. We ended the first quarter with $38.8 billion of cash in marketable securities and $52.3 billion of debt for a net debt position of $13.5 billion.It is important to note that cash and net debt were favorably impacted by approximately $14 billion of cash held in anticipation of the Intra-Cellular acquisition, which closed on April 2. Taking this into consideration, net debt would have been approximately $27.5 billion.Investment in innovation remains the highest priority in our capital deployment. And during the first quarter, we invested more than $3 billion in research and development, approximately 15% of sales. We also remain committed to returning capital directly to shareholders.We recognize the value investors place on our dividend, and we were pleased to announce today that our Board of Directors authorized a 4.8% increase, marking our 63rd consecutive year of dividend increases. The Intra-Cellular Therapies acquisition bolsters our neuroscience portfolio and we maintain a disciplined approach to inorganic growth, focusing on acquisitions and partnerships that align strategically and offer value creation.As noted in our Talc investor call and following up on some of Joaquin's earlier comments, we reversed $7 billion of the reserve previously held for the bankruptcy plan. This litigation has not, and we foresee will not impact our ability to execute upon our capital allocation priorities to appropriately manage our business.Let's now discuss our full year guidance for 2025. We are increasing our operational sales guidance for the full year by $700 million to reflect the addition of CAPLYTA following the completion of the Intra-Cellular acquisition. Therefore, we now expect operational sales growth for the full year to be in the range of 3.3% to 4.3%, with a midpoint of $92 billion or 3.8%.Excluding the impact from acquisitions and divestitures, we are maintaining our adjusted operational sales growth to the range of 2% to 3% compared to 2024. As you know, we don't speculate on future currency movements. And last quarter, we utilized the euro spot rate relative to the US dollar of $1.04. Last week, the euro spot rate relative to the US dollar was $1.11.We estimate an incremental positive foreign currency impact of $1.1 billion versus previous guidance, resulting in a full year headwind of $600 million. As such, we now expect reported sales growth between 2.6% to 3.6%, with a midpoint of $91.4 billion or 3.1%.Turning to other notable items on the P&L. We are maintaining our guide of operating margin improvement by 300 basis points versus 2024. This improvement takes into consideration the dilution from the Intra-Cellular transaction as well as what we know today about the impact of tariffs on our business.We now project net interest expense between $100 million and $200 million, primarily driven by financing costs associated with the Intra-Cellular acquisition. Other income is anticipated to be in the range of $1 billion to $1.2 billion, a slight increase versus previous guidance.Despite $0.25 dilution from the Intra-Cellular acquisition and including the impact of tariffs based on what is in place today, we are pleased to be able to maintain our adjusted reported earnings per share guidance of 6.2% at the midpoint for a range of $10.50 to $10.70, partially aided by the reduced FX impact.I'll now provide some qualitative considerations on phasing for your models. We continue to expect both Innovative Medicine and MedTech operational sales growth to be higher in the second half of the year versus the first half.Regarding Innovative Medicine, we maintain the assumption that the impact of STELARA biosimilar competition will accelerate throughout the year, similar to HUMIRA's erosion curve, which is still our proxy with the additive impact of Part D redesign.The impact of Part D redesign on affected products as a percent of sales will be consistently applied throughout the year, aligned with how we traditionally account for similar discount and rebate programs. Naturally, we expect a greater benefit from our newly launched products as the year progresses.Regarding MedTech, we expect normalized procedure volume and seasonality. And of course, we anniversary the Shockwave acquisition at the end of May. We anticipate our newly launched products to build throughout the year with the relaunch of VARIPULSE in the US, the introductions of dual energy STSF in the EU, Dellas Unity, VELYS Spine and TECHNIS Odyssey.Lastly, this slide highlights the one-time prior year P&L items that should be taken into quarterly consideration for your models. Beyond our financial commitments and what Joaquin and John mentioned, we are excited for the pipeline progress planned for the remainder of 2025.In Innovative Medicine, this includes expected approvals in nipocalimab for generalized myasthenia gravis, subcutaneous RYBREVANT for non-small cell lung cancer in the US, TREMFYA subcutaneous induction for ulcerative colitis, and CAPLYTA for adjunctive major depressive disorder.We continue our rolling submission of TAR-200 in non-muscle invasive bladder cancer and anticipate filing icotrokinra in psoriasis, and planned data readouts for RYBREVANT in head and neck cancer and icotrokinra in ulcerative colitis as well as head to head data versus the TYK2 in psoriasis.In MedTech, we continue to make progress with clinical trials for our OTTAVA robotic surgical system and across our cardiovascular portfolio, including heart recovery with Impella ECP submission and circulatory restoration with Javelin and Shockwave E8 launches.This progress will bode well for financial performance for the balance of this decade. In fact, building on John's earlier discussion on our Innovative Medicine pipeline and what I just outlined I'd like to revisit and update a slide that we shared at our enterprise business review in late 2023.In that slide, you may recall we highlighted key assets in our portfolio that we expected to drive long term growth and projected higher revenue than Street estimates. We've been pleased to see that some estimates have been raised since the 2023 enterprise business review. And now I'd like to walk you through some of our current thinking on our pipeline potential to show where we see even more upside.Based on current 2027 Street estimates, our projections are at least 2 times higher for RYBREVANT plus LAZCLUZE, and at least 50% higher for SPRAVATO. One asset that we didn't highlight in this look back in 2023 was TREMFYA.However, given recent regulatory approvals for inflammatory bowel disease, we now see sales for TREMFYA at least 25% higher than current Street estimates. When looking ahead to 2028, we anticipate sales for our intravascular drug releasing system previously referred to as [TARIS] to be at least 3 times higher than current Street estimates, and new to the chart, icotrokinra, our targeted oral peptide to be at least 2 times higher.To be balanced, analyst estimates are still a bit more optimistic than our own estimates on nipocalimab in 2027. However, we do anticipate closing that gap after launch. We have even stronger conviction today in our growth opportunities than at the enterprise business review as we've reached new milestones with each of these medicines.And importantly, we expect all of these assets to achieve peak year sales beyond 2028 with further potential upside to Street estimates in the outer years. Even after considering risk adjustments for unapproved products that you may apply, hopefully, you'll also conclude there is additional value to your outlooks.In summary, it was a solid start to the year. Johnson & Johnson's diversified business model uniquely positions us to tackle the headwinds in 2025, deliver on our financial commitments, and advance our pipeline to create long term sustainable value for shareholders.Thank you. And with that, we are happy to take your questions. Kevin, will you please provide instructions for those seeking to participate in the Q&A.\nOperator\n(Operator Instructions) Larry Biegelsen, Wells Fargo.\nLarry Biegelsen\nGood morning. Thanks for taking the question, and congrats on a nice quarter. Joe, you talked about $400 million in tariffs in the 2025 guidance or about $0.14 by our math. What is that on an annualized basis? And how are you thinking about being able to mitigate that over time? Can you pass along pass it along to customers? Or can you offset it by moving production? Thanks for taking the question.\nJoseph Wolk\nYeah, thanks, Larry. Good to hear from you. So what's included in the $400 million, and again, that is primarily MedTech tariffs at this point. It's based on the programs that have been announced and the timing that correlates those programs.So that would be inclusive of Mexico and Canadian import tariffs that are not excluded out of USMCA. It will include to a very small degree, some of the steel and aluminum tariffs that impact some more products. It includes the China tariffs as well as the China retaliatory tariff. And that is probably the most substantial out of all the tariffs in terms of that $400 million.And so just maybe clarify for everybody that, that is products of US origin being shipped into China, and that's probably the most penalizing factor. That $400 million, I don't want to be cavalier about that. It's obviously -- the program has been phased in as a partial year. And then you have mostly this being captured as cost of goods.So it's going to sit on the balance sheet in inventory and be relieved through the P&L in future periods. So that's how we're thinking of it. In terms of mitigation strategies. I think you know across our entire business, we're very limited in terms of price leverage, whether it be on the MedTech side.There's contractual agreements already in place and certainly very much completed on the pharmaceutical side on current products that exist in terms of taking price increase. And I know Joaquin has a few thoughts regarding tariffs and maybe other mitigation factors and the supply nature of healthcare.\nJoaquin Duato\nThank you, Joe, and thank you, Larry, for the question. Thinking about tariffs, I'm thinking specifically about pharmaceutical tariffs, there's a reason Larry why pharmaceutical tariffs are zero. It's because tariffs can create disruptions in the supply chain, leading to shortages.If what you want is to build manufacturing capacity in the US, both in MedTech and in pharmaceuticals, the most effective answer is not tariffs but tax policy. As a matter of fact, since President Trump 2017 tax reform, the investment in manufacturing, both in MedTech and in pharmaceuticals has significantly increased.And when you think about our recent announcement of investing $55 billion over the next four years at the completion of this investment plan, essentially all our advanced medicines that are used in the US will be manufactured in the US. So tax policy is a very effective tool to be able to build manufacturing capacity here in the US, both for MedTech and pharmaceuticals.\nJoseph Wolk\nLarry, I just want to follow up too. You did ask about a full year impact. And I would say like purposely ignored the question only because it would be way too speculative at this point. As we know, these tariffs are very fluid, and the responsible action for us now is to quantify what we see the impact in 2026, and then see what happens with respect to does it lend itself to negotiations with other countries and what's actually in place as we get into the later part of 2025.\nOperator\nChris Schott, JPMorgan Chase & Company.\nChris Schott\nGreat, thanks so much. Just had a question on gross margins in the quarter. It seems like these came in well below recent trends. I'm just trying to get a better understanding of the drivers there. And just the outlook going forward as we consider mix, tariffs, et cetera, on the gross margin line? Thank you.\nJoseph Wolk\nHey Chris, this is Joe. Thanks for the question. So I'd say it's -- there's a two part answer to this one. So specifically in the quarter, when looking at first quarter of 2024, we obviously had the impact of STELARA which was a much higher gross margin product than our average product in our portfolio. You had Part D, which is exclusively priced, which is eroding margin.And then you had some, I would say, transactional currency headwinds, one, a favorable impact last year or in 2023 funneling into 2024, and then some unfavorability from last year's currency action. I would expect moving forward based on some of the plans that we have, you could expect that 300 basis points to probably improve by a third to 50%, and that would be inclusive of the tariffs that I just mentioned in Larry's question.The other thing I would say is, I know you guys do a great job, but I think analysts were maybe a little bit optimistic with respect to their outlook for gross profit. Given that we had STELARA and Part D certainly communicated in the past, I believe the consensus was taking gross margins up year-over-year. And that one was probably a little bit of a miss. So we probably could have done a better job explaining it.\nOperator\nAsad Haider, Goldman Sachs.\nAsad Haider\nThanks for taking the question. Just going back to the STELARA biosimilar version and the acceleration of the trajectory that we're going to see over the course of the year. Are you able to provide any quantitative framing on your views as it relates to the extent to which you think this erosion gets smoothed out by the transition to other brands like TREMFYA and other products? Thank you.\nJennifer Taubert\nWell, good morning. Thanks so much for the question. It's Jennifer. So what we saw with STELARA in the first quarter was definitely in line with our expectations for the product for the year. And we continue to guide to the HUMIRA two year erosion curve once there were multiple biosimilars as really the best model there and make sure you are also including the additional impact of Part D redesign.If I could one additional point around STELARA, if we take a look at the business overall, it was highlighted that we had 4.2% growth across innovative medicine. That included a negative 810 basis point impact from STELARA.If you exclude that from our business, the remaining business, the bulk 90% of our business was actually growing over 12%, really demonstrating the strength of our overall business and with 11 key brands that were growing double digits. So yes, got the STELARA LOE, but the strength of the business is really coming through across all of our growth drivers.\nJoaquin Duato\nYeah, and I would add to that. It is remarkable that in a year in which we are facing the headwind of the STELARA biosimilars, Part D redesign. We are able to grow even in the first quarter. and that we are able to do it like any other company to my knowledge in the healthcare industry has done it. Is a testament to the strength of our business, to the diversification of our growth platforms. And it gives me a strong belief that we are going to continue to deliver throughout the year.\nJohn Reed\nJoaquin and Jeff just building on the focus on STELARA, of course, STELARA begins to sunset TREMFYA continues to rise. You've seen the recent approvals in inflammatory viral disease where TREMFYA now is available as the only IL-23 class medicine for subcu delivery in both induction and maintenance.We have generated additional strong data going head-to-head against STELARA in a rigorous double-blind study, and showing the superiority across all mucosal endpoints. So that's really disease modifying healing. And then finally, I would say you'll see later this year, data in psoriatic arthritis, where we've done a rigorous study looking at preservation of joint avoiding the joint erosion that leads to long term disability.And what you'll see in those data when they're presented as a best in disease profile for TREMFYA in psoriatic arthritis. So really excited about the progress with TREMFYA, the world's first selective IL-23 inhibitor.\nOperator\nDanielle Antalffy, UBS.\nDanielle Antalffy\nHey, good morning everyone. Thanks so much for taking the question. Thanks so much to for all the color on tariffs and the ortho impact, that was super helpful. And Jeff, we're really going to miss you. But congrats and good luck in your next role. Just a quick question on -- and maybe this isn't really a question, I don't know, but I think it's still on the table and that do we or don't we go into a recession?And I'd love some color as much as you can provide on how you guys think about your business and how recession proof it is reason and what areas might be most at risk of underperforming relative to where we are today in a recession? Thanks so much.\nJoseph Wolk\nHey Danielle, good to hear from you. Yeah, it's a good question. I think when we think about our business, the one thing we look to is certainly jobs reports in the US. And as of the most recent reports, it seemed to be pretty healthy. The reason we look at that is because it's a precursor as to who may have benefits and coverage prescription medications as well as procedures inclusive of elective procedures.We have seen in times past when there's been a little bit of a recession at some of those elective procedures maybe get delayed, but they don't get abandoned, and I'm thinking primarily within orthopedics. Healthcare overall has proven to be, while nothing is immune to a recession, it's been a little bit more recession proof than most other industries.And so we'll continue to monitor that. But right now, we feel good about the standards of care that we're elevating on both the innovative medicine and MedTech side of the house.\nJoaquin Duato\nOverall health care demand remains solid, and we feel good about the rest of the year regarding procedures and use of pharmaceuticals. I don't know any comments on that. Tim?\nTim Schmid\nSure. Further to Joe's point, Daniel, the category such as advanced IOLs is a good precursor to assessing the health of the economy. And so far, we haven't seen any impact on the performance of our IOL portfolio. In fact, we've seen the opposite.When you look at the performance of our IOL business on the back of the launch of both TECHNIS Odyssey here in the US and PureSee globally, we're seeing benchmark performances, and frankly, a turnaround of our performance here in the US with truly differentiated innovation. And so far, no major headwinds.\nOperator\nTerence Flynn, Morgan Stanley.\nTerence Flynn\nHi, good morning. Congrats on the quarter and thanks for taking the question. Joe, we heard your comments this morning on the Section 232 potential pharma tariffs being focused more towards generics API versus the complex branded biologics. So just wondering if that's based on your impression of the most likely outcome here or that's more just your speculation or hope for the outcome. Thank you.\nJoaquin Duato\nLet me take that question, Terence, myself. So we are analyzing the Section 232. It was already announced previously. So it's something that we consider normal that is going to happen. And overall, adding to my comments on tariffs before, I think it's also important that companies in healthcare partner with the administration to look to mitigate some of the vulnerabilities that exist today in our healthcare supply chain so as to avoid any continuity of supply effect.So it's important for us to partner with the administration and with the government, and we plan to do it in this process to make sure that we have enough manufacturing capacity here in the US to be able to address multiple scenarios.\nJoseph Wolk\nAnd Terence, just to be clear, though, we want to be differential to the administration and their process, that is speculative just looking at the pharmaceutical landscape and where national security interest may reside and what products that those are delivered from. So that was really kind of our take on it, but we are working and engaging with the administration and being differential to their process.\nOperator\nJoanne Wuensch, Citibank.\nJoanne Wuensch\nGood morning, and thank you for taking the question and providing all of this information, very helpful. I do want to sort of just pause for a second on the orthopedic sales and try to unpack how much of that is which variable is there a way to quantify it? And how do we think about the recovery in the back half of the year and then into next year. Thank you.\nTim Schmid\nJoanne, thank you for the question. And as we mentioned, we've tried to provide as much as possible to the significant impact of one timers in the quarter, which, to your point, have disproportionately impacted the Ortho business to the tune (inaudible) 480 basis points.There are three key drivers to that. Number one, the lapping of prior year change in walking implants revenue recognition, fewer selling days, and finally, revenue disruption from the recent ortho transformation, which we announced in 2023.So when you actually look at our operational growth when accounting for those, it would be closer to 2%. Now at the same time, I will say, Joanne, we're not satisfied. Our underlying performance was impacted by competitive pressures primarily in spine and sports, which is partially offset by strong NPIs and commercial execution in categories like trauma, shoulder and foot and ankle.What gives us confidence in continued acceleration to the back half of the year is the incredible impact of truly differentiated innovation across ortho portfolio. In fact, in 2024, we had 18 510(k) approvals here in the US and 45 outside of the US across our portfolio.And what gives us confidence is this combination of having best-in-class implants with truly differentiated enabled technology such as VELYS. In our hips portfolio, we believe we're going to see continued performance on the back of our focus on anterior approach, both with ACTIS, VELYS, KINCISE 2.0.In knees, we have seen a slowdown in revisions where I think you know we are historically number one, but feel very confident about continued momentum in primary with the combination of ATTUNE and VELYS, which is now available in 30 markets. We have 110,000 procedures.And as you probably know, we're now launching the VELYS (inaudible) in the coming quarters. In trauma, this was a standout quarter for us, close to 7.3% operational growth when you account for the one-timers, and this was driven by a tremendous uptake of our VOLT Plating System and the feedback we've got from surgeons, especially for our small frag menu frag, our distal radius has been exceptional. I think you also know that spine has been a bit of a laggard for us in the ortho portfolio.We are now effectively launching the trial to spine system, which is a thoracolumbar system, coupled with VELYS Spine also launching in the coming quarters. And so not the best start but strong confidence in improved performance for the remainder of the year in ortho.\nOperator\nVamil Divan, Guggenheim Partners.\nVamil Divan\nGreat, thanks for taking the questions and for all the information. So I just wanted to maybe focus on that slide 29, Joe, that you touched about on this for you, Joe, or for Jennifer. I appreciate you sharing your perspectives on those products and how they differ your expectations are for consensus.There's three products that are not on there anymore that were there at the end of 2023, and that's CARVYKTI, TALVEY, and TECVAYLI. And I don't think the consensus expectations have changed for those very much since then.So maybe you can just talk about what has changed there why those aren't listed? Has there anything changed from your internal perspective or again externally that just had those come off of that list. Thank you.\nJessica Moore\nHi Vamil, this is Jess. Yes, you're absolutely correct. The multiple myeloma portfolio was on the slide during the EBR in 2023, and they are not on the slide today. Not saying that there is not still a disconnect, but it's just not to the extent of the other products on the list. At that time, we had estimated if you did the math on the slide, it would have been about $4 billion that would have been added to 2027.Around $2 billion was added. So those estimates did go up at that time. Again, not that there's not still a disconnect. It's just not to the extent of the others on the slide because those estimates were increased.\nJoseph Wolk\nSo just to be super clear on that one, Vamil, we are still extremely bullish based on the clinical progression, R&D as well as the performance that we're seeing in the marketplace. I mean, look at CARVYKTI, I think, doubled sales year-on-year. So it's just a matter of that you guys took your numbers up. And so we agree, I guess, is maybe the best way to say that.\nJennifer Taubert\nMaybe just to add in a little bit more on CARVYKTI. So yeah, over 100% operational growth in the first quarter, and we continue to make very strong share gains in that second line plus indication, we continue to add sites. We continue to add countries and capacity expansion globally.And so we have very firm conviction in CARVYKTI as a $5 billion plus asset and really are rolling that out globally very effectively at this point in time. So we don't see capacity as a constraint going forward based on the strength of the efforts that have taken place. And so we're full speed ahead for CARVYKTI going forward.\nJohn Reed\nAnd with the TEC and TAL, John here, we're really just getting started. You've probably seen some of the recent data where we've even combined those two molecules to achieve really unprecedented levels of complete responses.At the hematology meetings last year, we also showed combining either TEC or TAL with DARZALEX and demonstrating really impressive 100% minimal residual disease negativity in earlier lines of therapy and the opportunity, therefore, to really start bringing these first-in-class bispecific T cell redirecting molecules into earlier lines, even frontline in combination with our DARZALEX. So really enormous opportunity lies ahead of us with TEC and TAL.\nJennifer Taubert\nAnd a couple of other things on TEC and TAL. So we continue to expand. We've got very good penetration in the academic settings right now, and we continue to expand out into the community. We've got very strong new patient starts. I know that the products have been plagued a little bit because the product is so effective with less frequent dosing.As we move forward, we should be lapping that soon. And really, you'll see the strength of those new patient starts and the continued expansion into the community we're starting to show through, combined then with what John talked about in terms of additional combinations and such, we've got very strong convictions, and we remain convinced on the opportunities for TEC and TAL.\nOperator\nMatt Miksic, Barclays.\nMatt Miksic\nGreat, thanks so much for taking the questions, and I appreciate all the color. I had a clarification and a question if I could. So the question first. Would be great if you could maybe flush out the way that the opportunities in TREMFYA, which is now kind of leaning into (inaudible) and the emerging opportunities for icotrokinra in oral kind of -- and you see them coming together this year, next year, the year after as kind of a portfolio in immuno.And then clarification, if I could, just for Tim, it sounded like when you were describing the ortho impacts, you've got something like 2%. But if you look at the hip and knee math, I'm right, let's think about 2% US, I just want to make sure I understand.It sounded like your view was that's share, that's on else, and we're going to remedy that with the innovations and new products this year. Maybe just put to spine of a point on it, but like that's not market growth, like 2%, like you would say we're below market, and we should be doing better. Or do you think that that's kind of where the market's at is in, that like low single-digit range for US SMEs. Thanks so much. Apology for a long clarification, that will be super helpful. Thanks.\nTim Schmid\nMatt, let me start with your question on ortho. And to be perfectly frank, while we have seen an improvement in our performance both in hips and knees through 2024, Q1 clearly wasn't our strongest quarter. And so we have seen competitive pressures. As you know, these are highly attractive categories within ortho, it's where the primarily fight is. And frankly we need to do better.And so we believe that our performance so far in the quarter was slightly below market. These are attractive markets. We've seen a strong robust procedures across ortho and we expect that to continue, as I mentioned, with the addition of our portfolio of both implants as well as enabling technology across hips and knees, we're confident that we will see an improvement through the remaining quarters. Thank you.\nJennifer Taubert\nRight. So let's switch over to TREMFYA in immunology, and TREMFYA really had a great quarter in the first quarter with sales nearly $1 billion and over 20% operational growth. And this was really driven by market share gains in psoriasis and psoriatic arthritis as well as what we're seeing as it relates to the launch in ulcerative colitis and also in Crohn's disease.So we are really encouraged by the launch in both of these IBD indications. TREMFYA is now if we start with ulcerative colitis and how we're doing and then I'll go to Crohn's disease. So an ulcerative colitis TREMFYA is the fastest-growing product in the ulcerative colitis market.IL-23s are the fastest-growing class, and TREMFYA has already achieved nearly a 50% share of the IL-23 new patient starts in UC. So this is really based on the strength of the profile of the product and the strong differentiation that we have as a dual-acting IL-23, both impacting both IL-23 as well as CD64.The robust data that we have as it relates to efficacy and remission. And then as we get in to Crohn's disease and then later in ulcerative colitis as well, what we see is unrivaled simplicity with the opportunity for subcu induction as well as maintenance dosing.And when we take a look at market research data and intent to prescribe, the data comes through really strong that gastroenterologists really prefer TREMFYA over the IL-23 competitors based on those aspects that I just discussed. So efficacy, sustained remission, and mucosal healing right now for UC.On Crohn's, there is very significant enthusiasm around our launch there and it's really quickly getting traction. In the first few weeks since approval in Crohn's disease, patient initiation volumes are outpacing the other IL-23 launches in the market.And the polling (inaudible), our recent market research, 82% of gastroenterologists consider TREMFYA's induction dosing and flexibility to be a very positive differentiation in their treatment decisions, and they're seeing the efficacy profile to be quite compelling compared to the other therapies that are in the market. So we believe that in IBD, both in ulcerative colitis and Crohn's, we're off to a strong start.And as a reminder, tracking back to STELARA, STELARA 75% of sales were in IBD indications. We see no reason why TREMFYA wouldn't be the same or even better based on what we're seeing with the strength and competitiveness of the profile.\nJohn Reed\nMaybe just a comment on icotrokinra since you asked about that. The most proximal opportunity there is our psoriasis campaign where we will have altogether five Phase 3 studies, data for that this year, we expect to submit this year for psoriasis.We're so excited to be able to offer patients more choice with even a market like psoriasis, which should be well penetrated by now because it is a place where some of the biologics first got their start. More than half of patients who are eligible for an advanced therapy are still not on advanced therapy.And for many of these patients, it's really an aversion to the injections and going the biologics route. So to be able to offer patients a choice of a once-a-day pill to provide a solution for their disease, which has efficacy in the same ballpark as the biologics and with that well proven safety profile of IL-23 class is really exciting for us.\nJennifer Taubert\nYeah, we really believe that icotrokinra is a big market expansion opportunity to get in those earlier lines of therapy and to bring patients into therapies that have that strong biologic like efficacy. We think that there is a lot of room for both icotrokinra and TREMFYA in the market, and based on different patient needs, different physician needs as well. And so we think both of these are very important growth drivers for us going forward.\nJessica Moore\nThank you, Matt. Kevin, we have time for one last question.\nOperator\nTim Anderson, Bank of America.\nTim Anderson\nThank you so much. Going back to tariffs, a big concern by investors is how that might ultimately wrap in transfer pricing structures? And every company I know is usually hesitant to talk about that. I'm wondering what J&J can offer up on that front that could include things like major products where you have transfer price structures in place as well as which geographies you have those in place as well.\nJoseph Wolk\nYeah, I appreciate the question, Tim. It's just not something that for competitive reasons we're going to comment on.\nJoaquin Duato\nI would reiterate what I said before. With our $55 billion investment plan and the completion of that plan, which we spoke about four years, all our advanced medicines that are used in the US will be manufactured here in the US.So that's our plan, and that's why we believe it's important to provide this continuity. As I said before, after 2017 President Trump's tax reform, the level of investments the US have increased, and we plan to continue to increase it given the current tax regime or improvements that may come into the future.\nJessica Moore\nThank you, Tim, and thanks to everyone for your questions and your continued interest in our company. We apologize to those that we couldn't get to because of time, but don't hesitate to reach out to the Investor Relations team with any remaining questions that you may have.As many of you have seen, Darren Snellgrove will be transitioning into the Investor Relations role starting May 1, as I transition into the Innovative Medicine CFO role. The last 3.5 years have been an absolute pleasure getting to engage with you all. I will now turn the call over to Joaquin for some brief closing remarks.\nJoaquin Duato\nThank you, Jess, and thank you, everyone, for joining the call today. As you heard, 2025, it's going to be a catalyst year for Johnson & Johnson. And with our Q1 results, we are off to a great start. This start reflects the power of Johnson & Johnson's uniquely diversified business model and further strengthens our confidence in our 2025 guidance and beyond. Thank you very much.\nOperator\nThank you. This concludes today Johnson & Johnson's first quarter 2025 earnings conference call. You may now disconnect.\nJohnson & Johnson  stock slipped on Tuesday, even after the company reported first-quarter earnings that surpassed expectations, and boosted its full-year sales forecast.  The company said it now expects operational sales of $92 billion, versus a prior forecast of $91.3 billion.  J&J also guided for estimated reported sales of $91.4 billion, up from a previous $89.6 billion.\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nBank of America and Citigroup post better-than-expected first-quarter earnings, a report says China ordered a halt to Boeing jet deliveries as part of the escalating trade war with the U.S., and Tesla stock rises after its chart forms a ‘death cross.’\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nHere's what is still in effect after this week's 90-day pause on \"reciprocal\" tariffs.\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nJohnson & Johnson reports strong first-quarter 2025 results, raises revenue guidance and boosts its quarterly dividends.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 07-00_Johnson & Johnson (JNJ) Q1 2025 Earnings Call Highlights_ Strong Sales Growth Amid STELARA ...",
    "date": "",
    "content": "Title: Johnson & Johnson (JNJ) Q1 2025 Earnings Call Highlights_ Strong Sales Growth Amid STELARA ...\nDate: 2025-04-16 07:00\nURL: https://finance.yahoo.com/news/johnson-johnson-jnj-q1-2025-070055505.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWorldwide Sales: $21.9 billion, increased 4.2% despite a 470 basis point headwind from STELARA.\nNet Earnings: $11 billion, with diluted earnings per share of $4.54.\nAdjusted Net Earnings: $6.7 billion, with adjusted diluted earnings per share of $2.77, up 1.9% and 2.2% respectively.\nInnovative Medicine Sales: $13.9 billion, increased 4.2% despite an 810 basis point headwind from STELARA.\nMedTech Sales: $8 billion, increased 4.1%.\nFree Cash Flow: Approximately $3.4 billion.\nDividend Increase: 4.8%, marking the 63rd consecutive year of increases.\nOperational Sales Growth Guidance: Increased by $700 million, now expected to be 3.3% to 4.3% for the full year.\nAdjusted Operational Sales Growth: 2% to 3% compared to 2024.\nInterest Income and Expense: Net income of $128 million, down from $209 million in Q1 2024.\nEffective Tax Rate: 19.3%, up from 12.4% in the same period last year.\nWarning! GuruFocus has detected 4 Warning Signs with BOM:540133.\nRelease Date: April 15, 2025\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\nJohnson & Johnson (NYSE:JNJ) delivered strong operational sales growth of 4.2% in Q1 2025, despite headwinds from STELARA's loss of exclusivity.\nThe company's Innovative Medicine sector achieved 4.2% operational sales growth, with 11 key brands growing double digits.\nMedTech sector showed 4.1% operational sales growth, driven by strong performance in cardiovascular businesses and surgical vision.\nJohnson & Johnson (NYSE:JNJ) announced a commitment to invest over $55 billion in the US over the next four years, enhancing manufacturing and R&D capabilities.\nThe company increased its dividend for the 63rd consecutive year, reflecting its commitment to returning capital to shareholders.\nSTELARA faced an approximate 810 basis points headwind due to biosimilar competition, impacting overall sales growth.\nGross margins were below recent trends, affected by the loss of exclusivity for STELARA and Part D redesign.\nThe orthopedic segment experienced a decline of 3.1%, impacted by competitive pressures and one-time events.\nTariffs, particularly those related to China, are expected to have a significant impact on costs, with a $400 million impact anticipated in 2025.\nThe company faces ongoing litigation challenges related to the Talc bankruptcy ruling, which could impact future financial performance.\nQ: Joe, you mentioned $400 million in tariffs in the 2025 guidance. What is that on an annualized basis, and how do you plan to mitigate it? A: Joseph Wolk, CFO, explained that the $400 million primarily involves MedTech tariffs, including those from Mexico, Canada, and China. The most significant impact comes from US-origin products shipped to China. Mitigation strategies are limited due to existing contractual agreements, but tax policy is seen as a more effective tool than tariffs for building US manufacturing capacity.\nQ: Can you explain the drivers behind the lower gross margins this quarter and the outlook going forward? A: Joseph Wolk, CFO, noted that the decline was due to the impact of STELARA's loss of exclusivity, Part D redesign, and unfavorable currency effects. He expects margins to improve by 100 to 150 basis points moving forward, despite the tariff impacts.\nQ: How do you see the erosion of STELARA being offset by other brands like TREMFYA? A: Jennifer Taubert, EVP, Worldwide Chairman, Innovative Medicine, stated that the impact of STELARA's loss was in line with expectations, and the business excluding STELARA grew over 12%. TREMFYA is gaining traction, especially with recent approvals in inflammatory bowel disease, and is expected to offset some of the erosion.\nQ: How recession-proof is Johnson & Johnson's business, and which areas might be most at risk? A: Joseph Wolk, CFO, mentioned that healthcare is generally more recession-proof than other industries. While elective procedures might be delayed, they are not abandoned. The company monitors job reports as an indicator of healthcare coverage and demand.\nQ: Can you provide more details on the orthopedic sales decline and the recovery outlook? A: Tim Schmid, EVP, Worldwide Chairman of MedTech, explained that the decline was due to one-time events like revenue recognition changes and fewer selling days. Despite competitive pressures, the company expects improved performance due to new product launches and commercial execution.\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\nThis article first appeared on GuruFocus.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-31_Jim Cramer_ Johnson & Johnson (JNJ) Is a “Great American Company with a AAA Balance Sheet”",
    "date": "",
    "content": "Title: Jim Cramer_ Johnson & Johnson (JNJ) Is a “Great American Company with a AAA Balance Sheet”\nDate: 2025-04-16 13:31\nURL: https://finance.yahoo.com/news/jim-cramer-johnson-johnson-jnj-133137612.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other key stocks that Jim Cramer analyzes.\nIn his latest appearance on CNBC’s Squawk on the Street, Jim Cramer reacted to the partial tariff exemptions announced by the White House, interpreting them not as a full retreat, but as a strategic pause designed to avoid punishing American companies. He suggested the administration was being careful not to hand over competitive advantages to Southeast Asian rivals, particularly Samsung:\n“So what I saw today, and not to be facetious, but what I see is people saying, you know what, we’ve seen the downside. Maybe we can test it again. But the president has, I don’t want to say blink, because that’s nonsense. What the president did was say, OK, look, we’re not going to continue to punish American companies and give the green light to Korea. I don’t know if you heard Lutnick’s words. He was very specific. Southeast Asia. That’s Samsung. They didn’t want to give the ball to Samsung.”\nREAD ALSO: Jim Cramer Hints at a Bigger Agenda Behind Tariffs and Breaks Down These 7 Stocks and Jim Cramer Reacts to the Surprise Market Surge and Highlights 8 Key Stocks.\nTurning to currency dynamics, Cramer pushed back on what he sees as misplaced panic over a weakening U.S. dollar. Instead, he argued that a softer dollar actually benefits American multinationals and gives long-needed relief to CFOs who’ve spent years blaming currency strength for lost market share:\n“Well, look, I’m not so certain I’m going to do a little contrary stuff on the dollar here. When we listen to conference calls, for the last four years, all we hear about is it would have been so much better if the dollar weren’t so strong. We keep losing share, the dollar’s too strong. Suddenly the dollar’s weaker, and now we start hearing all the downside, what, the bonds? I mean, I’m almost thinking that, I’m gonna put this out there, the people who are saying that it’s the end of the world, that the dollar is weaker, I think they have to go do some work boots on the ground. […] So suddenly the dollar’s weaker and we are petrified? These are people who have an agenda. And their agenda is to say, you know what matters more than anything else? Our hegemony from a strong dollar. And I don’t get it. If you’re in our business of picking stocks, you’re sick and tired of hearing CFOs say, we are done. We’ve got to stop this dollar rise.”\nCramer also gave his opinion about the rhetoric coming from Beijing, likening it to the Cold War-era paranoia of the 1960s and ’70s. He questioned whether a diplomatic breakthrough similar to Nixon’s historic visit to China is even possible under the current tone of U.S.-China relations:\n“But when I listen to the rhetoric from China, this is the 1968-72 rhetoric. It’s the kind of rhetoric that just says there’s never going to be a meeting. Is there a way to have a Nixon to China moment? Because as far as I’m concerned, this is just right now you’re on the verge of when I was a little boy and we kept thinking, when are they going to bomb us? I mean, that was the same rhetoric. When are they going to launch their nuclear weapons? I mean, that’s why we used to live in fear. That’s why we had cubbyholes. That’s why we used to put our heads in a cubbyhole, because the Chinese were going to bomb us if the Russians didn’t bomb us. This is the same sound.”\nTo make our list of the stocks that Jim Cramer talked about, we listed down the stocks he mentioned during CNBC’s Squawk on the Street aired on April 14th.\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA smiling baby with an array of baby care products in the foreground.\nNumber of Hedge Fund holders: 98\nDuring a discussion about the recent weakness in the U.S. dollar, Jim Cramer pointed out how multinational companies often cite currency strength as a barrier to growth. He specifically referenced Johnson & Johnson (NYSE:JNJ) as one of the companies that could benefit from a weaker dollar and did not hesitate to point out what he likes about the company. Here is what he said:\n“Because when you hear Johnson & Johnson tomorrow morning, Great American company, AAA balance sheet, always been good. All you ever hear from them, from Joe Wolk, who’s the excellent CFO he is, if it weren’t for the dollar, if it weren’t for the dollar …”\nOverall, JNJ ranks 11th on our list of key stocks that Jim Cramer analyzes. While we acknowledge the potential of JNJ as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than JNJ but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nJohnson & Johnson reports strong first-quarter 2025 results, raises revenue guidance and boosts its quarterly dividends.\nChina's latest economic data, including GDP growth and retail sales, has exceeded expectations, despite concerns about potential impacts from US tariffs.\nVisa (V) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where ServiceNow, Inc. (NYSE:NOW) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nFutures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow trading just below break-even, as investors braced for a flurry of corporate earnings. The muted open followed Monday’s tech-led rally, which briefly masked deeper market jitters tied to tariffs and macro uncertainty.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Costco (NASDAQ:COST) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing to […]\nJohnson & Johnson forecasts about $400 million in costs this year related to tariffs on medical devices, said Chief Financial Officer Joseph Wolk in an interview.  Wolk said the estimated costs represent a \"worst-case scenario\" and take into account President Trump’s 90-day pause, China's retaliatory tariffs and the resumption of the U.S. tariffs.  J&J isn't doing anything differently yet in response to tariffs, Wolk added.\nLower operating costs and a supply of high-skilled workers are helping the North Carolina region pull in billions of pharma manufacturing investments.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 14-00_ETFs in Focus Post JNJ's Q1 Earnings Beat, Dividend Hike",
    "date": "",
    "content": "Title: ETFs in Focus Post JNJ's Q1 Earnings Beat, Dividend Hike\nDate: 2025-04-16 14:00\nURL: https://finance.yahoo.com/news/etfs-focus-post-jnjs-q1-140000330.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nJohnson & Johnson JNJ reported stronger-than-expected first-quarter 2025 results. The world's biggest healthcare products maker continued with its long streak of earnings beat and also exceeded revenue estimates. It raised its revenue guidance for this year amid tariff chaos and boosted its quarterly dividends.Given the resilience of the drugmaker amid the potential tariff shifts under the Trump administration, investors should tap the company’s growth prospects through ETFs with the largest allocation to this diversified drug maker. These include iShares U.S. Pharmaceuticals ETF IHE, iShares U.S. Healthcare ETF IYH, First Trust Nasdaq Pharmaceuticals ETF FTXH, Health Care Select Sector SPDR Fund XLV and VanEck Vectors Pharmaceutical ETF PPH.JNJ’s first-quarter earnings per share came in at $2.77, which beat the Zacks Consensus Estimate of $2.57 and improved 2.2% from the year-ago earnings. Revenues grew 2.4% year over year to $21.89 billion and outpaced the Zacks Consensus Estimate of $21.62 billion (see: all the Healthcare ETFs here).Innovative Medicines sales advanced 4.2%, while sales from MedTech devices jumped 4.1%. Sales of JNJ’s top-selling blood cancer treatment, Darzalex, jumped 20% to $3.2 billion, while Xarelto generated $690 million in sales, up 33% year over year. However, sales of the blockbuster psoriasis drug Stelara declined 34% to $1.6 billion due to the launch of several biosimilar versions entering the market. Invega Sustenna sales also dropped 15% to $903 million.Johnson & Johnson raised its revenue guidance for fiscal 2025 to $91.0-$91.8 billion from $89.2-$90.0 billion, indicating year-over-year growth of 2.6%-3.6% versus the prior expectation of 0.5%-1.5%. The new guidance reflects the addition of Caplyta (lumateperone) following its $14.6 billion acquisition of Intra-Cellular Therapies. The company maintained its adjusted earnings per share guidance in the range of $10.50-$10.70 due to tariff costs, dilution from the Intra-Cellular Therapies acquisition, and updated foreign exchange. JNJ revealed tariff costs of roughly $400 million this year.The drugmaker lifted its quarterly dividend to $1.30 per share from $1.24 per share, marking the 63rd year of consecutive increases. At the new rate, the annual dividend comes to $5.20 per share compared with the previous rate of $4.96 per share.\niShares U.S. Pharmaceuticals ETF (IHE)iShares U.S. Pharmaceuticals ETF provides exposure to 37 companies that manufacture prescription or over-the-counter drugs or vaccines by tracking the Dow Jones U.S. Select Pharmaceuticals Index. Of these, Johnson and Johnson takes the top spot, accounting for a 24.5% share. iShares U.S. Pharmaceuticals ETF has $533.7 million in AUM and charges 39 bps in fees and expenses. Volume is good at about 135,000 shares a day. The fund has a Zacks ETF Rank #3 (Hold) with a High risk outlook.iShares U.S. Healthcare ETF (IYH)iShares U.S. Healthcare ETF offers exposure to 104 U.S. healthcare equipment and services, pharmaceuticals, and biotechnology companies by tracking the Russell 1000 Health Care RIC 22.5/45 Capped Gross Index. Johnson and Johnson is the third firm, accounting for 7.2% of the total assets. In terms of industrial exposure, pharma takes the top spot at 29.3%, followed by healthcare equipment (21.7%) and biotech (18.5%). iShares U.S. Healthcare ETF has amassed $3 billion in its asset base while charging 39 bps in annual fees. It trades in a good volume of around 384,000 shares a day and has a Zacks ETF Rank #3 with a Medium risk outlook (read: Recession Fears Looming? Secure Your Portfolio With These ETFs). First Trust Nasdaq Pharmaceuticals ETF (FTXH)First Trust Nasdaq Pharmaceuticals ETF offers exposure to U.S. companies within the pharmaceuticals industry and tracks the Nasdaq US Smart Pharmaceuticals Index. It holds 50 securities in its basket, with JNJ occupying the top spot at 7.8% of the assets. FTXH has a lower AUM of $13.2 million and an average daily volume of 3,000 shares. First Trust Nasdaq Pharmaceuticals ETF charges 60 bps in annual fees and has a Zacks ETF Rank #3.Health Care Select Sector SPDR Fund (XLV)Health Care Select Sector SPDR Fund is the most popular healthcare ETF and follows the Health Care Select Sector Index. It holds 60 securities in its basket, with JNJ taking the third spot at 7.4% of the assets. Pharma, healthcare providers and services, and healthcare equipment & supplies take the largest share at 29.2%, 23.7% and 22%, respectively. Health Care Select Sector SPDR Fund manages $35.4 billion in its asset base and trades in a heavy volume of around 12 million shares. The expense ratio comes in at 0.08%. It has a Zacks ETF Rank #1 (Strong Buy) with a Medium risk outlook (read: 5 Sector ETFs Set for Q1 Earnings Growth Amid Tariff Woes).VanEck Vectors Pharmaceutical ETF (PPH)VanEck Vectors Pharmaceutical ETF follows the MVIS US Listed Pharmaceutical 25 Index, which measures the performance of companies involved in pharmaceuticals, including pharmaceutical research and development as well as production, marketing and sales of pharmaceuticals. It holds 26 stocks in its basket, with Johnson and Johnson occupying the second position at 6.7% of assets. VanEck Vectors Pharmaceutical ETF has amassed $586 million in its asset base and trades in a good volume of about 330,000 shares a day. The expense ratio is 0.36%. VanEck Vectors Pharmaceutical ETF has a Zacks ETF Rank #3 with a Medium risk outlook.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nJohnson & Johnson (JNJ) : Free Stock Analysis Report\nHealth Care Select Sector SPDR ETF (XLV): ETF Research Reports\niShares U.S. Healthcare ETF (IYH): ETF Research Reports\niShares U.S. Pharmaceuticals ETF (IHE): ETF Research Reports\nVanEck Pharmaceutical ETF (PPH): ETF Research Reports\nFirst Trust NASDAQ Pharmaceuticals ETF (FTXH): ETF Research Reports\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nLegend Biotech (LEGN) witnessed a jump in share price last session on above-average trading volume. The latest trend in earnings estimate revisions for the stock suggests that there could be more strength down the road.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nIn particular, the retail-sales reading showed a big jump in big-ticket purchases.\nThese 10 stocks performed the best over the past 10 years.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-19_Is Johnson & Johnson (JNJ) the Best Dividend Monarch to Invest in Now_",
    "date": "",
    "content": "Title: Is Johnson & Johnson (JNJ) the Best Dividend Monarch to Invest in Now_\nDate: 2025-04-16 15:19\nURL: https://finance.yahoo.com/news/johnson-johnson-jnj-best-dividend-151919763.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 10 Best Dividend Monarchs to Invest in Now. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other best dividend monarchs.\nDividend-focused investors are generally well-acquainted with terms like Dividend Aristocrats and Dividend Kings, but many may not be aware of a lesser-known group called Dividend Monarchs. While they fall under the broader category of dividend growth stocks, they carry a distinct title. The Dividend Monarchs Index highlights US companies that have managed to raise their dividends consistently for at least 50 consecutive years. These firms have weathered decades of market ups and downs, showcasing both resilience and steady performance in terms of dividend growth and stock returns. As an evolution of the well-known S&P Dividend Aristocrats Index Series, the S&P Dividend Monarchs Index sets an even higher standard, recognizing a more exclusive tier of long-term dividend payers.\nS&P Dow Jones Indices has been a pioneer in dividend growth strategies since the 1980s, initially tracking US companies with at least 10 years of dividend increases. As the number of such companies grew, the threshold was raised to 25 years, forming the basis for the Dividend Aristocrats Index, launched in 2005. This index became a widely recognized benchmark, eventually expanding to include mid- and small-cap stocks as well as global markets. By April 2023, over $40 billion in ETF assets tracked these indices. With a rising number of companies now surpassing 50 consecutive years of dividend growth across different market caps, S&P introduced the Dividend Monarchs Index in 2023 to reflect this new elite group.\nThe key distinction between Dividend Kings and Dividend Monarchs lies in the inclusion criteria. While both require at least 50 consecutive years of dividend increases, Dividend Monarchs must also meet specific standards set by S&P. To qualify for the Dividend Monarchs Index, a company must be part of the Composite 1500, have a float-adjusted market capitalization of at least $2 billion, maintain a three-month average daily trading value of $5 million or more, and consistently grow its dividend over five decades. This added layer of eligibility makes Monarchs a more selective, index-based group.\nCompanies that meet the tough 50-year dividend growth requirement tend to show strong profitability and financial stability. According to an S&P Dow Jones Indices report dated April 30, 2023, the Dividend Monarchs Index outperformed both the broader market and the S&P Composite in terms of return on equity (ROE) and showed more consistent earnings. The report also noted that, based on back-tested data since January 31, 2018, the Dividend Monarchs Index displayed more defensive traits—offering lower volatility and smaller drawdowns than the S&P 500 during market declines.\nAlthough the Dividend Monarchs Index is a relatively new concept with only five years of back-tested performance, it has grown significantly during that time, expanding from 11 to 35 constituents. Despite the index’s short history, the companies included have a track record of at least 50 consecutive years of dividend growth, dating as far back as 1972. According to data presented by S&P Dow Jones Indices, the performance of these companies—measured through both price returns over the past 50 years and total returns since December 1989—has generally outpaced that of the broader market. This suggests that many of the index’s constituents have delivered stronger long-term results. Given this, we will take a look at some of the best Dividend Monarchs to invest in.\nA smiling baby with an array of baby care products in the foreground.\nFor this list, we scanned the holdings of the S&P Dividend Monarchs Index, which tracks the performance of companies with 50 consecutive years of dividend growth. From that list, we picked 10 stocks that were most popular among hedge funds, as per Insider Monkey’s Q4 2024 database. The stocks are ranked in ascending order of the hedge funds having stakes in them.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 98\nJohnson & Johnson (NYSE:JNJ) is an American healthcare company that specializes in manufacturing, developing, and selling a wide range of healthcare products and also offers related services. In the fourth quarter of 2024, the company posted a revenue of $22.5 billion, up 5.2% from the previous year and beating estimates by $84.4 million. Operational growth came in at 6.7%, with the MedTech segment seeing a 6.2% increase in global operational sales, helped by both acquisitions and divestitures.\nAlthough Johnson & Johnson (NYSE:JNJ)’s pharmaceutical segment hasn’t been impacted by current tariffs, its recent effort to resolve talc-related lawsuits through bankruptcy was turned down by a judge. As a result, the company now intends to address the lawsuits through the traditional tort system after courts found the cases don’t cause significant financial strain.\nDespite the unresolved legal issues, Johnson & Johnson (NYSE:JNJ) continues to show strong financial health and steady performance. Both its pharmaceutical and MedTech businesses remain solid, backed by reliable earnings and a productive pipeline that consistently brings new product approvals. With more than a hundred years of innovation under its belt, Johnson & Johnson appears well-positioned to keep moving forward.\nOn April 15, Johnson & Johnson (NYSE:JNJ) declared a 4.8% increase in its quarterly dividend to $1.30 per share. Through this increase, the company stretched its dividend growth streak to 63 years, which makes JNJ a Dividend Monarch to monitor. The stock’s dividend yield on April 15 came in at 3.23%.\nOverall, JNJ ranks 1st on our list of the best Dividend Monarchs to invest in. While we acknowledge the potential of JNJ as an investment, our conviction lies in the belief that some deeply undervalued dividend stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for a deeply undervalued dividend stock that is more promising than JNJ but that trades at 10 times its earnings and grows its earnings at double digit rates annually, check out our report about the dirt cheap dividend stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nFord stock yields a big 6.5% right now, but is the dividend safe?\nThe world’s biggest industrial real-estate giant said the escalating global trade war will spur demand for U.S. storage space as companies stockpile inventory close to consumers.  Prologis  said its customers, which include Amazon.com, Home Depot and FedEx, have been rushing in merchandise, rerouting shipments and taking on overflow storage space as they seek to get ahead of President Trump’s new tariffs.  Chief Executive  Hamid Moghadam,  who plans to retire Jan. 1, told The Wall Street Journal he believes Prologis is well positioned during a period of uncertainty in the broader market because the company operates warehouses across the U.S. and around the world near population centers.\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Marathon Petroleum Corporation (NYSE:MPC) stands against other best oil stocks. After an encouraging start to the year, the energy sector is once again lagging behind the […]\nArk Invest CEO Cathie Wood has offered a contrarian view on President Donald Trump‘s tariff policies, suggesting they could be the catalyst to end a three-year “rolling recession.” What Happened: In her recent note, Wood explains that tariffs, which ...\nJohnson & Johnson reports strong first-quarter 2025 results, raises revenue guidance and boosts its quarterly dividends.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nDr. Reddy's, Sandoz and Teva Pharmaceuticals have been highlighted in this Industry Outlook article.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-24_Needham upgrades Boston Scientific on easing competition, growth opportunities",
    "date": "",
    "content": "Title: Needham upgrades Boston Scientific on easing competition, growth opportunities\nDate: 2025-04-16 15:24\nURL: https://finance.yahoo.com/news/needham-upgrades-boston-scientific-easing-152436271.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nInvesting.com -- Needham upgraded Boston Scientific Corp (NYSE:BSX) to “Buy”, saying competition from pulsed field ablation (PFA) rivals looks less intense for its key product than it was earlier feared, and citing near- and long-term upside drivers in the company’s pipeline and recent acquisitions.\nThe firm pointed to a recent survey of heart specialists, which showed that Boston Scientific’s FARAPULSE system remains the preferred option for a common heart procedure called ablation.While rivals like  Medtronic  (NYSE:MDT) and Johnson & Johnson (NYSE:JNJ) have introduced competing systems, doctors surveyed expressed concerns over safety and availability. Boston Scientific’s market share in this area is expected to rise over the next year, Needham said.\nThe firm also sees renewed momentum for the company’s WATCHMAN heart implant, which is used to prevent strokes. Doctors increasingly favour using WATCHMAN during other procedures, which could boost near-term sales. Longer term, Needham expects a major clinical trial called CHAMPION-AF to potentially expand the device’s use among more patients, with results due in the first half of 2026.\nRecent acquisitions are also seen as adding to Boston Scientific’s growth story. Bolt Medical’s new device for treating artery disease recently gained U.S. approval, while SoniVie is developing a treatment for high blood pressure. Both target large markets, Needham said.\nWhile Boston Scientific shares trade at a premium to industry peers, the firm believes the stock is now more reasonably priced after a recent pullback and offers attractive long-term potential.\nRelated articles\nNeedham upgrades Boston Scientific on easing competition, growth opportunities\nMoncler beats Q1 revenue expectations on strong Asia sales, DTC push\nParkland CEO Bob Espey to step down amid pressure from Simpson Oil\nPAHC vs. BSX: Which Stock Is the Better Value Option?\nThe coffee chain is seeking to unify its brand experience.\nJohnson & Johnson’s electrophysiology unit struggled in the first quarter, as the company chases Medtronic and Boston Scientific in the red-hot pulsed field ablation market.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nThe Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage.\nRyan Breslow is officially back. While the founder of one-click checkout company Bolt re-assumed its helm as CEO in March, Breslow is unveiling Wednesday a new “superapp” that he hopes will formally mark his return as the fintech’s leader. He describes the new product as “one-click crypto and everyday payments” in a single platform, in an exclusive interview with TechCrunch. The controversial entrepreneur famously stepped down in January 2022 from the San Francisco-based company he started in 20\nIntuitive Surgical (ISRG) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe came across a bullish thesis on Napco Security Technologies, Inc. (NSSC) on Substack by Value Chaser. In this article, we will summarize the bulls’ thesis on NSSC. Napco Security Technologies, Inc. (NSSC)’s share was trading at $21.64 as of April 15th. NSSC’s trailing and forward P/E were 16.52 and 24.69 respectively according to Yahoo Finance. NAPCO […]\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-59_Big banks report Q1 beats, China stops taking Boeing deliveries_ Morning Buzz",
    "date": "",
    "content": "Title: Big banks report Q1 beats, China stops taking Boeing deliveries_ Morning Buzz\nDate: 2025-04-16 15:59\nURL: https://finance.yahoo.com/news/big-banks-report-q1-beats-155936913.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe major averages were fractionally higher near noon, adding slightly to yesterday’s gains as investors reacted to fresh headlines on U.S.-China trade tensions and a new round of corporate earnings. Markets are attempting to stabilize after a rocky stretch, but much of the tone is being shaped by President Trump’s latest tariff decisions. After last week’s escalation, he’s now backing off slightly, offering temporary relief on key consumer electronics and signaling possible concessions for the auto sector.\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities using  Tipranks' Stock Screener.\nLooking to commodities, gold shares are up marginally, still hovering above the $3,200 threshold. Meanwhile, oil prices are lower, but only fractionally.\nGet caught up quickly on the top news and calls moving stocks with these five Top Five lists.\n1. STOCK NEWS: \nBank of America (BAC) reported better-than-expected Q1 results, with the company saying it grew commercial loans in every line of business in the quarter\nCiti (C) reported upbeat Q1 earnings and revenue and provided revenue guidance for FY25\nJohnson & Johnson (JNJ) reported better-than-expected Q1 results, raised its FY25 operational sales outlook, and increased its quarterly dividend about 5%\nLowe’s (LOW) agreed to acquire Artisan Design Group for $1.325B\nChina has ordered airlines to halt further deliveries of Boeing (BA) jets, Bloomberg reports\n2. WALL STREET CALLS:\nGeneral Motors (GM) downgraded to Equal Weight from Overweight at Barclays\nHubSpot (HUBS) upgraded to Buy from Neutral at UBS\nPepsiCo (PEP) downgraded to Neutral at BofA on slower snacks growth\nNike (NKE) initiated with neutral view at Berenberg, here’s why\nBenchmark starts “dominant regional leader” MercadoLibre (MELI) with a Buy\n3. AROUND THE WEB: \nElliott Investment Management has built a large position worth more than $1.5B in HP Enterprise (HPE), Bloomberg says\nHonda (HMC) is considering plans to relocate the production of models to the U.S. from Mexico and Canada in response to an additional 25% tariff imposed by the Trump Administration, Nikkei reports\nAMD (AMD) CEO says the company plans to build more AI servers in U.S., Bloomberg says\nLVMH (LVMUY) is considering moving some of its manufacturing to the U.S. amid Donald Trump’s tariff threats, Business Insider says\nAccording to people who attended Netflix’s (NFLX) annual business review meeting last month, the company aims to reach a $1T market capitalization and double its revenue by 2030, WSJ reports\n4. MOVERS:\nRezolve AI (RZLV) increases after securing a $9.8M annual contract with Liverpool Mexico\nEos Energy (EOSE) gains after signing a MOU with Frontier Power\nRocket Pharmaceuticals (RCKT) higher after its CEO bought $101.6K of the company’s stock\nAllegro MicroSystems (ALGM) lower after On Semi (ON) withdrew its proposal to acquire the company\nApplied Digital (APLD) falls after reporting quarterly results\n5. EARNINGS/GUIDANCE:\nPNC Financial (PNC) reported Q1 results, reaffirmed its FY25 guidance, and provided its outlook for Q2\nCryo-Cell (CCEL) reported Q1 results, with EPS lower year-over-year\n908 Devices (MASS) reported preliminary Q1 results\nAlbertsons (ACI) reported Q4 results, with CEO Vivek Sankaran commenting on the “solid results in the fourth quarter”\nWaFd (WAFD) reported Q1 results, with EPS beating consensus\nINDEXES: \nNear midday, the Dow was up 0.16%, or 66.31, to 40,591.10, the Nasdaq was up 0.26%, or 43.91, to 16,875.40, and the S&P 500 was up 0.29%, or 15.74, to 5,421.71.\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee today’s best-performing stocks on TipRanks >>\nRead More on GM:\nDisclaimer & DisclosureReport an Issue\nTrump Trade: Carmakers may see tariff relief, China halts Boeing deliveries\nNike initiated, GM downgraded: Wall Street’s top analyst calls\nWedbush says auto tariffs potential delay ‘good news for Detroit Big 3, Tesla’\nWhat to Know About Jeff Bezos’ Secret EV Startup Slate Auto\nToyota Stock Surges as Trump Floats Tariff Reprieve\nSays saw ‘continued momentum’ in each of five businesses. Says securities services gained share. Says Markets had a ‘good quarter’. Says Equities revenues up 23% y/y. Says M&A revenue nearly doubled. Says USPB was up 2%. Says portfolio continued to perform in line with expectations. Says Transformation investments continue to modernize infrastructure. Says integrating AI directly into business operations. Says ‘confident in ability to continuing delivering, despite uncertainty of the moment’. Sa\nWe recently published a list of Top 5 AI News Moving The Market Today. In this article, we are going to take a look at where Applied Digital Corporation (NASDAQ:APLD) stands against other top AI news moving the market today. Investors continue to pour back into Big Tech stocks after the US government announced temporary […]\nAfter China reportedly decided that it would no longer accept deliveries of Boeing’s (BA) planes, prominent investor Stephanie Link yesterday said that the news was “clearly not material for Boeing at this time.” Link, who owns BA stock and has called the name her top pick for 2025, is the Chief Investment Strategist of Hightower […]\nFor investors, top mobile payment companies like AFRM, FI, MELI and PAY offer attractive opportunities thanks to their strong focus on innovation and ongoing market expansion.\nHMC refutes reports that state that the automaker plans to shift vehicle production from Canada and Mexico to the United States due to potential heavy tariffs.\nChina has suspended exports of a wide range of critical minerals and magnets as part of China’s retaliation for President Trump’s sharp increase in tariffs that started on April 2, the New York Times’ Keith Bradsher reported. On April 4, the Chinese government ordered restrictions on the export of six heavy rare earth metals, which are refined entirely in China, as well as rare earth magnets, 90% of which are produced in China, the report noted. Shares of MP Materials (MP) had been higher in ear\nWhat to expect from Netflix's first-quarter earnings and how will results impact Wall Street sentiment?\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-28_J&J’s electrophysiology sales dip amid slow Varipulse start",
    "date": "",
    "content": "Title: J&J’s electrophysiology sales dip amid slow Varipulse start\nDate: 2025-04-16 16:28\nURL: https://www.medtechdive.com/news/jnjs-electrophysiology-varipulse-sales-q1/745484/?.tsrc=rss\nContent:\nLet MedTech Dive’s free newsletter keep you informed, straight from your inbox.\n                    \n                \n            \n\nJohnson & Johnson’s electrophysiology unit struggled in the first quarter, as the company chases Medtronic and Boston Scientific in the red-hot pulsed field ablation market.\nJohnson & Johnson failed to capitalize on the pulsed field ablation wave in the first quarter of 2025, despite recently launching its Varipulse device in the U.S.\nThe healthcare giant on Tuesday reported strong growth for its cardiovascular portfolio — largely due to its recent M&A spree in the space — but electrophysiology sales fell year over year by nearly 2%. Electrophysiology was the only cardiovascular group to decline in the quarter, as sales for the segment overall grew by more than 16% to $2.1 billion.\nThe decline, which J&J attributed to competition, contrasts with rivals’ early reports: Medtronic touted strong adoption of its PFA device early in its launch, and Boston Scientific’s electrophysiology sales skyrocketed by 138% last year to nearly $2 billion, posting triple-digit growth as early as the second quarter.\nPFA systems use non-thermal energy to affect heart tissue that causes atrial fibrillation, or an irregular heartbeat. Devices have only been on the market for a short time, but they are already eating up cryoablation and radiofrequency ablation procedures.\nTruist Securities analysts, in a Tuesday note, wrote that J&J missed Wall Street’s sales estimates for electrophysiology by about $50 million, with a miss of about $9 million in the U.S. They added that J&J’s struggles are likely to benefit Boston Scientific and Medtronic given their “sustained head starts in PFA.”\nJ&J received FDA approval for its Varipulse PFA device in November, trailing Boston Scientific and Medtronic to the market by almost one year. The company paused U.S. cases of Varipulse in January for roughly five weeks and worked with the FDA due to safety concerns. At the time of the pause, Wall Street analysts cautioned that it could discourage physicians from using the device, because rival systems had not been connected to patient safety issues.\nIn February, RBC Capital Markets analysts said that physicians’ enthusiasm for Varipulse may have been affected by the company’s decision to stop U.S. cases, writing that J&J would have “to take meaningful steps to educate healthcare professionals.” They wrote that the company should still “be able to drive Varipulse adoption.”\nJ.P. Morgan analysts, in a note after Tuesday’s earnings call, echoed the concerns RBC discussed a few months ago.\nKeep up with the story. Subscribe to the MedTech Dive free daily newsletter\n“While [U.S.] Varipulse cases resumed in the quarter, we continue to expect the [O.U.S. and U.S.] challenges that Varipulse has had to potentially have a lasting negative impact on physician perception of the safety of the catheter,” the analysts wrote, “especially in light of the several safe alternatives now on the market.”\nDespite the early success of Medtronic and Boston Scientific, the J.P. Morgan analysts wrote that J&J’s electrophysiology weakness in the quarter was expected.\nOverall, medtech brought in sales of $8.02 billion, representing a 2.5% increase year over year.\nGet the free daily newsletter read by industry experts\nFrom vulnerable medical devices to a breach that took some of Henry Schein’s systems offline, cybersecurity was a key topic for the industry this year.\nMatt Rourke/AP\nThe EPA is expected to finalize new regulations in March that would limit ethylene oxide emissions from companies that sterilize medical devices.\nSubscribe to MedTech Dive for top news, trends & analysis\nGet the free daily newsletter read by industry experts\nFrom vulnerable medical devices to a breach that took some of Henry Schein’s systems offline, cybersecurity was a key topic for the industry this year.\nMatt Rourke/AP\nThe EPA is expected to finalize new regulations in March that would limit ethylene oxide emissions from companies that sterilize medical devices.\nThe free newsletter covering the top industry headlines"
  }
]