[
  {
    "title": "2025-04-15 17-35_Big Banks Show Consumers Remained Resilient Heading Into Tariff Turmoil",
    "date": "",
    "content": "Title: Big Banks Show Consumers Remained Resilient Heading Into Tariff Turmoil\nDate: 2025-04-15 17:35\nURL: https://finance.yahoo.com/m/afc3e2e9-274d-3732-83d5-ec0b1075510f/big-banks-show-consumers.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBank of America and Citigroup said consumer spending ticked higher in the first quarter, when concerns about the economy began to bubble up.\nCompare the return on your investments versus your student loan interest rate.\nBAC's Q1 earnings gain from solid equity trading income, higher NII and decent advisory and debt underwriting performance amid higher provisions and expenses.\nBank of America Chief Financial Officer Alistair Borthwick said on a call with reporters Tuesday that the bank wasn't forecasting a recession.  Borthwick said clients are “looking for clarification” on the U.S. tax proposals, regulatory changes, and trade policy.  Views across Wall Street and in Washington diverge on whether the U.S. will slide into an economic recession.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nCiti plans to spend more in 2025 than it did last year on fixing long-running risk, data, and compliance deficiencies, as it carries out a yearslong turnaround plan that it refers to as its “transformation.”  Citi CFO Mark Mason said on a call with reporters that the firm is working to move away from manual activity and automate parts of its risk management processes and compliance programs.  Citi is prioritizing its efforts to try and change that.\nCitigroup (C) delivered earnings and revenue surprises of 6.52% and 1.95%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nThe headline numbers for Bank of America (BAC) give insight into how the company performed in the quarter ended March 2025, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals.\nWhile the top- and bottom-line numbers for Johnson & Johnson (JNJ) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nChina is going after Boeing, America’s biggest exporter, in its trade war with the U.S.  Beijing has told Chinese airlines not to place new orders for Boeing jets and is requiring carriers to seek approval before taking delivery of aircraft they have already ordered, according to people with knowledge of the Chinese regulator’s guidance.  Bloomberg reported earlier that China is halting Boeing jet deliveries.\nJohnson & Johnson stock fell alongside the broader market, despite beating first-quarter calls and hiking its 2025 sales guidance.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 17-52_Merrill Lynch, BofA Private Bank Post Flat First-Quarter Profit While Assets, Clients Increase",
    "date": "",
    "content": "Title: Merrill Lynch, BofA Private Bank Post Flat First-Quarter Profit While Assets, Clients Increase\nDate: 2025-04-15 17:52\nURL: https://finance.yahoo.com/m/44e87694-b98c-3a30-8fb7-073812865800/merrill-lynch%2C-bofa-private.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company. BofA’s wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024. The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nWall Street is raking in even more money from trading than it did during the market’s Covid-19 era swings.  Goldman Sachs, JPMorgan Chase and Morgan Stanley all said a surge in trading revenue helped lift their profits last quarter and beat expectations.\nA Texas judge on Tuesday threw out a federal rule that would have capped credit card late fees after officials with President Donald Trump's administration and a coalition of major banking groups agreed that the rule was illegal.  The ruling by U.S. District Judge Mark Pittman in Fort Worth came a day after the Consumer Financial Protection Bureau and a collection of major industry groups that had filed a lawsuit last year to stop the rule announced they had come to an agreement to throw out the rule.  The groups that sued included the American Bankers Association, the Consumer Bankers Association, and the U.S. Chamber of Commerce.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nBank of America and Citigroup said consumer spending ticked higher in the first quarter, when concerns about the economy began to bubble up.\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 19-01_Bank of America (BAC) Will Be ‘The Usual Fine Self’ – Jim Cramer Expects Steady Results",
    "date": "",
    "content": "Title: Bank of America (BAC) Will Be ‘The Usual Fine Self’ – Jim Cramer Expects Steady Results\nDate: 2025-04-15 19:01\nURL: https://finance.yahoo.com/news/bank-america-bac-usual-fine-190126820.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses.\nOn Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing to earnings reports from major banks.\n“Rumor, innuendo, intrigue these are the stuff of great novels, of fabulous miniseries, riveting plays, and now they’re the stuff of the stock market.”\nREAD ALSO: Jim Cramer Discussed These 12 Stocks and 10 Stocks on Jim Cramer’s Radar Recently.\nHe noted the chaotic nature of the current environment and remarked that “this tape has it all,” and emphasized how unpredictable developments from the White House have added to the turbulence. Cramer noted that information is being released constantly, through press conferences, posts on Truth Social, or casual remarks, and that each has the potential to move vast sums of money across asset classes.\n“Trillions of dollars in and out of bonds, of currency, of gold, of crypto,” he said, all based on impulsive statements. He pointed out the sheer volume of contradictions in the news cycle and stressed, “Except this isn’t an eight-part blockbuster, it’s our money.” Cramer lamented how even social media activity, like tweets, can trigger massive swings in the markets. He noted that Friday’s market action felt like it was shaped entirely by this dynamic.\nCramer questioned whether the market might be in the process of forming what he called a “liberation day bottom,” a moment when selling pressure finally ends because investors feel that all the bad news is out. But he acknowledged the uncertainty of that theory as he said, “Not sure, I’m just not sure.” He added:\n“Have you ever noticed the weekends don’t provide relaxation anymore because the president’s got advisors? He’s got to put people out. He wants to tweet. He’s got meetings. No relaxation time, no downtime…. Monday’s trading, well, let’s just say that it looks like that it’s earning season so it’s gonna be even harder than usual.”\nFor this article, we compiled a list of 15 stocks that were discussed by Jim Cramer during the episode of Mad Money aired on April 11. We listed the stocks in the order that Cramer mentioned them. We also provided hedge fund sentiment for each stock as of the fourth quarter of 2024, which was taken from Insider Monkey’s database of over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 113\nCommenting on Bank of America Corporation (NYSE:BAC) during the episode, Cramer said:\n“Tuesday, we hear from two more big banks and by this time, I gotta tell you, when we see the numbers from Bank of America and Citigroup, our eyes are going to glaze over. They shouldn’t but they will. I think that Bank of America will be the usual fine self and Citigroup’s gotten so loved that it’s probably going to roar no matter what is said, such is the admiration for CEO Jane Fraser and she certainly earned it.”\nBank of America (NYSE:BAC) is a long-standing financial institution. It offers services such as savings accounts, checking accounts, loans, investment management, and wealth planning. Hardman Johnston Global Equity Strategy stated the following regarding Bank of America Corporation (NYSE:BAC) in its Q4 2024 investor letter:\n“Bank of America Corporation (NYSE:BAC) is the second largest bank in the developed world and operates the third largest branch network in the US. With 86% of revenues coming from the US, the bank is a clear beneficiary of the lower regulatory environment expected from the incoming administration. The company’s business is highly diversified across retail, commercial, wealth management, and investment banking, with significant scale across all verticals. Management believes there is a big opportunity going forward in growing and monetizing its mass retail client base. Wealth is another huge opportunity, with the Merrill Lynch platform enabling customers to make more transactions and purchase additional products. Lastly, Bank of America has an opportunity to increase efficiency through cost reduction and online banking. Our expectation is for the bank’s ROE to move significantly higher, driving EPS growth and higher multiples.”\nOverall, BAC ranks 3rd on our list of stocks that Jim Cramer discusses. While we acknowledge the potential of BAC as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than BAC but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nWe recently published a list of 10 AI Stocks to Watch Amid Market Volatility. In this article, we are going to take a look at where Apple Inc. (NASDAQ:AAPL) stands against other AI stocks to watch amid market volatility. The uncertain macroeconomic environment is diminishing investors’ readiness to pay high prices for stocks related to […]\nBAC's Q1 earnings gain from solid equity trading income, higher NII and decent advisory and debt underwriting performance amid higher provisions and expenses.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the […]\nStocks showed weakness Tuesday with the major indexes closing lower. But a recent IPO name climbed for a third straight day.\nBank of America and Citigroup said consumer spending ticked higher in the first quarter, when concerns about the economy began to bubble up.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 19-36_Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos",
    "date": "",
    "content": "Title: Bank of America, Citi Stocks Rally; Wall Street Profits From Tariff Chaos\nDate: 2025-04-15 19:36\nURL: https://finance.yahoo.com/m/a9ad62b3-cd3f-3aac-b08e-6d11e27b2882/bank-of-america%2C-citi-stocks.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWall Street is raking in even more money from trading than it did during the market’s Covid-19 era swings. Goldman Sachs, JPMorgan Chase and Morgan Stanley all said a surge in trading revenue helped lift their profits last quarter and beat expectations.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nNew tariffs, primarily on medical technology products, are projected to add $400 million in costs this year, Chief Financial Officer Joseph Wolk said.\nBank of America (BAC) delivered earnings and revenue surprises of 11.11% and 1.89%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nCitigroup shares rose in early trading Tuesday after the bank reported better-than-expected first-quarter results as volatile markets boosted equities trading.\nC's first-quarter 2025 results benefit from a rise in NII and a fall in expenses. Rising loans and deposits balance acts as another positive.\nWall Street’s biggest banks reaped almost $37bn in trading revenues in the first quarter of the year — their best performance in more than a...\nJohnson & Johnson is holding its earnings outlook steady despite President Donald Trump signaling he could put tariffs on the pharmaceutical industry. The administration announced earlier it would conduct an investigation into drug imports. That move is widely seen as a first step toward imposing new levies. Earnings and revenue both beat estimates for the quarter. Johnson & Johnson CFO Joe Wolk joined Bloomberg Open Interest to talk about how tariffs could hit the industry and the drug maker's bottom line.\nCiti and Bank of America posted first-quarter net interest income of $14 billion and $14.4 billion, respectively.  Wall Street expected $14.49 billion of NII for the quarter at BofA, according to data compiled by FactSet, and $13.56 billion at Citi.  BofA said in January that it expected to drive between $14.5 billion and $14.6 billion of net interest income on a fully taxable equivalent basis for the first quarter.\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-10_Stock Market Today_ Dow Jones, S&P 500 Close Lower; But This Recent IPO Name Bolts Higher For 3rd St",
    "date": "",
    "content": "Title: Stock Market Today_ Dow Jones, S&P 500 Close Lower; But This Recent IPO Name Bolts Higher For 3rd St\nDate: 2025-04-15 20:10\nURL: https://finance.yahoo.com/m/05dbfc24-c26d-3a9b-8683-7997581c6245/stock-market-today%3A-dow.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nStocks showed weakness Tuesday with the major indexes closing lower. But a recent IPO name climbed for a third straight day.\nDow Jones restaurant giant McDonald's, along with Netflix stock and MercadoLibre, are among the best stocks to watch Tuesday.\nStocks continued to slide heading into the final hour of trading. The Dow dropped 890 points, or 2.2.% The S&P 500 fell 3.1%. Thee Nasdaq Composite slid 4.4%. Wall Street was already selling tech stocks after Nvidia disclosed sales of its H20 AI accelerators to China will require a license from the U.\nBank of America and Citigroup said consumer spending ticked higher in the first quarter, when concerns about the economy began to bubble up.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, […]\nWe recently published a list of 12 Best Gambling Stocks to Buy According to Analysts. In this article, we are going to take a look at where DraftKings Inc. (NASDAQ:DKNG) stands against other best gambling stocks to buy according to analysts. Gambling stocks include companies that own, run, or manage lawful gambling activities and events […]\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-15_Stocks Halt Rally Amid Lingering Trade-War Risks_ Markets Wrap",
    "date": "",
    "content": "Title: Stocks Halt Rally Amid Lingering Trade-War Risks_ Markets Wrap\nDate: 2025-04-15 20:15\nURL: https://finance.yahoo.com/news/stocks-rise-led-japan-auto-040211765.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Stocks whipsawed as President Donald Trump’s fast-evolving tariff war with top trade partners showed little signs of abating, leaving investors unwilling to take on too much risk after a two-day rally.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nEven Oslo Has an Air Quality Problem\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\n$15 Million Fund Bets Leadership Training Can Improve Chicago Policing\nThat’s even as results from Wall Street’s financial heavyweights underscored an equity-trading boon and still-healthy consumers and businesses. After climbing almost 1%, the S&P 500 finished lower. In late hours, United Airlines Holdings Inc. stood by its full-year profit outlook, but warned a “recessionary” scenario would erode demand and dramatically lower earnings.\nSubscribe to the Stock Movers Podcast on Apple, Spotify and other Podcast Platforms.\nBonds rose as a Treasury official said a rule change was under consideration that could lower trading costs for banks. The dollar snapped a five-day slide.\nTrump called on China to reach out to him to kick off negotiations, indicating no end in sight to fight that has seen both sides raise trade barriers. The Asian nation ordered airlines not to take further deliveries of Boeing Co. jets, according to people familiar with the matter. Meantime, the European Union and US made scant progress bridging trade differences.\n“We would advise investors to avoid making hard and fast assumptions about how tariff developments will ultimately play out in the economy and on corporate profits,” said Anthony Saglimbene at Ameriprise. “Instead, we suggest investors prepare for a range of possible intermediate-term outcomes that include slow-to-positive economic and profit growth, and scenarios of slow-to-negative growth.”\nHigh uncertainty surrounding US trade policy and a spike in financial-market volatility has unsettled global investors over the past few weeks. Sentiment regarding economic prospects is the most negative in three decades, yet fund managers’ pessimism isn’t fully reflected in their asset allocation which could mean more losses for US stocks, a Bank of America Corp. survey shows.\nFund managers are “max bearish on macro, not quite max bearish on the market,” strategists led by Michael Hartnett wrote in a note. “Peak fear” is not yet reflected in cash allocations, they added.\nSome of the main moves in markets:\nStocks\nThe S&P 500 fell 0.2% as of 4 p.m. New York time\nThe Nasdaq 100 rose 0.2%\nThe Dow Jones Industrial Average fell 0.4%\nThe MSCI World Index rose 0.1%\nBloomberg Magnificent 7 Total Return Index fell 0.6%\nThe Russell 2000 Index rose 0.1%\nKBW Bank Index rose 1.2%\nCurrencies\nThe Bloomberg Dollar Spot Index rose 0.3%\nThe euro fell 0.6% to $1.1284\nThe British pound rose 0.3% to $1.3228\nThe Japanese yen was little changed at 143.16 per dollar\nCryptocurrencies\nBitcoin fell 1% to $83,970.85\nEther fell 1.6% to $1,608.22\nBonds\nThe yield on 10-year Treasuries declined four basis points to 4.33%\nGermany’s 10-year yield advanced two basis points to 2.53%\nBritain’s 10-year yield declined one basis point to 4.65%\nCommodities\nWest Texas Intermediate crude was little changed\nSpot gold rose 0.7% to $3,232.61 an ounce\n--With assistance from John Viljoen, Julien Ponthus and Anand Krishnamoorthy.\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nThe Beauty Salon Recession Indicator\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nTrade Tensions With China Clear Path for Salt-Powered Batteries\n©2025 Bloomberg L.P.\n(Bloomberg) -- Republicans in the White House, Senate and House are drafting analyses on how best to craft a new tax bracket for the wealthiest Americans, work that signals the GOP under President Donald Trump is seriously considering ideas to raise taxes on the rich.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Trai\nU.S.-traded shares of Ericsson jumped Tuesday after the Swedish telecommunications firm reported first-quarter profit that topped analysts’ expectations.\nAfter electronics, the administrative windfall is now shifting to autos. Trump hinted at offering some short-term tariff relief to automakers to give them time to develop a future roadmap.\n\"If Treasuries hit a certain level or if the Federal Reserve believed that a foreign — I won't call them an adversary — but a foreign rival were weaponizing the U.S. government bond market or attempting to destabilize it for political gain, I am sure that we would do something in conjunction with each other, but we just haven't seen that,\" Bessent said.  \"We have a big tool kit.\"\nWhat do I need to file my tax return?  If you run out of time to file your tax return, you can file for an extension to take more time by using your preferred tax software, with the IRS Free File tool, or via mail.\nPalantir shares jumped nearly 5% Monday to extend last week’s recovery following news that NATO had acquired the analytics software provider’s AI-enabled military system. Monitor these key levels on the weekly chart.\nNEW YORK (Reuters) -Citigroup beat Wall Street estimates for first-quarter profit on Tuesday and moved closer to its profitability target as its traders reaped a windfall from volatile markets that fueled client activity.  The third-largest U.S. lender's earnings echoed those of Wall Street rivals, including JPMorgan Chase, Bank of America, and Morgan Stanley, whose results were also lifted by stronger equities trading.  While industry profits rose, executives warned that U.S. tariff policies cast a shadow over the economic outlook.\nTOKYO/OTTAWA (Reuters) -Honda said it has no plans to move car production from Canada and Mexico to the U.S., responding to a report that it might move operations in an effort to avoid potentially devastating tariffs.  \"No changes are being considered at this time,\" Honda Canada said in an emailed statement.  \"Honda has not made any production decisions that affect operations in Mexico, nor are any currently being considered,\" Honda Mexico said in an emailed statement.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 20-44_Stocks fizzle after two-day rally driven by bank earnings and tech",
    "date": "",
    "content": "Title: Stocks fizzle after two-day rally driven by bank earnings and tech\nDate: 2025-04-15 20:44\nURL: https://finance.yahoo.com/news/wall-street-banks-cashing-trade-123249767.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nStocks closed lower Tuesday, snapping a two-day rally as investor jitters returned to the fore.\nThe S&P 500 slipped 0.22%, the Dow fell 0.36%, and the Nasdaq edged down 0.05%. Despite recent gains, all three major indices remain well below their pre-April 2 levels, when President Trump’s “Liberation Day” tariff announcements first rattled markets.\nRead more: Wall Street banks are cashing in on trade war chaos.\nAuto stocks fell despite fresh rumors of a possible reprieve on tariffs. Ford, GM, and Rivian each ended the day lower, following a new forecast from S&P Global Ratings (SPGI) projecting a 700,000-unit drop in annual U.S. car sales if tariffs move ahead. “Affordability challenges and elevated interest rates are already pressuring demand,” analysts wrote. “Tariffs would only exacerbate those headwinds.”\nTech and financial names led the upside among individual stocks. Palantir surged more than 6% following news that NATO finalized its purchase of the company’s AI-powered Maven Smart System. Hewlett Packard Enterprise jumped 5% amid ongoing activist investor pressure, and Netflix (NFLX) added nearly 5%. Bank of America and Citigroup also posted solid gains after beating first-quarter earnings expectations, fueled by strong trading revenue and consumer banking results.\nInvestors are now looking ahead to fresh earnings from United Airlines (UAL) and The Trade Desk (TTD), both due after the bell, and to a Wednesday slate that includes Abbott Labs (ABT) and U.S. Bancorp (USB)—reports that should offer further insight into consumer health and the state of regional lending.\nStocks opened higher Tuesday, with tech and bank names leading the charge as investors welcomed a morning packed with strong earnings and fresh deal buzz. Big banks were in rally mode: Citigroup, Bank of America, and Goldman Sachs all ticked higher after posting better-than-expected results, fueled by strong trading revenues.\nPalantir Technologies jumped 4% after NATO finalized its purchase of the company’s AI-powered Maven Smart System — another boost for the defense-tech darling after Monday’s rally. Apple also edged higher, extending its 2% gain from Monday, which followed a surprise tariff exemption from the Trump administration.\nMeanwhile, Hewlett Packard Enterprise (HPE) caught a wave of investor enthusiasm after activist firm Elliott Investment Management revealed a $1.5 billion stake and backed the company’s newly announced strategic review. The broader market got a lift as chipmakers, software stocks, and AI plays rode the wave, with early signs pointing to a tech-led session and plenty of earnings drama still to come.\nAuto stocks gave back some of Monday’s gains, with Rivian (RIVN), Ford, and GM trading lower despite President Trump floating a potential delay in auto tariffs. “A US car with all US parts made in the US is a fictional tale,” analysts at Wedbush wrote, warning that the proposed tariffs — if not paused — could send the industry into “upside down mode” and trigger widespread supply-chain disruption.\nU.S. stock futures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow Jones Industrial Average trading just below the break-even line as investors braced for a flurry of corporate earnings.\nThe subdued start followed a tech-driven rally on Monday, a temporary lift amid lingering concerns around tariffs and broader economic uncertainty.\nGoldman Sachs (GS) kicked off the week’s earnings slate with a profit jump, even as CEO David Solomon warned of a “markedly different” environment in the current quarter. Echoing Solomon’s sentiments, in March, hedge funds unloaded global stocks at the fastest pace in over a decade — a sign that institutional investors may be growing more cautious as economic uncertainty deepens.\nTuesday’s earnings lineup includes Bank of America (BAC), Citigroup (C), Johnson & Johnson (JNJ), and Rent the Runway (RENT) before the bell, offering a pulse check across finance, healthcare, and consumer spending.\nBank of America beat expectations in the first quarter, with EPS of $0.90 on $27.37 billion in revenue, lifted by a strong showing in its trading division. Like Goldman Sachs, the bank benefited from market volatility, which juiced results even as the broader economic outlook remains uncertain.\nLooking to Bank of America’s consumer banking division, revenue rose 3% to $10.5 billion, with combined credit and debit card spend hitting $228 billion — up 4% from a year ago. The bank added about 250,000 new consumer checking accounts, marking its 25th straight quarter of growth, and saw 4 billion digital logins, with 65% of sales now digitally enabled.\nStill, CEO Brian Moynihan struck a cautious tone, noting that “we potentially face a changing economy in the future.”\nCitigroup posted first-quarter 2025 net income of $4.1 billion, or $1.96 per share, on $21.6 billion in revenue — a 3% increase from a year ago. Growth was broad-based across all five core businesses, with standout performances in the markets and wealth divisions.\nU.S. personal banking revenue rose 2% to $5.2 billion, powered by gains in branded cards and retail banking, though partially offset by a drop in retail services. Net interest income climbed 6%, fueled by loan growth in branded cards and wider deposit spreads in its retail banking.\nJohnson & Johnson beat Wall Street expectations in the first quarter, reporting adjusted earnings per share of $2.77 on revenue of $21.89 billion. Sales of cancer drug Darzalex jumped 20% year over year to $3.24 billion, helping drive 4.2% growth in the company’s “innovative medicine” segment.\nThe healthcare giant raised its full-year revenue guidance to between $91.6 billion and $92.4 billion, reflecting the impact of its Intra-Cellular Therapies acquisition and the addition of Caplyta, a treatment for bipolar depression. However, adjusted EPS guidance held steady at $10.50 to $10.70 as the company factors in tariffs, deal-related costs, and currency headwinds.\nJ&J also moved to reverse $7 billion previously set aside for talc-related legal settlements, after courts rejected its bankruptcy-based strategy for resolving lawsuits over its discontinued baby powder. The company maintains the claims are without merit and says it will defend them in state courts.\nDuring a television appearance on Monday, former Treasury Secretary Janet Yellen warned that Trump’s economic strategy is eroding global trust in U.S. financial assets, with volatility in Treasury yields reflecting broad investor unease.\nTreasury yields continued to climb on Tuesday, with the 10-year yield reaching 4.43%, as investors reacted to ongoing trade tensions and concerns over inflation. The bond market’s volatility has raised questions about the long-term stability of U.S. financial assets.\nBoth the Dow and the S&P 500 added about 0.8% on Monday, while the Nasdaq climbed about 0.6%. All three indexes briefly slipped into the red before rebounding, buoyed by tech stocks after the Trump administration issued a surprise tariff exemption. Apple (AAPL) stock gained more than 2% on Monday, while Palantir Technologies (PLTR) surged almost 5% following news that NATO had finalized its Maven Smart System purchase.\nAuto stocks also rallied Monday after President Donald Trump suggested his administration may offer tariff relief for automakers moving parts production. General Motors (GM) and Ford (F) each rose more than 3%, though no specifics were provided.\nFor the latest news, Facebook, Twitter and Instagram.\nBank stocks were on track for their largest increase in a week after Citi and Bank of America each reported first-quarter earnings that topped analysts’ expectations. On Tuesday the SPDR S&P Bank ETF rose 2.\nUS benchmark equity indexes were little changed intraday as companies continued to report financial\nJohnson & Johnson reports strong first-quarter 2025 results, raises revenue guidance and boosts its quarterly dividends.\nOmnicom (OMC) delivered earnings and revenue surprises of 4.29% and 0.15%, respectively, for the quarter ended March 2025. Do the numbers hold clues to what lies ahead for the stock?\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Johnson & Johnson (NYSE:JNJ) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially […]\nWhile the top- and bottom-line numbers for Omnicom (OMC) give a sense of how the business performed in the quarter ended March 2025, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nHealth care giant Johnson & Johnson expects about $400 million in tariff-related costs this year.  The costs will be felt primarily within the company's medical technology unit, which makes a range of medical devices and surgical products.  The most substantial impact comes from tariffs against China and retaliatory tariffs from China, said Joseph Wolk, Johnson & Johnson's chief financial officer, in a conference call with analysts following the company's latest earnings results.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nFutures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow trading just below break-even, as investors braced for a flurry of corporate earnings. The muted open followed Monday’s tech-led rally, which briefly masked deeper market jitters tied to tariffs and macro uncertainty.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 21-05_Goldman, Wells Fargo Lead $17 Billion Bank Borrowing Spree",
    "date": "",
    "content": "Title: Goldman, Wells Fargo Lead $17 Billion Bank Borrowing Spree\nDate: 2025-04-15 21:05\nURL: https://finance.yahoo.com/news/goldman-wells-fargo-lead-17-210503053.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Goldman Sachs Group Inc. and Wells Fargo & Co. sold a combined $14 billion of US investment-grade bonds Tuesday, matching the day-earlier total from peers Morgan Stanley and JPMorgan Chase & Co.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\n$15 Million Fund Bets Leadership Training Can Improve Chicago Policing\nWells Fargo is issuing $8 billion of bonds in four parts, while Goldman sold $6 billion in three parts, according to people with knowledge of the matter. The market’s third borrower Tuesday, Japanese financial firm Mitsubishi UFJ Financial Group Inc., priced $3 billion of notes.\nThe longest portion of Wells’ offering, an 11-year security, yields 1.28 percentage point above Treasuries, said one of the people, who asked not to be identified as the details are private. Goldman’s longest portion, a six-year tranche, yields 1.25 percentage point above Treasuries, a separate person said.\nMorgan Stanley, JPMorgan Lead $16.5 Billion Bank Borrowing Spree\nIt’s common for the biggest US banks to sell debt shortly after releasing quarterly results. But there were some questions this go-around after the primary market froze earlier this month in the wake of an evolving global trade war.\nTuesday’s deals received orders 3.3 times the amount of bonds sold, according to Bloomberg’s Brian Smith, compared with 3.8 times on Monday.\n“Clearly there’s appetite for sizable bank issuances,” said Peter Simon, an analyst who covers the sector at research firm CreditSights. “We don’t see much evidence that the market is overly concerned with these banks, which makes sense given their results have been solid this quarter.”\nGoldman reported record revenue in the first quarter, while Wells Fargo’s report pointed to soft loan demand amid the ongoing tariff uncertainty. Wells’ net interest income, the difference between what it makes from lending and pays for deposits, fell short of analysts’ projections. Still, non-interest expenses were better than forecast as Chief Executive Officer Charlie Scharf works to cut costs.\nIn the high-grade market, banks have underperformed in recent weeks, with TD Securities credit strategist Hans Mikkelsen writing that was likely due to expectations of new debt sales. The average bank bond spread widened 24 basis points this month through Monday, more than investment-grade notes overall while yields for the latter briefly hit 11-month highs last week.\nThat has lured yield buyers into the market, setting things up well to digest the banks’ debt sales, said Samuel Wilson, a portfolio manager at Voya Investment Management.\nBank of America Corp. and Citigroup Inc. are candidates to issue debt after they released first-quarter results Tuesday.\nComing into earnings season, JPMorgan strategists Kabir Caprihan and Vincent Barretta predicted the six big US banks could might issue about $32 billion of bonds. That compares with an average $23 billion this time each year from 2014 through 2024. The four deals completed so far have raised $28 billion.\n(Updates throughout.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nThe Beauty Salon Recession Indicator\nTrump Is Firing the Wrong People, on Purpose\nTrade Tensions With China Clear Path for Salt-Powered Batteries\n©2025 Bloomberg L.P.\nApple, NVIDIA, Advanced Micro Devices, Amazon.com and Alphabet are included in this Analyst Blog.\n(Reuters) -     U.S. bank PNC Financial  (PNC) reported a rise in first-quarter profit on Tuesday, helped by a boost in interest income.\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\n(Bloomberg) -- Gold edged toward the record high set on Monday, as the Trump administration pressed ahead with probes that could broaden the US’s sweeping trade war.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceEven Oslo Has an Air Quality ProblemLA County Floats Leaner Budget Burdened by Fire and Legal Costs$15 Million Fund Bets Leadership Training Can Improve Chicago PolicingBullion rose to top $3,230 an ounc\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, […]\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where The Goldman Sachs Group, Inc. (NYSE:GS) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the […]\nCitigroup shares rose in early trading Tuesday after the bank reported better-than-expected first-quarter results as volatile markets boosted equities trading.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWith consumers and businesses alike worried about tariffs, economists are looking to see if “soft data” like recent weak consumer sentiment surveys will feed into “hard data” reports like retail sales and inflation.\nCHICAGO (Reuters) -United Airlines forecast lower-than-expected profit for the current quarter on Tuesday and warned of downside risks to its full-year outlook if the U.S. economy slips into a recession.  President Donald Trump's trade war has increased the odds of an economic recession, hitting business and consumer confidence and rattling global markets.  United said its financial forecast is dependent on the macro environment, which, it added, is \"impossible to predict this year with any degree of confidence.\"\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 22-31_Big Bank investors 'on edge' despite strong Q1 results",
    "date": "",
    "content": "Title: Big Bank investors 'on edge' despite strong Q1 results\nDate: 2025-04-15 22:31\nURL: https://finance.yahoo.com/video/big-bank-investors-edge-despite-223109693.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBank of America (BAC) and Citi (C) beat expectations with strong first quarter results, boosting investor confidence and lifting both stocks. RBC Capital Markets bank analyst Gerard Cassidy joins Market Domination to break down what's driving bank earnings.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination here.\nBank of America and Citi reporting first quarter earnings this morning, beating on the top and bottom lines and following a trend of strong Q1 bank earnings. For more, we're bringing in now Gerard Cassidy, analyst at RBC Capital markets, covering the banking sector. Gerard, it's great to see you as always. So, listen, the bank earnings they continue to roll in, Gerard. We heard from Bank of America and Citi this morning. Investors clearly like what they heard there. Both those stocks are higher in today's trade. Broadly, how would you characterize what we've heard, Gerard, from the sector you know so well? I mean, it has seemed generally positive, Gerard.\nJosh, you're absolutely right. The results have been good. Um, the banks have generally beaten all of our estimates on the street consensus EPS estimates as well as my own. And I think part of the reason is of course, the capital markets businesses for the large money center banks and for Goldman and Morgan Stanley were really strong in trading, particularly equity trading. So that was a large reason for the beats from most of these companies. Also credit. Credit remains very resilient even though they're building up reserves as they're required to do under the new accounting standard called CECL, current expected credit losses. When I say new, it's January of 2020 when it was introduced. So I think what we're seeing is that you know, the first quarter of course had two months of no commentary about tariffs. It was only in March that the commentary started to be elevated. And April of course has been very volatile. So I think what we're seeing is first quarter results overall are better than expected. Credits strong. Capital levels are very healthy. Liquidity is high. It's really the future and the unknown of the future that has everybody on edge.\nHow long do you think the elevated volatility, that the trading volume that comes from that, can make up for muted deal activity? Can that continue for a couple of quarters or is there a limit to how far that could take you?\nIt's a really good question because it was outstanding in the first quarter and it did more than offset, you know, the lower, the lower numbers in some of the selected investment banking categories, particularly ECM, equity capital markets. The IPO market has really kind of fizzled out here due to this volatility. So you really need volatility and volumes to go with it to enable these larger firms to offset any slowdown in activity and advisory, which is M&A activity of course, and then the ECM business. Um, the DCM, debt capital markets had a very strong first couple of months of the year. It has slowed down a little bit. So you're right, we will need to see elevated volumes and volatility if the investment banking markets don't come back. Ideally, if we could have some resiliency in the markets and less volatility, you might get a combination of lower revenues and trading, but more than offset by incremental pickup in the advisory and the ECM business. So we'll have to see how that plays out, but right now the uncertainty is really weighing on the ECM and advisory business at this time.\nA federal judge has ordered Bank of America to pay more than $540 million to resolve long-running litigation from a U.S. regulator that alleged the company underpaid mandatory assessments for deposit insurance.  The order, reached March 31 and published publicly on Monday, arrives over eight years after the Federal Deposit Insurance Corporation sued Bank of America in 2017.  “We are pleased the judge has ruled and have reserves reflecting the decision,” Bank of America said in a statement to The Associated Press.\nInflation in the United Kingdom fell for the second month running in March largely as a result of lower prices at the pump, official figures showed Wednesday, a move that is likely to pile pressure on the Bank of England to cut interest rates next month.  The Office for National Statistics said consumer prices rose by 2.6% in the year to March, down from 2.8% the previous month.\nWall Street is raking in even more money from trading than it did during the market’s Covid-19 era swings.  Goldman Sachs, JPMorgan Chase and Morgan Stanley all said a surge in trading revenue helped lift their profits last quarter and beat expectations.\nGoldman's Chief China Equity Strategist Kinger Lau explains how to navigate market volatility and the delisting risks for Chinese companies. He also says Goldman is betting on sectors that stand to benefit from Beijing's stimulus measures. Lau was speaking on Bloomberg's The China Show.\nCiti plans to spend more in 2025 than it did last year on fixing long-running risk, data, and compliance deficiencies, as it carries out a yearslong turnaround plan that it refers to as its “transformation.”  Citi CFO Mark Mason said on a call with reporters that the firm is working to move away from manual activity and automate parts of its risk management processes and compliance programs.  Citi is prioritizing its efforts to try and change that.\n(Bloomberg) -- Beleaguered stock bulls are getting an encouraging sign from the people who know the companies best.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsCorporate insiders scooped up shares of their own companies at the fastest pace in 16 months as the S&P 500 sank in March, and they kept buying at an elevated clip as the rout accelerated th\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 07-01_Bank of America Corp (BAC) Q1 2025 Earnings Call Highlights_ Strong Financial Performance Amid ...",
    "date": "",
    "content": "Title: Bank of America Corp (BAC) Q1 2025 Earnings Call Highlights_ Strong Financial Performance Amid ...\nDate: 2025-04-16 07:01\nURL: https://finance.yahoo.com/news/bank-america-corp-bac-q1-070108006.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nNet Income: $7.4 billion for Q1 2025.\nEarnings Per Share (EPS): $0.90 for Q1 2025.\nRevenue Growth: 6% year-over-year increase.\nNet Interest Income (NII): Grew 3% year-over-year.\nDeposits: Nearly $2 trillion, marking the 7th consecutive quarter of growth.\nCommercial Loans: Growth in nearly every line of business for the second consecutive quarter.\nConsumer Investments: $22 billion in annual flows over the last 12 months.\nAssets Under Management (AUM) Flows: $24 billion in Q1 2025.\nSales and Trading Revenue: 12th consecutive quarter of year-over-year growth, with a 16% return on allocated capital.\nRegulatory Capital: Over $200 billion.\nLiquidity: Nearly $1 trillion.\nProvision Expense: $1.5 billion for the quarter.\nNon-Interest Expense: $17.8 billion, up from the previous quarter.\nReturn on Assets: 89 basis points.\nReturn on Tangible Common Equity: 14% for Q1 2025.\nTangible Book Value Per Share: $27.12, a 9% increase from Q1 2024.\nCommon Dividends and Share Repurchases: $6.5 billion returned to shareholders.\nConsumer Banking Revenue: $10.5 billion, a 3% increase from Q1 2024.\nWealth Management Revenue: $6 billion, an 8% increase year-over-year.\nGlobal Banking Revenue: $6 billion, flat compared to the prior year.\nGlobal Markets Revenue (ex-DVA): $5.6 billion, a 9% increase year-over-year.\nEffective Tax Rate: 9% for the quarter.\nWarning! GuruFocus has detected 3 Warning Sign with BAC.\nRelease Date: April 15, 2025\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\nBank of America Corp (NYSE:BAC) reported a strong net income of $7.4 billion and $0.90 in EPS for Q1 2025, marking an 11% increase in net income year-over-year.\nThe company achieved a 6% revenue growth year-over-year, with net interest income growing by 3%.\nDeposits grew for the 7th consecutive quarter, reaching nearly $2 trillion, an 8% increase from mid-2023.\nThe wealth management division added 7,200 net new households and saw net AUM flows of $24 billion in the quarter.\nThe company maintained a strong balance sheet with over $200 billion in regulatory capital and nearly $1 trillion in liquidity, supporting client solutions effectively.\nNon-interest expenses increased to $17.8 billion, driven by seasonally elevated payroll taxes, litigation costs, and market-related expenses.\nProvision expense for the quarter was $1.5 billion, indicating ongoing caution in asset quality management.\nThe company faces potential headwinds from expected interest rate cuts, which could impact net interest income growth in the future.\nThere is uncertainty in the economic outlook due to market volatility and potential changes in tariffs and policies, which could affect loan demand and growth.\nThe commercial loan growth, while strong, is subject to concerns over potential weakening in loan demand due to economic uncertainties and policy changes.\nQ: Given the uncertainty in the environment, what level of CET1 are you comfortable running with, and can the $4.5 billion buyback level be sustained? A: Alastair Borthwick, CFO: We ended the quarter with $7 billion in earnings, allowing us to increase the share buyback from $3.5 billion to $4.5 billion. We are growing into our capital by investing in the business, and we still have flexibility to increase the buyback. We don't have a specific CET1 target yet, as we await full clarity on capital requirements.\nQ: What drove the strength in loan and deposit growth in Q1, and what is the outlook for commercial loan growth given policy uncertainties? A: Brian Moynihan, CEO: We've been investing in building more commercial bankers globally, which is now paying off. Despite potential economic changes, our increased capacity and use of AI for efficiency are driving growth. We expect this to continue across the board.\nQ: What were the dynamics of setting the loan loss reserve this quarter, and how did you account for potential economic changes? A: Alastair Borthwick, CFO: We set reserves using data as of 3/31, with the ability to add judgmental layers. We use blue-chip economic indicators for baseline assumptions, which have moved down in terms of economic growth. Our reserve is set closer to an unemployment rate of around 6% for 2025-2026.\nQ: How are you managing expenses, and is the full-year expense growth expectation of 2% to 3% still valid? A: Alastair Borthwick, CFO: Yes, we still expect full-year expenses to grow 2% to 3%. It might be towards the higher end, but it depends on fee developments throughout the year.\nQ: How do you view the impact of potential rate cuts on your net interest income (NII) targets? A: Alastair Borthwick, CFO: We expect to maintain our Q4 NII target despite four anticipated rate cuts. The cuts are expected later in the year, so they won't significantly impact 2025 but may pose a headwind in 2026. Our long-term target remains a 2.3% NIM.\nFor the complete transcript of the earnings call, please refer to the full earnings call transcript.\nThis article first appeared on GuruFocus.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 08-00_Big banks maintain 'the sky is not falling' amid Trump tariff turmoil. So far.",
    "date": "",
    "content": "Title: Big banks maintain 'the sky is not falling' amid Trump tariff turmoil. So far.\nDate: 2025-04-16 08:00\nURL: https://finance.yahoo.com/news/big-banks-maintain-the-sky-is-not-falling-amid-trump-tariff-turmoil-so-far-080012863.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBig banks are offering the latest view of how their customers are faring amid President Trump's tariff turmoil, and it's not all bad — at least for now.\n\"The message has really been that the sky is not falling,\" Saul Martinez, a bank analyst for HSBC, told Yahoo Finance on Tuesday.\nFive of the country's largest banks over the past week posted first quarter rises in profits and revenue, driven in part by trading operations that benefited from the market volatility triggered by the initial rollout of Trump's first tariffs in February and March.\nRead more: The latest news and updates on Trump's tariffs\nCollectively, net profits at JPMorgan Chase (JPM), Bank of America (BAC), Citigroup (C), Morgan Stanley (MS), and Goldman Sachs (GS) amounted to $35 billion, a 13% increase from the year-ago quarter. Revenue also rose at all of these banks. Trading revenue alone jumped 17% to more than $36 billion.\nMany banks said their consumer customers were still spending, defaults were still manageable, and businesses were not experiencing distress despite the uncertainty about the months ahead. None of the institutions with big Wall Street footprints updated their earnings outlooks for the rest of the year, either.\nWhat these results didn't include, however, was the volatile period that followed Trump's April 2 \"Liberation Day\" tariff announcement, which took place two days after the quarter ended. Stocks and bonds plunged and have yet to fully recover, ushering in new uncertainty about the economy and the safety of US assets.\n\"We're surprised about the degree of ongoing firmwide strength at all 5 big banks ... and the more than expected upbeat views,\" said Wells Fargo banking analyst Mike Mayo in a Tuesday note.\n\"To us, it all says that events since Apr 2 can still be little more than a speed bump, so long as policy moves faster to help ease most of the uncertainty,\" he added, in reference to promised deregulation of the banking industry expected from the Trump administration.\nNot that banks and their top executives were entirely upbeat. Goldman Sachs CEO David Solomon said that the prospect of a recession \"has increased.\" JPMorgan CEO Jamie Dimon said the economy faces \"considerable turbulence,\" with a recession as a \"likely outcome.\"\nIn such a scenario, he added, \"earnings won't be great and the stocks will go down.\"\nBut many bankers were noticeably more optimistic. The word \"recession\" did not come up once on Citigroup's Tuesday earnings calls with analysts. Jane Fraser, CEO of Citigroup, also offered an optimistic vision of the current turmoil.\n\"When all is said and done, and longstanding trade imbalances and other structural shifts are behind us, the U.S. will still be the world's leading economy,\" she said in a statement with the bank's Tuesday earnings release.\nBrian Moynihan, CEO of Bank of America, went out of his way on Tuesday to note that his bank's research team doesn't see a recession happening in 2025.\nRead more: What is a recession, and how does it impact you?\nUS consumers, he added, keep \"pushing money into the economy,\" and the lender's business clients \"remain profitable, liquid and have strong results.\"\nBut \"nobody has a perfect crystal ball,\" Moynihan acknowledged, noting that \"we potentially face a changing economy in the future.\"\nSome banks even showed a rise in investment banking income during the first quarter, defying predictions of a slowdown. Executives acknowledged some deals were now on hold due to uncertainties, but many described the pullbacks as temporary rather than long-lasting.\n\"I'm saying pause versus delete,\" Morgan Stanley CEO Ted Pick told analysts of the current investment banking environment. \"We don't know whether the economy is going to contract.\"\nEven amid the optimism, there were signs that banks are preparing for harder times. JPMorgan, Bank of America, Citigroup, and Wells Fargo (WFC) added $8.4 billion in provisions to account for future loan losses.\nThe figure was 29% higher than the year-ago period and 9% higher than the previous quarter.\n\"We're still in a cloudy period. It's going to be choppy from here, and it's exhausting,” Ken Leon, an analyst for CFRA Research, told Yahoo Finance.\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nDon’t be fooled by the calm. There’s still great uncertainty about tariffs and the economy. It could take months for things to shake out.\nMorgan Stanley analyst Kristine Liwag updated her defense sector view to “Attractive” from “In-line.” Northrop Grumman stock is her “top pick.”\nFederal Reserve Chairman Jerome Powell sent stocks lower when he commented about the impact of President Trump's tariffs and how it may affect inflation and a potential rate cut.\nNEW YORK (Reuters) -Oil prices were little changed on Tuesday as investors digested the latest headlines on U.S. President Donald Trump's on-again, off-again tariffs and tried to figure how much the U.S.-China trade war could reduce global economic growth and oil demand.  Brent crude futures fell 21 cents, or 0.3%, to settle at $64.67 per barrel, while U.S. West Texas Intermediate (WTI) crude fell 20 cents, or 0.3%, to settle at $61.33.  The International Energy Agency followed on Tuesday with its projection that global oil demand in 2025 will grow at its slowest rate for five years due to worries about economic growth from Trump’s trade tariffs.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 08-55_US Dollar Weakness Returns as Trade War Fears Hurt US Assets",
    "date": "",
    "content": "Title: US Dollar Weakness Returns as Trade War Fears Hurt US Assets\nDate: 2025-04-16 08:55\nURL: https://finance.yahoo.com/news/us-dollar-weakness-returns-trade-075906710.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- A gauge of the dollar resumed declines following a short-lived reprieve as concerns over an expanding trade war dented demand for US assets.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nThe greenback hit a fresh six-month low, falling against every Group-of-10 currency, as new restrictions by the Trump administration on Nvidia Corp.’s chip exports to China added to the risk-off sentiment. It slightly pared losses after China said it wants to see a number of steps from the US administration before it agrees to trade talks.\n“All this uncertainty and talk of more tariffs is fueling the idea of de-risking from US assets — sell the dollar,” said Rodrigo Catril, senior foreign-exchange strategist at National Australia Bank Ltd. in Sydney. “Euro and Swiss franc are prime candidates of that flow, even as the trade war escalates and global growth deteriorates.”\nHaven currencies including the Swiss franc and yen rallied earlier alongside the euro while demand for long-volatility exposure surged. The Bloomberg Dollar Spot Index slid as much as 0.6% on Wednesday after rising for the first time in six days on Tuesday.\nThe greenback gauge has slumped more than 3% so far in April, on track for its steepest monthly decline since late 2022, amid deepening concerns about a trade war-driven US recession and the dollar’s appeal as a safe haven.\n“We see the era of strong dollar as having peaked,” Jefferies International chief economist and strategist Mohit Kumar wrote in a note to clients. “US dollar weakness is likely to continue. Our favorite version of a weaker dollar has been long gold as central banks seek to diversify out of US dollar in alternatives.”\nIn another sign of weakening confidence in traditional safe-haven US assets, Treasuries suffered their worst selloff in more than two decades last week due to worries that foreign holders such as China were reducing ownership.\nFund managers are the most bearish on the dollar since 2006, according to a Bank of America survey. That sentiment is now spilling into options markets, where traders are paying a premium — for the first time in five years — to hedge against a weaker greenback over the next 12 months.\nWhat Bloomberg strategists say...\n“The US’s tariff policy, capital outflow, and the assault on the dollar as a politically meddle-free global financial instrument are keeping pressure on the US currency. In this environment, other currencies, such as sterling, are likely to remain overall supported, with weak domestic fundamentals only providing fleeting headwinds, until the dollar looks cheap enough again to attract buyers despite its new risks.”\n—Simon White, Macro Strategist, London\nOne-week risk reversals, a gauge of sentiment, show the same trend as they hover near record bearish levels, while volatility gauges indicate traders aren’t counting on calm anytime soon. Some are positioning for a slow grind lower using leveraged options structures.\n--With assistance from Masaki Kondo and Alice Gledhill.\n(Updates throughout with latest moves, comment and options context.)\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nWe recently published a list of 19 Mid- And Large-Cap Stocks Insiders Are Buying After Trump’s Tariff Rollout. In this article, we are going to take a look at where Dollar Tree, Inc. (NASDAQ:DLTR)stands against other mid- and large-cap stocks insiders are buying after Trump’s tariff rollout. On April 2, 2025, President Donald Trump declared […]\nTaiwan Semiconductor Manufacturing (NYSE: TSM), popularly known as TSMC, is the world's largest semiconductor foundry, which fabricates chips for the top consumer electronics companies and chip designers across the globe.  The world's leading companies, such as Nvidia, AMD, Broadcom, Sony, and Apple, tap TSMC's plants for manufacturing chips that power personal computers (PCs), smartphones, data centers, and gaming consoles, among others.  As a result, TSMC is in a solid position to benefit from the secular growth of the global semiconductor market, which is expected to hit $2 trillion in annual revenue in 2032.\nArgentina's libertarian President Javier Milei rolled the dice this week on a major economic swerve, tearing down currency controls that had been in place for almost six years to protect the peso and avert an outflow of dollars.  The country's long-suffering peso weakened more than 10% on Monday before stabilizing in the middle of a wide new trading band that replaced a tightly-controlled currency peg, but avoided the more messy and chaotic crash that some had feared.  The faster-than-expected lifting of FX controls - long promised by Milei and sought by investors - has got some on Wall Street waxing lyrical about the South American nation emerging from years of economic tumult, overspending and market distortion.\nWe recently published a list of Tech Firms Dominate Monday’s 10 Worst Performers. In this article, we are going to take a look at where Nebius Group NV (NASDAQ:NBIS) stands against other tech firms that dominate Monday’s worst performers. Wall Street’s main indices kicked off the trading week in the green territory, albeit with minimal […]\nThe U.S. bond market could come under further pressure, according to a research note published by JPMorgan.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 09-30_Corporate insiders flash bullish stock sign by buying into rout",
    "date": "",
    "content": "Title: Corporate insiders flash bullish stock sign by buying into rout\nDate: 2025-04-16 09:30\nURL: https://finance.yahoo.com/news/corporate-insiders-flash-bullish-stock-093000363.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) — Beleaguered stock bulls are getting an encouraging sign from the people who know the companies best.\nMost Read from Bloomberg\nHow Did This Suburb Figure Out Mass Transit?\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nCorporate insiders scooped up shares of their own companies at the fastest pace in 16 months as the S&P 500 (^GSPC) sank in March, and they kept buying at an elevated clip as the rout accelerated this month in the wake of President Donald Trump’s global tariff rollout.\nSome 180 corporate insiders purchased their own stock in the first two weeks of the month, data compiled by the Washington Service show. This has tipped the buy/sell ratio to 0.40, keeping it near the highest level since late 2023. While corporate executives often buy stock for reasons unrelated to market performance, the uptick in purchases suggests a confidence in their companies that’s reassuring to investors who’ve been battered by the weeks-long selloff.\n“This is a positive sign,” said Matt Lloyd, chief investment strategist at Advisors Asset Management. “Investors are still mired in a negative feedback loop, given trade and economic uncertainty. So it’s pivotal for this trend to continue as the stock market attempts to get its sea legs.”\nGrowing optimism from corporate executives stands in contrast to the broader risk-off mood. Investor sentiment regarding economic prospects is the most negative in three decades. Global fund managers are gloomy, with 82% of respondents to a monthly Bank of America global survey expected the global economy to weaken. A record number of them intend to reduce exposure to US equities, according to the poll.\nThat’s as investors are dealing with inflation that risks becoming entrenched because of a global trade war and the possibility of a recession. It’s the reason some, like EP Wealth Advisors’ Adam Phillips, are reluctant to overstate the trend of insider share purchases.\n“Like so many others, a lot of these companies are flying blind as they await clarity around trade policies,” Phillips, managing director of portfolio strategy at the firm, said.\nBuying and selling among corporate executives has a track record of providing an early read on market direction. The insider buy-sell ratio jumped in August 2015 and late 2018, with the former preceding a market bottom and the latter coinciding with one. In March 2020, corporate insiders’ purchases correctly signaled the bottom of a bear-market rout.\nThe number of sellers historically exceeds that of buyers as executives often view their stock as a source of cash.\nEarlier this year, corporate insiders timed the stock-market correction right before the S&P 500 Index peaked in mid-February. They dumping shares of their own companies in most of January at an unprecedented pace, before reversing the move in the final days of the month.\nThis time, cash levels have posted their largest two-month increase since the throes of the pandemic, according to BofA, which could bode well for stocks when sentiment turns around. The money they’re sitting on could be used to buy stocks, and Plurimi Wealth’s Patrick Armstrong argues that now is precisely the time to build that equities exposure.\n“The fact that insiders are scooping up their shares, cash levels are climbing and sentiment is so extremely bearish is an early indicator that the market selloff is beginning to make stocks more attractive,” Armstrong, who is the firm’s chief investment officer, said.\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nThe Beauty Salon Recession Indicator\nTrump Is Firing the Wrong People, on Purpose\n©2025 Bloomberg L.P.\nScotiabank raised the firm’s price target on AngloGold Ashanti (AU) to $42 from $34 and keeps a Sector Perform rating on the shares. The firm is updating its price targets on stocks in the Gold & Precious Minerals sector, the analyst tells investors. The firm is expecting flat margins quarter-over-quarter given Q1 is a weaker operating quarter for most companies, with stronger operating performance in the second half of the year. Commentary on potential tariff impact will be a focus for most com\nLyft is buying mobility platform FreeNow from German automotive giants BMW and Mercedes-Benz for 175 million euros ($198.40 million) to expand into the European ride-hailing market, the U.S. company said on Wednesday.  Under pressure from dominant ride-hailing rival Uber Technologies in its home North American market, Lyft has been seeking new avenues to grow its business.  The acquisition of FreeNow will nearly double its potential market and open doors to major European cities such as London, Frankfurt, Paris and Milan, where the German firm offers services ranging from traditional taxi to e-scooter rentals and car-sharing options.\nShares of J.B. Hunt Transport Services fell in premarket trading Wednesday, a day after comments from executives on potential tariff impacts outweighed better-than-expected first-quarter results.\nNEW YORK (Reuters) -U.S. stocks ended sharply lower on Wednesday as Nvidia warned about steep charges from new U.S. curbs on its chip exports to China and Federal Reserve Chair Jerome Powell said U.S. economic growth appears to be slowing.  Powell, in remarks for the Economic Club of Chicago, said larger-than-expected tariffs likely mean higher inflation and slower growth.  The Fed chair's afternoon comments sparked further selling in stocks, which had already been under pressure from a sharp drop in shares of Nvidia and other chipmakers.\nCEOs have warned on the economy because of Trump administration tariff policies. US Treasury Secretary Scott Bessent has a message for them all.\nThe U.S. bond market could come under further pressure, according to a research note published by JPMorgan.\nSince his inauguration in January, U.S. President Donald Trump has announced - and sometimes reversed - tariffs on a slew of products and countries.  \"Approximately 70% of our aluminum produced in Canada is destined for U.S. customers and is now subject to 25% tariff costs ... Currently the net annual result is approximately $100 million negative for our business,\" CEO William Oplinger said during a post-earnings conference call.  The aluminum producer said the tariffs on Canadian imports had cost the company roughly $20 million in the first quarter, ended March 31.\nU.S. shoppers stepped up their shopping last month, fueled by a spending spree on big ticket items, particularly cars, before President Donald Trump’s expansive new tariffs started kicking in.  Retail sales rose 1.4% in March, after rising 0.2% in February, according to the Commerce Department.  Retail sales fell 1.2% in January, hurt in part by cold weather that kept more Americans indoors, denting sales at car dealers and most other stores.\nThe new accounts will invest in “America First” companies and be part of a broader suite of crypto ETFs. DJT shares rose on the news but are still down sharply this year.\nShares of Autoliv surged Wednesday morning after the Swedish airbag and seatbelt maker reported first-quarter profit well above expectations.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 10-00_Big banks were counting on American prosperity, but volatility works too_ Morning Brief",
    "date": "",
    "content": "Title: Big banks were counting on American prosperity, but volatility works too_ Morning Brief\nDate: 2025-04-16 10:00\nURL: https://finance.yahoo.com/news/big-banks-were-counting-on-american-prosperity-but-volatility-works-too-morning-brief-100049217.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThis is The Takeaway from today's Morning Brief, which you can sign up to receive in your inbox every morning along with:\nThe chart of the day\nWhat we're watching\nWhat we're reading\nEconomic data releases and earnings\nThe American growth trade as we know it — juiced by AI might, hopes of a soft landing, and coming deregulation — may have fallen away. But an outgrowth of shifting tariff policies has sparked another lucrative exchange on Wall Street: the volatility trade.\nA surge in trading activity has shuttled billions of dollars to the nation’s largest banks as investors have attempted to protect their money or deploy it in the face of market gyrations.\nBy subscribing, you are agreeing to Yahoo's \n                        \n                            Terms\n                        \n                     and \n                        \n                            Privacy Policy\n                        \n\nEarnings reports from the big five banks in recent days revealed they collectively raked in nearly $37 billion in trading revenue this past quarter, touting record sales from equities changing hands.\nWarren Buffett famously urged investors to “be fearful when others are greedy and greedy when others are fearful.” A corollary for the financial institutions facilitating those trades is to sit back in any environment and collect fees.\nWall Street wants stocks to go up, sure, but most importantly, it just wants stocks to move.\nThe big banks' trading may mostly be for hedge funds, pensions, and large companies — big institutional investors. But everyone's rolling up their sleeves at the volatility and tinkering with their portfolios, looking to optimize or take advantage of the moment.\nAs my colleague Josh Schafer reports, everybody's trading. Dip-buying flows following the week of “Liberation Day” reached record levels, according to data from VandaTrack, including $3 billion in net purchases on April 3. That was the largest daily total since VandaTrack began collecting the data in 2014.\nBuying at recent lows and FOMO trading explained much of the heightened activity. But another interpretation is that an entire class of retail investor has been trained to throw their cash into stocks in a continuation of a pandemic-era shift in personal finance.\nYou are probably better off not looking at your diminished 401(k) account when the market is convulsing. But pushing an order on a trading app has become something of a pastime for an increasingly large American demographic, the foundation for group chats among young people, and the basis for an entire genre of aspirational lifestyle content.\nThat big banks' big shot clients are doing this too is a great \"stars, they're just like us\" moment. But it's also part and parcel of the same volatility that's been a hallmark of the 2025 stock market and a lesson in the importance of a diversified portfolio of banks' business lines.\nThat these banks can up their profitability amid economic uncertainty and a lack of an anticipated IPO boom isn’t unique to volatile trading. A similar dynamic was at play earlier this year, when a major market narrative was whether the Fed would continue to ease rates. (The Fed cut rates in September, November, and December but has since paused.)\nFurther rate cuts would have curtailed banks’ lending margins, which were supercharged by the central bank’s years-long tightening campaign. But the big banks could have done just fine in a low-rate environment because they can lean on other commercial operations to cover revenue losses elsewhere.\nThe diversified nature of financial services allows the nation's biggest banks to profit even when the outlook grows darker. It's not clear how the American exceptionalism trade will unfold in the months ahead. Tax cuts and other business-friendly deregulatory efforts are in the offing.\nIn the meantime, as long as money is still moving and greasing the trading gears, at least one part of Wall Street will be happy.\nHamza Shaban is a reporter for Yahoo Finance covering markets and the economy. Follow Hamza on X @hshaban.\nClick here for in-depth analysis of the latest stock market news and events moving stock prices\nRead the latest financial and business news from Yahoo Finance\nAR, ALYAF and KBCSY made it to the Zacks Rank #1 (Strong Buy) momentum stocks list on April 16, 2025.\nThe effects of the White House’s tariff policy on inflation could be less transitory and more “persistent,” said Powell on Wednesday.  “Tariffs are highly likely to generate at least a temporary rise in inflation,” the Fed chief said, but their “effects could also be more persistent.”  Powell himself said at the last Fed meeting that his base case is for transitory inflation.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nJP Morgan took the leading position in terms of deal value by advising on transactions totalling $127.3bn.\nMeta CEO Mark Zuckerberg on Monday took the stand during the first day of a trial he hoped to avoid as the tech giant faces off against President Trump's antitrust cops in a case that threatens the $1.3 trillion empire Zuckerberg built.\nThe bank has also sent letters to more than 1,000 Chase patrons since October asking for funds to be returned.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 11-32_Bank of America CFO says business owners seek clarity on trade policy and prepare for a ‘slow-growth",
    "date": "",
    "content": "Title: Bank of America CFO says business owners seek clarity on trade policy and prepare for a ‘slow-growth\nDate: 2025-04-16 11:32\nURL: https://finance.yahoo.com/news/bank-america-cfo-says-business-113218837.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nGood morning. Business leaders are working to manage volatility and an evolving economic environment, as the goalpost keeps moving on policies.\nBank of America (BofA) CFO Alastair Borthwick offered some insight into what the bank is hearing from its commercial clients—concerns over trade policy and recent market turmoil have grown. “What our clients are telling us is they're looking for certainty,” Borthwick said during a media call on Tuesday. BofA’s commercial clients range from small businesses to middle-market and large corporations.\nThey’re seeking clarity, not just around trade policy, but also the tax package and regulatory reform. “Every day provides a little more information” and also “a little bit more in the way of certainty for people,” he said.\nHe added: “It's a slow-growth environment. That's what we continue to try and support our clients through.”\nCFOs certainly are grappling with tariff uncertainty. Some are taking actions such as devising alternative-sourcing plans, stockpiling greater inventory, and creating financial buffers.\nHowever, BofA's research team at this point doesn't believe we'll see a recession, Borthwick said. And clients continue to show \"encouraging signs.\" Employment remains healthy, and consumers have proven resilient, he said.\nFor its Q1, Bank of America reported on Tuesday net income of $7.4 billion and earnings per share of 90 cents, up from 76 cents the same time last year. Revenue growth was 6%. It was driven by net interest income (NII), which was up 3% from the prior year, reaching $14.6 billion, partially helped by lower deposit costs. NII is the difference between what the bank earns on loans and investments and pays out on its liabilities, including deposits.\nBofA maintained its guidance that NII will reach $15.5 to $15.7 billion in the fourth quarter and achieve 6% to 7% year-over-year growth for 2025, Borthwick said. This goes against the grain of what’s becoming more common this earnings season—some companies are pulling guidance due to tariff tumult.\n“We run our business to withstand volatility over the short and the long term and through our responsible growth strategy,” Borthwick said on the media call. BofA is prepared to manage through any potential downturn in the economy, he said.\nAn analyst asked during BofA’s Q1 earnings call on Tuesday if there will be any potential impacts from the U.S. stock market losing trillions in wealth following the announcement of the Trump administration's sweeping tariff policy.\nThe real risk in any bank's balance sheet is going to be its credit posture, CEO Brian Moynihan said on the call. Even if there is “a very slight recession…we should fare well in that,” he said.\nNo one has a crystal ball to perfectly predict the future, Moynihan said. BofA is positioning itself for every outcome, he said. “But we don't want people to lose sight of the strong performance of this company and our team in the first quarter of 2025,” Moynihan said.\nSheryl Estradasheryl.estrada@fortune.com\nThis story was originally featured on Fortune.com\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nAs chair of the House Financial Services Committee, French Hill is helping shepherd key crypto legislation.\nPatreon is finally experimenting with native livestreaming, a new feature that could attract more creators and help them earn more money. The capability is rolling out to select testers this week and will become more widely available this summer. Similar to other platforms, Patreon’s new livestream feature comes with a live chat where fans can comment and interact using emoji reactions, as well as the ability to schedule livestreams in advance. Creators can also assign moderators to the chat. Pa\nA pseudonymous developer has created what they're calling a \"free speech eval,\" SpeechMap, for the AI models powering chatbots like OpenAI's ChatGPT and X's Grok. The goal is to compare how different models treat sensitive and controversial subjects, the developer told TechCrunch, including political criticism and questions about civil rights and protest. AI companies have been focusing on fine-tuning how their models handle certain topics as some White House allies accuse popular chatbots of be\nYoobic addresses growing industry needs across high-end goods, cosmetics, supermarkets, QSR and consumer products.\nThe pause came after the planned acquisition of Anglo American's coal business went under review.\nThe decision was taken due to depleting open-pit reserves.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 12-14_Big banks push for simpler mortgage rules as housing market slows",
    "date": "",
    "content": "Title: Big banks push for simpler mortgage rules as housing market slows\nDate: 2025-04-16 12:14\nURL: https://finance.yahoo.com/news/big-banks-push-for-simpler-mortgage-rules-as-housing-market-slows-121402040.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nBig banks are urging the Trump administration to simplify regulations relating to mortgage loan origination, servicing, and securitization in the hope that these reforms may lower costs and boost lending activity in the struggling US housing market.\n\"In terms of mortgages, reducing unnecessary regulations would decrease homeownership costs,\" JPMorgan Chase (JPM) CEO Jamie Dimon wrote in his annual shareholder letter.\n\"Streamlining loan origination and servicing standards, reducing capital requirements and simplifying securitization rules would reduce the cost of mortgages without making them riskier. These simple reforms could lower the cost of mortgages by 70–80 basis points.\"\nThis push for reform comes as JPMorgan's mortgage volume fell to $11.2 billion in the first quarter ending March 31, down from $14.2 billion in the fourth quarter of 2024. Meanwhile, home lending from the bank's retail channel fell to $9.4 billion from $12.1 billion in the fourth quarter of 2024.\nOther banks have also struck a similar tone during recent conference calls following quarterly earnings.\nBank of America (BAC) CEO Brian Moynihan told investors during the company’s first quarter earnings call this week that he is hopeful for change as new policymakers take office.\n\"It’s critically important that we get this rebalance,\" Moynihan said. \"Sometimes the regulation gets in the way of that.” At Bank of America, home lending held steady at $254 billion in the first quarter, unchanged from the previous quarter.\nWells Fargo (WFC) CEO Charles Scharf echoed Dimon’s sentiment, telling analysts last week that the bank supports the administration’s deregulatory push. Scharf said the proposed changes would allow \"more loans, take more deposits, and provide more liquidity to the markets while preserving robust regulatory oversight.\"\nWells Fargo’s mortgage volume fell to $4.4 billion in the first quarter ending March 31, down from $5.9 billion the previous quarter, further underscoring the broader slowdown in housing financing activity.\nData from the National Association of Realtors showed pending home sales, a forward looking indicator of home sales based on contract signings, grew 2% in February. However, pending transactions are down 3.6% year over year, underscoring the ongoing challenges in the housing market.\nThe average rate on a 30-year fixed mortgage stood at 6.92% as of last week, not far from the highest levels seen over the last several years.\nRead more: Best low- and no-down-payment mortgage lenders of 2025\nThe banking industry has long been lobbying for a scaled-back version of the “Basel Endgame” capital rule, which requires financial institutions to hold significantly more capital as part of a broader post-2008 effort to strengthen the financial system.\nBanks argue that higher capital requirements restrict their ability to offer mortgages, car loans, credit cards, and small business loans.\nPresident Trump's Treasury Secretary, Scott Bessent, in a speech last week before the American Bankers Association, called for \"modernizing\" capital requirements but said the latest proposal \"is not, in my opinion, the right starting point for our modernization effort.\"\nBessent added, \"Modernizing regulatory capital likely would mean reduced capital requirements for mortgage loans and some other exposures that are core to the community bank model.\"\nMeanwhile, Trump officials are also revisiting efforts to privatize Fannie and Freddie, a major policy goal that first Trump administration couldn't pull off. Bessent said the decision to release the two companies will come down to the trajectory of mortgage rates.\nIn his annual letter, JPMorgan's Dimon cited data from the Urban Institute estimating that mortgage market reforms could boost mortgage originations by 1 million annually, particularly helping lower-income borrowers and first-time homebuyers targeting homes in the $150,000-$300,000 range.\nRead more: 2025 housing market: Is it a good time to buy a house?\nAccording to Zillow, the average US home value sits at $361,263, up 2.1% over the past year.\n“Buying a home, still a pillar of the American Dream, is simply the best way for individuals to start building household wealth,” Dimon wrote.\nDani Romero is a reporter for Yahoo Finance. Follow her on X @daniromerotv.\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\nRead the latest financial and business news from Yahoo Finance\nUK homeowners may soon see some relief on their mortgage bills. Although average rates on fixed mortgage deals remain above 5%, growing expectations of interest rate cuts by the Bank of England could push borrowing costs lower — possibly as low as ...\nWith a better price performance and attractive valuation metrics, IBM is relatively better placed than MSFT at the moment.\nRussia’s rouble has become the world’s best-performing global currency as Donald Trump’s tariff war upends financial markets.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nIt can be a smart strategy, provided you understand what you’re risking.\nHere’s how inheriting an annuity works and what to do with it.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-29_Big Banks Step Up Stock Buybacks. Goldman and BofA Stand Out.",
    "date": "",
    "content": "Title: Big Banks Step Up Stock Buybacks. Goldman and BofA Stand Out.\nDate: 2025-04-16 13:29\nURL: https://finance.yahoo.com/m/b16d9f33-f55b-3a45-9218-ea45e2e1faeb/big-banks-step-up-stock.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, […]\nMerrill Lynch and Bank of America’s Private Bank posted a flat profit for the first quarter of 2025 amid a strong earnings beat for their parent company.  BofA’s  wealth unit reported net income of $1 billion in the first quarter, down 0.1% from the fourth quarter and nearly identical to the first quarter in 2024.  The wealth division reported total revenue of $6.02 billion for the first quarter, up nearly 8% from $5.59 billion a year ago as clients and assets under management both increased during the period.\nSays “largely complete” on goals of Simplification: Focus on five core interconnected businesses; exit 14 international consumer markets; simplify the organization and management structure; and Culture and Talent: build a winning culture; invest in talent; deliver One Citi (C). Says main priorities for 2025 and 2026 are goals of Transformation: #1 priority; relentless execution; regulatory remediation; modernize infrastructure; data enhancements; and Enhance Business Performance: Maximize unique\nCanadian bank RBC cut its price target on Bank of America (BAC) stock to $45 from $50 but maintains a positive view of the shares. BAC reported its first-quarter financial results yesterday. Why RBC Cut Its Price Target on BAC But Remains Bullish RBC lowered its price target on BAC to $45 from $50 due […]\nDespite uncertainty employment remains healthy, and consumers have proven resilient, BofA finds.\nBAC's Q1 earnings gain from solid equity trading income, higher NII and decent advisory and debt underwriting performance amid higher provisions and expenses.\nCiti's wealth division saw a nearly five-fold increase in new investment assets in the first quarter. CEO Jane Fraser said the firm has \"real horsepower and firepower in our investment capabilities.\"\nSees non-interest income ex-markets up 2%-3% year-over-year. Sees expenses slightly below $53.4B. Sees Cards NCL rates around the top of the 2024 ranges for both businesses, with higher losses in 1H, consistent with seasonal patterns, subject to changing conditions. Says ACL build will be a function of macroeconomic environment and business volumes. Says repurchased $1.75B of common shares in 1Q25; targeting a similar level of share repurchases in 2Q25. Says remains committed to continuing to im\nThe parent company of U.S. Bank posted a profit of $1.71 billion, or $1.03 a share, above analysts expectations of 98 cents a share.\nNews of the day for April 15, 2025\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-59_Big banks report Q1 beats, China stops taking Boeing deliveries_ Morning Buzz",
    "date": "",
    "content": "Title: Big banks report Q1 beats, China stops taking Boeing deliveries_ Morning Buzz\nDate: 2025-04-16 15:59\nURL: https://finance.yahoo.com/news/big-banks-report-q1-beats-155936913.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe major averages were fractionally higher near noon, adding slightly to yesterday’s gains as investors reacted to fresh headlines on U.S.-China trade tensions and a new round of corporate earnings. Markets are attempting to stabilize after a rocky stretch, but much of the tone is being shaped by President Trump’s latest tariff decisions. After last week’s escalation, he’s now backing off slightly, offering temporary relief on key consumer electronics and signaling possible concessions for the auto sector.\nDiscover outperforming stocks and invest smarter with Top Smart Score Stocks.\nFilter, analyze, and streamline your search for investment opportunities using  Tipranks' Stock Screener.\nLooking to commodities, gold shares are up marginally, still hovering above the $3,200 threshold. Meanwhile, oil prices are lower, but only fractionally.\nGet caught up quickly on the top news and calls moving stocks with these five Top Five lists.\n1. STOCK NEWS: \nBank of America (BAC) reported better-than-expected Q1 results, with the company saying it grew commercial loans in every line of business in the quarter\nCiti (C) reported upbeat Q1 earnings and revenue and provided revenue guidance for FY25\nJohnson & Johnson (JNJ) reported better-than-expected Q1 results, raised its FY25 operational sales outlook, and increased its quarterly dividend about 5%\nLowe’s (LOW) agreed to acquire Artisan Design Group for $1.325B\nChina has ordered airlines to halt further deliveries of Boeing (BA) jets, Bloomberg reports\n2. WALL STREET CALLS:\nGeneral Motors (GM) downgraded to Equal Weight from Overweight at Barclays\nHubSpot (HUBS) upgraded to Buy from Neutral at UBS\nPepsiCo (PEP) downgraded to Neutral at BofA on slower snacks growth\nNike (NKE) initiated with neutral view at Berenberg, here’s why\nBenchmark starts “dominant regional leader” MercadoLibre (MELI) with a Buy\n3. AROUND THE WEB: \nElliott Investment Management has built a large position worth more than $1.5B in HP Enterprise (HPE), Bloomberg says\nHonda (HMC) is considering plans to relocate the production of models to the U.S. from Mexico and Canada in response to an additional 25% tariff imposed by the Trump Administration, Nikkei reports\nAMD (AMD) CEO says the company plans to build more AI servers in U.S., Bloomberg says\nLVMH (LVMUY) is considering moving some of its manufacturing to the U.S. amid Donald Trump’s tariff threats, Business Insider says\nAccording to people who attended Netflix’s (NFLX) annual business review meeting last month, the company aims to reach a $1T market capitalization and double its revenue by 2030, WSJ reports\n4. MOVERS:\nRezolve AI (RZLV) increases after securing a $9.8M annual contract with Liverpool Mexico\nEos Energy (EOSE) gains after signing a MOU with Frontier Power\nRocket Pharmaceuticals (RCKT) higher after its CEO bought $101.6K of the company’s stock\nAllegro MicroSystems (ALGM) lower after On Semi (ON) withdrew its proposal to acquire the company\nApplied Digital (APLD) falls after reporting quarterly results\n5. EARNINGS/GUIDANCE:\nPNC Financial (PNC) reported Q1 results, reaffirmed its FY25 guidance, and provided its outlook for Q2\nCryo-Cell (CCEL) reported Q1 results, with EPS lower year-over-year\n908 Devices (MASS) reported preliminary Q1 results\nAlbertsons (ACI) reported Q4 results, with CEO Vivek Sankaran commenting on the “solid results in the fourth quarter”\nWaFd (WAFD) reported Q1 results, with EPS beating consensus\nINDEXES: \nNear midday, the Dow was up 0.16%, or 66.31, to 40,591.10, the Nasdaq was up 0.26%, or 43.91, to 16,875.40, and the S&P 500 was up 0.29%, or 15.74, to 5,421.71.\nPublished first on TheFly – the ultimate source for real-time, market-moving breaking financial news. Try Now>>\nSee today’s best-performing stocks on TipRanks >>\nRead More on GM:\nDisclaimer & DisclosureReport an Issue\nTrump Trade: Carmakers may see tariff relief, China halts Boeing deliveries\nNike initiated, GM downgraded: Wall Street’s top analyst calls\nWedbush says auto tariffs potential delay ‘good news for Detroit Big 3, Tesla’\nWhat to Know About Jeff Bezos’ Secret EV Startup Slate Auto\nToyota Stock Surges as Trump Floats Tariff Reprieve\nSays saw ‘continued momentum’ in each of five businesses. Says securities services gained share. Says Markets had a ‘good quarter’. Says Equities revenues up 23% y/y. Says M&A revenue nearly doubled. Says USPB was up 2%. Says portfolio continued to perform in line with expectations. Says Transformation investments continue to modernize infrastructure. Says integrating AI directly into business operations. Says ‘confident in ability to continuing delivering, despite uncertainty of the moment’. Sa\nWe recently published a list of Top 5 AI News Moving The Market Today. In this article, we are going to take a look at where Applied Digital Corporation (NASDAQ:APLD) stands against other top AI news moving the market today. Investors continue to pour back into Big Tech stocks after the US government announced temporary […]\nAfter China reportedly decided that it would no longer accept deliveries of Boeing’s (BA) planes, prominent investor Stephanie Link yesterday said that the news was “clearly not material for Boeing at this time.” Link, who owns BA stock and has called the name her top pick for 2025, is the Chief Investment Strategist of Hightower […]\nHMC refutes reports that state that the automaker plans to shift vehicle production from Canada and Mexico to the United States due to potential heavy tariffs.\nFor investors, top mobile payment companies like AFRM, FI, MELI and PAY offer attractive opportunities thanks to their strong focus on innovation and ongoing market expansion.\nChina has suspended exports of a wide range of critical minerals and magnets as part of China’s retaliation for President Trump’s sharp increase in tariffs that started on April 2, the New York Times’ Keith Bradsher reported. On April 4, the Chinese government ordered restrictions on the export of six heavy rare earth metals, which are refined entirely in China, as well as rare earth magnets, 90% of which are produced in China, the report noted. Shares of MP Materials (MP) had been higher in ear\nWhat to expect from Netflix's first-quarter earnings and how will results impact Wall Street sentiment?\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-39_Gold Breaks $3,300 as Expanding Trade War Bolsters Haven Demand",
    "date": "",
    "content": "Title: Gold Breaks $3,300 as Expanding Trade War Bolsters Haven Demand\nDate: 2025-04-16 16:39\nURL: https://finance.yahoo.com/news/gold-climbs-record-expanding-trade-000033810.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\n(Bloomberg) -- Gold surged to a fresh high on haven demand as the dollar fell and tech stocks slumped after US President Donald Trump ordered a probe that could open up a new front in the global trade war.\nMost Read from Bloomberg\nTrump Signs Executive Orders on Federal Purchasing, Office Space\nHow Did This Suburb Figure Out Mass Transit?\nWhy the Best Bike Lanes Always Get Blamed\nLA County Floats Leaner Budget Burdened by Fire and Legal Costs\nBullion gained as much as 3.2% on Wednesday to climb above $3,300 an ounce for the first time, surpassing the previous record set on Monday. The dollar fell to a fresh six-month low as traders were whiplashed again by a slew of tariff headlines, with Trump launching an investigation into the need for levies on critical minerals.\nGold briefly pared gains following a report that China is open to trade talks if the US names a point person to represent the country and shows respect by reining in disparaging remarks, according to a person familiar with the Chinese government’s thinking.\nThe precious metal has climbed more than 26% this year and hit a series of record highs as the escalating trade war creates anxiety over a possible global recession and as investors struggle to take long-term positions due to the unpredictability of tariff announcements from Washington.\n“I’d love to have a pound for every time someone said it’s a record high in gold in the last few weeks,” Evy Hambro, thematic and sector investing global head at Blackrock Inc., said on Bloomberg Television. “The gold market is kind of thriving in this period of uncertainty, but the foundations are very tangible and real.”\nLeading banks remain optimistic about bullion’s prospects over the coming quarters as investors add to holdings in gold-backed exchange-traded funds and central banks continue to accumulate the metal. Goldman Sachs Group Inc. is forecasting that prices will rally to $4,000 an ounce by mid-2026.\nIn a Bank of America global fund manager survey this week, 42% of respondents expected gold to be the best performing asset class in 2025, up from 23% in March.\nNearly half of respondents also thought “long gold” is currently the most crowded trade, knocking “long Magnificent Seven” — which refers to a group of high-performing and influential US companies — off the top position it has held for two years straight.\nThe US administration also announced investigations this week into semiconductors and pharmaceutical imports, after placing sector-specific tariffs on steel and aluminum, automobiles and car parts. It also said it’s negotiating with dozens of other trading partners to lower trade barriers in exchange for relief on higher duties.\n“The power struggle between major countries will continue,” said Luchen Wang, a Shanghai-based analyst at Galaxy Futures Co. “Gold’s appeal as a safe-haven asset means it’s more likely to rise than fall in the near- to medium-term.”\nTraders are also betting there will be at least three Federal Reserve rate cuts this year. Monetary easing is generally positive for the precious metal.\nGold was up 3.1% to $3,330.28 an ounce as of 12:32 p.m. in New York, after earlier hitting a record of $3,333.08. The Bloomberg Dollar Spot Index fell 0.6%. Silver and platinum advanced while palladium was little changed.\nMost Read from Bloomberg Businessweek\nGM’s Mary Barra Has to Make a $35 Billion EV Bet Work in Trump’s America\nTrade Tensions With China Clear Path for Salt-Powered Batteries\nHow Mar-a-Lago Memberships Explain Trump’s Tariff Obsession\nTrump Is Firing the Wrong People, on Purpose\nThe Beauty Salon Recession Indicator\n©2025 Bloomberg L.P.\nGold prices just wrapped up their biggest daily gain since April 2020, when panicked investors were hoarding the precious metal during the Covid market meltdown.  Futures are up 40% over the past year, blowing past Wall Street's expectations for 2025, but it isn't just nervous investors who are gobbling up gold.  Central banks, particularly those in countries with strained relationships with the U.S., have been stockpiling gold as well.\nGold has been on a relentless rally, topping $3,300 per ounce for the first time. Investors could make quick profits with leveraged ETFs.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 17-45_Bank Remains Bullish on BAC Despite Target Cut",
    "date": "",
    "content": "Title: Bank Remains Bullish on BAC Despite Target Cut\nDate: 2025-04-16 17:45\nURL: https://finance.yahoo.com/news/bank-remains-bullish-bac-despite-174514486.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCanadian bank RBC cut its price target on Bank of America (BAC) stock to $45 from $50 but maintains a positive view of the shares.\nBAC reported its first-quarter financial results yesterday.\nA business owner discussing commercial business loans with a bank representative.\nWhy RBC Cut Its Price Target on BAC But Remains Bullish\nRBC lowered its price target on BAC to $45 from $50 due to macroeconomic issues.\nBank of America has delivered strong results in the face of macroeconomic challenges, RBC reported. Moreover, its efforts to increase its deposits and loans should boost its top profits over the long term, the Canadian bank believes.\nRBC Capital is impressed by BAC's low-cost deposit base.\nFinally, RBC, noting that BAC  has taken meaningful steps to reduce its risk following the Great Financial Crisis, believes that these measures will help the bank maintain its current profit levels in the face of a potential recession.\nMore About BAC Stock\nAnalysts on average expect the bank's earnings per share to climb to $3.64 this year and $4.26 in 2026 from $3.21 in 2024.\nIn the last month, the shares have fallen 10%, while they have dropped 20% in the last three months.\nWhile we acknowledge the potential of BAC, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than BAC but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires\nDisclosure: None. This article is originally published at Insider Monkey.\nArtificial intelligence was supposed to be a boon for helping companies navigate the impact of disruptions to their supply chains. But even this groundbreaking tech has its limits—and wasn’t ready for the far-reaching, on-and-off tariffs from President Trump.\nProgressive's first-quarter 2025 results reflect a year-over-year improvement in premiums.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nWe recently published a list of 10 Dirt Cheap Stocks To Invest In Now. In this article, we are going to take a look at where Citigroup Inc. (NYSE:C) stands against other dirt cheap stocks to invest in now. Investor’s Guide to Navigating the Volatilitc The stock market has been experiencing volatility and has quickly […]\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Bank of America Corporation (NYSE:BAC) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the […]\n(Bloomberg) -- Beleaguered stock bulls are getting an encouraging sign from the people who know the companies best.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?Trump Signs Executive Orders on Federal Purchasing, Office SpaceLA County Floats Leaner Budget Burdened by Fire and Legal CostsCorporate insiders scooped up shares of their own companies at the fastest pace in 16 months as the S&P 500 sank in March, and they kept buying at an elevated clip as the rout accelerated th\nZacks.com users have recently been watching Shopify (SHOP) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]