[
  {
    "title": "2025-04-14 07-14_Zacks Value Trader Highlights_ Exxon Mobil, Chevron and EOG Resources",
    "date": "",
    "content": "Title: Zacks Value Trader Highlights_ Exxon Mobil, Chevron and EOG Resources\nDate: 2025-04-14 07:14\nURL: https://finance.yahoo.com/news/zacks-value-trader-highlights-exxon-071400262.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChicago, IL – April 14, 2025 – Zacks Value Trader is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here: https://www.zacks.com/stock/news/2445093/energy-stocks-take-a-dive-values-or-traps\nWelcome to Episode #401 of the Value Investor Podcast.\n \n(0:15) - Can You Find Value In The Energy Industry or Are They Traps?\n(6:30) - Tracey Takes A Deep Dive Into 3 Stocks To Consider For Your Portfolio\n(32:20) - Episode Roundup: XOM, CVX, EOG\nPodcast@Zacks.com\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\nIn April 2025, after the Liberation Day tariffs were put into place by the United States, crude oil plunged. WTI traded down to $56 a barrel and has been gyrating between $55 and $65 ever since.\nWhile lower oil prices can mean good news for consumers at the pump, it’s bad news for the energy producers who are unhedged and have certain breakeven levels.\nThe oil and natural gas stocks have gotten hammered due to falling commodity prices and the uncertainty from the tariff turbulence of 2025. Although oil escaped direct American tariffs.\nEnergy companies are lumped into different categories within the oil industry. In this podcast, Tracey talks about “Big Oil” which are the large, integrated oil companies and the American explorers and producers, or the “E & Ps.”\nThe Integrated Oil stocks, as an industry, are down just 3.9% year-to-date. But the American E&Ps, as an industry, are now down 27.8% on the year.\nThe E&Ps, which do not have refining, chemicals, or other divisions to offset their production, are much more volatile when oil sells off.\nJust because a stock sells-off and now has a low price-to-earnings (P/E) ratio, doesn’t mean that it’s a true value in the classical sense of the word.\nRemember, a true value stock is cheap on a P/E basis, but also has rising earning estimates.\nAre the energy stocks cheap, or just traps?\nExxon Mobil is a large American integrated oil company. Shares of Exxon are down 7.1% year-to-date but have finally started sinking in the last month, falling 10.6% in that time.\nExxon appears cheap with a forward price-to-earnings (P/E) ratio of just 14.1. The 2025 Zacks Consensus Estimate is looking for $7.13 but that’s 8.5% under the $7.79 Exxon made last year. One earnings estimate has been revised higher for 2025 and 2 lower in the last week.\nExxon is a dividend all-star, with its dividend currently yielding 3.9%.\nIs Exxon Mobil a value or a trap in 2025?\nChevron is also a large, American integrated oil company. Shares of Chevron are down 6.8% year-to-date but have been hit harder over the last month than Exxon. It’s down 14.3% during that time. But there have been dramatic one-day swings the last week.\nChevron is cheap. It has a forward P/E of 13.3. The Zacks Consensus is looking for $10.30 in 2025, which is earnings growth of 2.5% as it made $10.05 in 2024.\nChevron also pays an attractive dividend, yielding 4.8%.\nIs Chevron a value after the sell-off or a trap?\nEOG Resources is a large cap American exploration and production company. It produces in key basins including the Delaware Basin, Eagle Ford, and Dorado Play. EOG Resources has a strategy of returning at a minimum of 70% of annual free cash flow to shareholders.\nShares of EOG Resources have fallen 14.7% year-to-date but have really taken it on the chin in the last month, declining 16.9%. It’s cheap, with a forward P/E of 9.5. A P/E under 10 is usually considered a dirt-cheap stock.\nThe Zacks Consensus Estimate for 2025 is looking for $11.09. EOG Resources made $11.62 last year so that is a decline of 4.6%.\nEOG Resources is currently paying a dividend yielding 3.5%.\nIs EOG Resources a value or a trap in 2025?\nTune into this week’s podcast to find out.\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nTracey Ryniec is the Value Stock Strategist for Zacks.com. She is also the Editor of the Insider Trader and Value Investor services. You can follow her on twitter at @TraceyRyniec and she also hosts the Zacks Market Edge Podcast on iTunes.\nZacks.com is a property of Zacks Investment Research, Inc., which was formed in 1978. The later formation of the Zacks Rank, a proprietary stock picking system; continues to outperform the market by nearly a 3 to 1 margin. The best way to unlock the profitable stock recommendations and market insights of Zacks Investment Research is through our free daily email newsletter; Profit from the Pros.  In short, it's your steady flow of Profitable ideas GUARANTEED to be worth your time!  Click here for your free subscription to Profit from the Pros.\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com/performance\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nEOG Resources, Inc. (EOG) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 08-47_BP Discovers Oil at U.S. Far South Prospect in Gulf of Mexico",
    "date": "",
    "content": "Title: BP Discovers Oil at U.S. Far South Prospect in Gulf of Mexico\nDate: 2025-04-14 08:47\nURL: https://finance.yahoo.com/m/debcd50b-6682-3d76-a2e2-588b8ddc8e05/bp-discovers-oil-at-u.s.-far.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nInitial data shows high-quality reservoirs and a potentially commercial volume of hydrocarbons, the company said.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where 3M Company (NYSE:MMM) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the end of […]\nAccretive oil and gas prices are likely to have aided upstream operations of BP and SLB in the first quarter of 2025.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nHere are our top picks for the best online brokers for bonds.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 11-44_Chevron's Venezuela Oil Exports Stalled by PDVSA Amid Sanctions",
    "date": "",
    "content": "Title: Chevron's Venezuela Oil Exports Stalled by PDVSA Amid Sanctions\nDate: 2025-04-14 11:44\nURL: https://finance.yahoo.com/news/chevrons-venezuela-oil-exports-stalled-114400347.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChevron Corporation’s CVX operations in Venezuela have hit a major roadblock as state-owned oil firm PDVSA abruptly canceled export authorizations for several of its vessels due to payment uncertainty amid the hardening of U.S. sanctions on the OPEC-member country. This move has left at least two tankers loaded with Venezuelan crude stranded at the port. In contrast, four others were forced to depart empty, indicating a significant intensification in the U.S.-Venezuela energy standoff.\nThe turmoil follows the Trump administration’s recent decision to revoke Chevron’s license to operate in Venezuela. Although the license was set to expire with a wind-down period ending May 27, PDVSA has begun enforcing restrictions ahead of schedule. These actions have derailed the company’s plans to export oil, even for cargoes that were already loaded and awaiting departure.\nTwo Chevron-chartered tankers, named Dubai Attraction and Carina Voyage, remained idle in Venezuelan waters, pending authorization to return their cargoes. These shipments had been formally declared to Venezuela’s customs authority, and now require new clearance to be unloaded or rerouted. Meanwhile, four other Chevron vessels — Pegasus Star, Ionic Anax, Calypso and Sea Jaguar — were denied loading access altogether.\nCarina Voyager was en route to Chevron's Pascagoula refinery in Mississippi, while Dubai Attraction was slated to transfer its cargo to the Valero Energy-chartered tanker, Cap Corpus Christi, near Aruba. However, the Cap Corpus Christi departed for the United States on Friday only partially loaded, as it was unable to complete the ship-to-ship transfer.\nThe Venezuelan vice president placed the blame entirely on U.S. sanctions. In a Telegram post, the nation cited that Chevron, currently carrying a Zacks Rank #3 (Hold), was not able to pay PDVSA due to the U.S.-driven economic war, thus prompting the return of crude shipments. The shipments are now being rerouted to other international markets, suggesting Venezuela’s intention to gain some alternative buyers.\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nChevron’s joint ventures in Venezuela produce roughly 25% of the country’s total oil output, which reached an average of 250,000 barrels per day to the United States in early 2025. The sudden halt in its exports not only jeopardizes this flow but also threatens to deepen Venezuela’s economic and political isolation.\nU.S. sanctions had earlier stifled Venezuela’s crude trade with China due to the imposition of a 25% secondary tariff on any country that traded with the United States. However, Reuters reports indicate that shipments to China have resumed, although slowly and cautiously.\nThe recent moves also affect other major energy companies. Licenses previously granted to Shell plc SHEL and BP p.l.c. BP have also been revoked, disrupting planned offshore gas projects and a license for French oil firm Maurel & Prom to operate in Venezuela. European firms such as Eni S.p.A. E and Repsol, S.A. REPYY are no longer allowed to receive oil from Venezuelan state oil firm PDVSA in lieu of payments. The Trump administration’s broader objective appears to be pressuring president Nicolás Maduro by tightening control over Venezuela’s largest revenue source — its vast crude reserves.\nSHEL, a London-based oil supermajor and BP, an integrated energy company, had plans to send gas to Trinidad and Tobago through a natural gas project that operated offshore Venezuela. However, the U.S. sanctions gave a major blow to the plans of SHEL and BP.\nBoth BP and SHEL have been hit hard by the withdrawal of the licenses for two gas fields in Venezuelan waters that they plan to develop with Trinidad and Tobago and its National Gas Company.\nIn March 2024, REPYY and E also received a notification from the U.S. authorities regarding their revocation of oil licenses for operations in Venezuela.\nRepsol SA explores, develops and produces crude oil products and natural gas, and transports petroleum products and liquefied petroleum gas.\nItaly-based Eni SpA is among the leading integrated energy players in the world. The upstream operations include the exploitation and production of oil and natural gas resources.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nEni SpA (E) : Free Stock Analysis Report\nRepsol SA (REPYY) : Free Stock Analysis Report\nShell PLC Unsponsored ADR (SHEL) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nFormer Australian trade minister Andrew Robb says Canberra should not negotiate with Washington as President Trump attempts to reorder global trade. Robb discussed the fears of a broadening trade war on 'Bloomberg: The Asia Trade'.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 13-16_These Were the 2 Top-Performing Stocks in the Dow Jones Industrial Average in March 2025",
    "date": "",
    "content": "Title: These Were the 2 Top-Performing Stocks in the Dow Jones Industrial Average in March 2025\nDate: 2025-04-14 13:16\nURL: https://www.fool.com/investing/2025/04/14/these-were-the-2-top-performing-stocks-in-the-dow/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=5608733a-69bb-438d-976d-0de9dcfd2f6a&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nMarch 2025 might seem like ages ago in market years, as the Trump tariffs have rocked the market like few things before it. However, the trends in March are not so different from what's happening now, as consumer sentiment was rapidly weakening and fears of a recession were mounting before the tariff announcement.\nLet's take a look at the two best-performing Dow Jones Industrial Average (^DJI -1.73%) companies to see if they're worth buying today.\nImage source: Getty Images.\nUnitedHealth Group (UNH 0.30%) is one of the most resilient stocks on the market. Healthcare is considered a recession-proof industry, but health insurance is even more unaffected by the economy because people need coverage regardless.\nIt's not a surprise, then, that investors have piled into the stock in March and have continued to do so through the tariff-related chaos of April.\nThere was no major company-specific news out on UnitedHealth in March, and investors seem to be returning to the stock after it tumbled following the assassination of one of its executives in December 2024.\nUnitedHealth has been one of the rare winners on the stock market in April, gaining 15% thanks to a 5.06% increase in Medicare Advantage benchmarks and its reputation as a port in a storm during turbulent market times.\nChevron (CVX 0.65%) might seem like a surprise on this list as the energy sector is typically highly sensitive to the economic cycle.\nThe source of Chevron's gains was a surprising one, as Reuters reported that the company was angling for a piece of the data center market, developing the sites and supplying the electricity for facilities. \nData center demand is surging along with AI, and the energy to power it is at a premium.\nHowever, while that was a smart strategic move, it wasn't enough to keep the stock climbing in April as it fell sharply after tariffs were announced. Chevron will continue to be sensitive to the health of the global economy and oil prices.\n\n \n\nBefore you buy stock in UnitedHealth Group, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and UnitedHealth Group wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nJeremy Bowman has no position in any of the stocks mentioned. The Motley Fool recommends UnitedHealth Group. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-14 18-50_OPEC+ Slashes Oil Demand Forecast as Trade War Drags on Growth",
    "date": "",
    "content": "Title: OPEC+ Slashes Oil Demand Forecast as Trade War Drags on Growth\nDate: 2025-04-14 18:50\nURL: https://finance.yahoo.com/news/opec-slashes-oil-demand-forecast-185052793.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nOPEC and its allies have revised their oil demand projections downward for both 2025 and 2026, citing mounting global trade tensions and tariffs as key risks to economic growth.\nThe group now expects global crude demand to rise by 1.3 million barrels per day over the next two years roughly 150,000 barrels per day lower than previous forecasts. OPEC+ also adjusted its global GDP growth outlook, trimming expectations to 3% for 2025 and 3.1% for 2026, each down by 0.1 percentage point.\nThe global economy showed a steady growth trend at the beginning of the year, the organization said in its monthly oil market report. However, recent trade-related dynamics have introduced higher uncertainty to the short-term global economic growth outlook.\nAmong the factors behind the downgrade, OPEC+ pointed to U.S. President Donald Trump's newly imposed 145% tariffs on China the world's largest crude oil importer as a significant headwind for energy demand.\nDespite the lowered outlook, the oil-producing bloc has agreed to ramp up output starting in May. Analysts warn this move could flood the market with excess supply at a time when consumption is weakening.\nSince the tariff announcement on April 2, oil prices have fallen sharply. Brent crude is currently trading around $64.68 per barrel, down 13% since the start of the month and off another 1% on April 14.\nMajor oil producers have not been spared. Chevron (NYSE:CVX), Shell (NYSE:SHEL), and BP (NYSE:BP) have all seen their shares drop over 10% in the past month.\nThis article first appeared on GuruFocus.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nLockheed (LMT) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 19-07_Chevron Expected to Post 'Strong' Underlying Results in Q1, UBS Says",
    "date": "",
    "content": "Title: Chevron Expected to Post 'Strong' Underlying Results in Q1, UBS Says\nDate: 2025-04-14 19:07\nURL: https://finance.yahoo.com/news/chevron-expected-post-apos-strong-190725111.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChevron (CVX) is expected to report \"strong underlying results\" in fiscal Q1 even though divestiture\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 21-15_Top Analyst Reports for Bank of America, Chevron & Stryker",
    "date": "",
    "content": "Title: Top Analyst Reports for Bank of America, Chevron & Stryker\nDate: 2025-04-14 21:15\nURL: https://finance.yahoo.com/news/top-analyst-reports-bank-america-211500618.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMonday, April 14, 2025The Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Bank of America Corporation (BAC), Chevron Corporation (CVX) and Stryker Corporation (SYK), as well as two micro-cap stocks Value Line, Inc. (VALU) and Sypris Solutions, Inc. (SYPR). The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.You can see all of today’s research reports here >>>Today's Featured Research ReportsShares of Bank of America have gained +2.5% over the past year against the Zacks Financial - Investment Bank industry’s gain of +20.4%. The company’s volatile nature of the trading business is a major headwind. Despite an impressive performance since 2022, it is expected to normalize going forward. This is likely to hamper fee income growth. The Zacks analyst project non-interest income to rise only 3.4% in 2025. Continued investments in the franchise will keep the company’s expenses elevated. We expect total non-interest expenses to rise 3% this year. While high funding costs are still a woe, the company’s net interest income (NII) will be positively impacted by higher rates for longer. The Zacks analyst expects NII to record a CAGR of 5.3% over the next three years. Plans to open financial centers in new and existing markets and improve digital capabilities will aid the top line. We project total revenues to grow 4.8% in 2025.(You can read the full research report on Bank of America here >>>)Chevron’s shares have declined -6.2% over the past six months against the Zacks Oil and Gas - Integrated - International industry’s decline of -11.9%. The company being a fully integrated energy firm, is positioned as one of the top global integrated oil firms, set for sustainable production growth, particularly due to its dominant position in the lucrative Permian Basin. Further, the planned acquisition of Hess Corporation is expected to significantly strengthen Chevron's presence in oil-rich Guyana. However, the company is grappling with high sensitivity to oil fluctuations and relatively expensive valuation. Another concern is the weak margins on refined products that forced its downstream segment to its first quarterly loss in 4 years. Considering these factors, investors are advised to wait for a better entry point.(You can read the full research report on Chevron here >>>)Shares of Stryker have gained +4.3% over the past year against the Zacks Medical - Products industry’s gain of +5.5%. The company is poised for growth, driven by rising demand for robotic-assisted procedures, hospital capital expenditures and international expansion. The Mako SmartRobotics platform fuels adoption, while acquisitions like Inari Medical and Vertos Medical enhance the portfolio. Stryker is actively integrating new technologies such as AI-driven imaging and smart surgical systems to improve patient outcomes and maintain its competitive edge. Pricing improvements and a strong hospital order book support 2025 growth. However, foreign exchange volatility and acquisition-related margin pressures may impact earnings. Supply chain disruptions and rising costs could strain profitability. Intensifying competition in robotics and MedTech demands constant innovation. Macroeconomic risks, including potential downturns in healthcare spending and regulatory shifts, add uncertainty.(You can read the full research report on Stryker here >>>)Value Line’s shares have outperformed the Zacks Financial - Investment Management industry over the past year (+10% vs. +6.4%). This microcap company with market capitalization of $370.23 million have robust cash generation, with cash balances rising to $27.1 million from $6.1 million YoY, enhances liquidity and supports dividends, buybacks, and growth investments. EAM Trust income surged 47.7% to $13.8 million, driven by AUM growth to $5 billion, providing a rising, diversified passive income stream. The company maintains disciplined capital returns, paying $0.90/share in dividends and repurchasing shares, with $0.9 million authorization remaining. Portfolio gains doubled to $3.6 million, bolstering earnings. Strong branding and diversified offerings serve both retail and institutional clients, supporting market position. However, core publishing revenue declined to $26.7 million, and customer concentration (30% from one client) heightens risk. Operating costs and taxes rose, further pressuring margins, while limited international presence (~2% of revenues) increases vulnerability to U.S. market shifts.(You can read the full research report on Value Line here >>>)Shares of Sypris Solutions have gained +3.6% over the past year against the Zacks Electronics - Miscellaneous Services industry’s gain of +36.3%. This microcap company with market capitalization of $36.37 million benefits from an extended long-term supply agreement with a global OEM, securing stable revenues as a sole-source supplier of Ultra Axle Shafts. Sypris Solutions’ diversified presence across automotive, energy, and industrial markets reduces risk and positions it to capitalize on growth trends in heavy-duty vehicles and energy infrastructure. Sypris Solutions is also aligned with growth in aerospace and defense electronics, leveraging its capabilities in high-precision components to meet rising demand. Expansion into the Asia-Pacific region aligns with high-growth markets, leveraging regional investments in defense and infrastructure. However, liquidity challenges constrain financial flexibility. Rising costs and reliance on cyclical markets such as heavy vehicles and oil and gas exacerbate margin sensitivity. Competitive pressures in aerospace further heighten vulnerability.(You can read the full research report on Sypris Solutions here >>>)Other noteworthy reports we are featuring today include Pfizer Inc. (PFE), Ormat Technologies, Inc. (ORA) and ONEOK, Inc. (OKE).Director of ResearchSheraz MianNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nToday's Must Read\nBranch Openings, High Rates Aid BofA (BAC), Fee Income Ails\nPermian Strength Supports Chevron's (CVX) Production Growth\nDiversified Product Portfolio Drives Stryker's (SYK) Prospects\nFeatured Reports\nPfizer's (PFE) New Products Can Drive Sales Growth in 2025Pfizer's non-COVID revenues improved in 2024, driven by its key drugs like Vyndaqel, new launches and newly acquired products from Seagen. The trend should continue in 2025, per the Zacks analyst.\nInvestments Aid Ormat (ORA), Weak Solvency Pose ThreatPer the Zacks analyst, Ormat Technologies' investment in enhancing manufacturing capacity should boost growth. Yet, its weak solvency position threatens the stock's ability to pay off its debt.\nMidstream Assets & Higher Fee-Based Earnings Aid ONEOK (OKE)Per the Zacks analyst, ONEOK is set to benefit from fee-based earnings and midstream assets located in productive regions. Investments made to expand pipelines will drive its performance.\nBroadridge (BR) Gains From Itiviti Buyout, Competition HighPer the Zacks analyst, the Itiviti acquisition has boosted Broadridge's global technology and operations segment. High competition from other players is an overhang.\nAcquisition of Edmunds Aids CarMax (KMX), High Debt AilsPer the Zacks analyst, the acquisition of Edmunds has bolstered CarMax's position in the used auto market. However, its high long-term debt-to-capital ratio remains a concern.\nWatts Water (WTS) Gains on Acquisitions Amid Europe WeaknessPer the Zacks analyst, Watts Water gains from solid acquisitions, cost-cutting efforts and a strong balance sheet, though fewer shipping days and Europe weakness remain concerns.\nSolid Unit Expansion Aid Choice Hotels (CHH), Macro Woes AilPer the Zacks analyst, Choice Hotels benefits from its unit growth strategy, hotel conversions and franchise business. However, uncertain macroeconomic environments are a concern.\nNew Upgrades\nStarz Subscriber Growth Aids Lionsgate's (LGF.A) ProspectsPer the Zacks analyst, increased premium programming, along with higher Starz subscriber growth, is likely to aid Lionsgate's top line growth.\nEverQuote (EVER) Boasts Revenue Growth, Solid Balance SheetPer the Zacks analyst, consumer traffic, quote request volume and innovative advertiser products and services drive EverQuote revenues. Its strong balance sheet enables it to fulfill debt obligations.\nAcquisition of Nissens Boosts Standard Motor (SMP) ProspectsPer the Zacks analyst, the buyout of Nissens has helped Standard Motor expand its geographic presence and establish a significant global growth platform, which will boost its top-line growth in 2025.\nNew Downgrades\nCampbell's (CPB) Gross Margins Hurt by Cost InflationPer the Zacks analyst, cost inflation hurt Campbell's gross margin. In the second quarter fiscal 2025, adjusted gross profit margin fell 100 basis points, hit by cost inflation and supply-chain costs.\nRising Expenses, Low Liquidity Hurt Carlyle's (CG) GrowthPer the Zacks analyst, Carlyle's rising cost base will likely hurt bottom-line growth. Also, with limited liquidity, the company might not be able to meet its near-term debt obligations.\nMacroeconomic Pressures, Fierce Rivalry Ails Illumina (ILMN)The Zacks analyst is concerned with Illumina's robust market opportunity in China taking a hit after MOFCOM bans imports of its NGS sequencers. Intense competitive landscape adds to the worry.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nPfizer Inc. (PFE) : Free Stock Analysis Report\nStryker Corporation (SYK) : Free Stock Analysis Report\nONEOK, Inc. (OKE) : Free Stock Analysis Report\nOrmat Technologies, Inc. (ORA) : Free Stock Analysis Report\nSypris Solutions, Inc. (SYPR) : Free Stock Analysis Report\nValue Line, Inc. (VALU): Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other best oil stocks. After an encouraging start to the year, the energy sector is once again lagging behind the overall […]\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 08-14_These Oil Stocks Can Thrive Even With Crude Prices Sinking",
    "date": "",
    "content": "Title: These Oil Stocks Can Thrive Even With Crude Prices Sinking\nDate: 2025-04-15 08:14\nURL: https://www.fool.com/investing/2025/04/15/these-oil-stocks-can-thrive-even-with-crude-prices/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=7d59963c-b4dc-4956-8b7f-004bba320292&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nOil prices have tumbled this year. WTI, the primary U.S. oil price benchmark, has plunged from about $80 a barrel in early January to around $60 a barrel. The culprit has been the concern that tariffs will slow the global economy, driving down demand for crude oil. \nLower crude prices will impact oil company cash flows. However, some oil stocks are in a better position to navigate the lower oil prices than others due to their abundant low-cost oil resources. Three oil companies that can still thrive in the current environment are Devon Energy (DVN 2.65%), ConocoPhillips (COP 0.69%), and Chevron (CVX 0.65%). \nDevon Energy has a premier multibasin U.S. onshore resource portfolio. The company produces oil and gas from the Rockies, Delaware Basin, Anadarko Basin, and Eagle Ford. That diversification helps reduce risk and enhances its long-term growth profile. \nThe Delaware Basin, which runs through west Texas and southeast New Mexico, is the crown jewel of Devon Energy's portfolio. The company gets 56% of its production from that world-class oil resource. That position will fuel the oil company for years to come. Devon has thousands of remaining drilling locations with an average breakeven level of $40 per barrel. Because of that, it can still make a lot of money drilling in the region at the current oil price point. \nThe company's low-cost resources position it to produce a lot of cash even in the current environment. Devon was on track to make over $3 billion in free cash flow this year when WTI was above $70 a barrel during the first quarter. While that number will decline if crude remains around $60, Devon will still produce a lot of excess cash this year. It plans to return about 70% of that money to shareholders via its dividend and share repurchases, retaining the rest to strengthen its already rock-solid balance sheet. \nConocoPhillips has a global portfolio of low-cost resources. The company held about 20 billion barrels of oil equivalent resources with a supply cost below $40 a barrel for WTI. It added even more low-cost resources last year when it acquired Marathon Oil. That deal topped off its tank by adding more than 2 billion barrels of resources with an average cost of supply below $30 per barrel for WTI. \nThe company's low-cost resources position it to produce a lot of cash in the current environment. ConocoPhillips initially expected to generate enough excess free cash flow this year to return $10 billion to shareholders via dividends and repurchases. While lower oil prices will impact the amount of excess free cash flow it produces this year, it could still achieve that capital return target thanks to its cash-rich balance sheet. ConocoPhillips ended last year with $6.4 billion of cash and short-term investments and another $1 billion of long-term investments. Meanwhile, it's working toward generating an additional $2 billion in cash via non-core asset sales. \nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nChevron has a globally integrated energy business. That integration between upstream (oil and gas production) and downstream (refining and chemicals) helps mute some of the impact of lower oil prices. The company also has a very low-cost global resource portfolio. \nThe energy giant has stress-tested its business for lower oil prices. Chevron forecasts that it can produce enough cash flow from operations to cover its high-yielding dividend (currently over 5%) and capital spending program at $50 oil through 2027 with room to spare. Meanwhile, the company has the balance sheet capacity to buy back shares at the low end of its $10 billion-$20 billion annual target range during that period at that price point. \nChevron is working to further enhance its low-cost resource portfolio by acquiring Hess. The deal would add a world-class position in offshore Guyana and other high-quality assets to diversify and enhance Chevron's portfolio. It would further bolster the company's low-cost supplies, putting it in an even stronger position to thrive during periods of lower oil prices. \nThe recent downdraft in crude prices will impact the cash flows that oil companies produce. However, Devon Energy, ConocoPhillips, and Chevron have very low-cost operations and strong balance sheets. Because of that, they can still thrive at lower prices by producing lots of cash that they can return to investors through dividends and share repurchases. That makes them lower-risk ways to invest in the oil patch. \n\n \n\nBefore you buy stock in Devon Energy, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Devon Energy wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nMatt DiLallo has positions in Chevron and ConocoPhillips. The Motley Fool has positions in and recommends Chevron. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-15 08-23_Get Income Like Warren Buffett_ 3 Dividend Stocks in Berkshire Hathaway's Portfolio That Pay You Bac",
    "date": "",
    "content": "Title: Get Income Like Warren Buffett_ 3 Dividend Stocks in Berkshire Hathaway's Portfolio That Pay You Bac\nDate: 2025-04-15 08:23\nURL: https://www.fool.com/investing/2025/04/15/get-income-like-warren-buffett-3-dividend-stocks-i/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=ec7dd17a-085c-47a6-9333-83c536df8727&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nWarren Buffett is famous because of the long-term success he has achieved running Berkshire Hathaway. But there are two interesting things about this company. First, it is run kind of like a mutual fund. Second, it doesn't pay dividends despite the fact that Buffett often invests in dividend-paying companies. Here's why that matters and why you might want to buy one of these three dividend payers he owns.\nOne of the core tenets of Buffett's investment approach is to buy good companies when they are attractively priced. But the next step is to hold for the long term so he can benefit from the growth of the businesses he buys. One of the nuances that gets lost in this is that he uses the cash generated from the companies he owns outright or owns in Berkshire Hathaway's common stock portfolio to reinvest in his business. That allows him to compound those cash flows over time and this enhances the returns he generates for investors.\nImage source: The Motley Fool.\nFrom a big-picture perspective, you can do the same thing by dividend reinvesting. All it takes is a phone call to your broker, or, more likely, a button press on your broker's website or in its app. And in one quick and easy move you'll be investing more like Warren Buffett.\nBut what if you want to invest even more like Oracle of Omaha? Well, three dividend-paying stocks he owns today are Coca-Cola (KO -0.19%), Chevron (CVX 0.65%), and Kraft Heinz (KHC -2.00%). Here's a look at these three Buffett stocks to see if they'll be a good fit for your Buffett style dividend reinvesting.\nCoca-Cola is a very easy company to like. It is the industry-leading beverage company with a globally diversified business. It is large enough to have economies of scale in distribution, marketing, and research and development, and it can, and does, act as an industry consolidator. The dividend has been increased annually for over five decades, making it a Dividend King. The dividend yield is 2.9%, which is well above the market's yield today.\nFor conservative dividend investors it is a solid choice. The only problem is that the stock looks a little expensive at the moment, with both the price-to-sales and price-to-earnings ratios above their five-year averages. However, if you are willing to pay a premium for income security, Coca-Cola could be a good fit for your portfolio.\nAnother industry leader in Buffett's portfolio is energy giant Chevron. It is one of the largest integrated energy companies you can buy, with a business that spans from the upstream (energy production) through the midstream (pipelines) and into the downstream (chemicals and refining). This diversification helps to soften the impact of the inherent swings in the commodity-driven energy sector. On top of that, the company has a very strong balance sheet, which allows it to take on leverage during industry downturns to support its business and dividend.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nThe dividend, notably, has been increased annually for 38 years thanks largely to Chevron's solid business model. That said, energy price volatility still has a material impact on the stock price. Right now energy prices are weakening and the dividend yield is a very attractive 4.7%. The yield could go higher if oil prices continue to fall. But the history here suggests that the dividend will continue to get paid even if oil prices continue to fall. You could try to time your entry into Chevron, but the truth is it is a strong energy choice at just about any point of the energy cycle.\nThe last big dividend stock on this list is Kraft Heinz. It is a tough consumer staples stock to love when you compare it to Coca-Cola. Yes, Kraft Heinz's dividend yield is a lofty 5.3%, but the dividend has been static since it was cut in 2019. The big story is the business overhaul that's taking place.\nThe company was created via the merger between Kraft and Heinz. The goal at that time was to cut costs to boost profitability. But cutting costs can only take a company so far before it needs to refocus on growth. That's what Kraft Heinz has been doing, after turning to a new management team. But the results haven't been particularly impressive, which is why the dividend has been stuck in neutral for so long. If you consider this high-yield food maker you'll need to go in understanding that it is a turnaround story that will require extra monitoring. It's probably only appropriate for more aggressive investors.\nWhile Buffett owns Coca-Cola, Chevron, and Kraft Heinz in his Berkshire Hathaway portfolio, you don't actually need to own these specific stocks to benefit from dividend reinvestment. These are just three stocks to get you thinking about the real investment tool that's important here, which is the reinvestment of dividends so you can compound your returns over time -- just like Buffett does with his investments.\n\n \n\nBefore you buy stock in Chevron, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chevron wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nReuben Gregg Brewer has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Berkshire Hathaway and Chevron. The Motley Fool recommends Kraft Heinz. The Motley Fool has a disclosure policy.\nThis tech could reach 80 trillion. Imagine a technology worth over 26 Nvidias.\nWhat in the world could be worth 26 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-15 10-46_The Zacks Analyst Blog Bank of America, Chevron, Stryker, Value Line and Sypris",
    "date": "",
    "content": "Title: The Zacks Analyst Blog Bank of America, Chevron, Stryker, Value Line and Sypris\nDate: 2025-04-15 10:46\nURL: https://finance.yahoo.com/news/zacks-analyst-blog-bank-america-104600485.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChicago, IL – April 15, 2025 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include Bank of America Corporation BAC, Chevron Corporation CVX and Stryker Corporation SYK, as well as two micro-cap stocks Value Line, Inc. VALU and Sypris Solutions, Inc. SYPR.\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Bank of America Corporation, Chevron Corporation and Stryker Corporation, as well as two micro-cap stocks Value Line, Inc. and Sypris Solutions, Inc.The Zacks microcap research is unique as our research content on these small and under-the-radar companies is the only research of its type in the country.\nThese research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\nYou can see all of today’s research reports here >>>\nShares of Bank of America have gained +2.5% over the past year against the Zacks Financial - Investment Bank industry’s gain of +20.4%. The company’s volatile nature of the trading business is a major headwind. Despite an impressive performance since 2022, it is expected to normalize going forward. This is likely to hamper fee income growth.\nThe Zacks analyst project non-interest income to rise only 3.4% in 2025. Continued investments in the franchise will keep the company’s expenses elevated. We expect total non-interest expenses to rise 3% this year. While high funding costs are still a woe, the company’s net interest income (NII) will be positively impacted by higher rates for longer.\nThe Zacks analyst expects NII to record a CAGR of 5.3% over the next three years. Plans to open financial centers in new and existing markets and improve digital capabilities will aid the top line. We project total revenues to grow 4.8% in 2025.\n(You can read the full research report on Bank of America here >>>)\nChevron’s shares have declined -6.2% over the past six months against the Zacks Oil and Gas - Integrated - International industry’s decline of -11.9%. The company being a fully integrated energy firm, is positioned as one of the top global integrated oil firms, set for sustainable production growth, particularly due to its dominant position in the lucrative Permian Basin.\nFurther, the planned acquisition of Hess Corporation is expected to significantly strengthen Chevron's presence in oil-rich Guyana. However, the company is grappling with high sensitivity to oil fluctuations and relatively expensive valuation.\nAnother concern is the weak margins on refined products that forced its downstream segment to its first quarterly loss in 4 years. Considering these factors, investors are advised to wait for a better entry point.\n(You can read the full research report on Chevron here >>>)\nShares of Stryker have gained +4.3% over the past year against the Zacks Medical - Products industry’s gain of +5.5%. The company is poised for growth, driven by rising demand for robotic-assisted procedures, hospital capital expenditures and international expansion. The Mako SmartRobotics platform fuels adoption, while acquisitions like Inari Medical and Vertos Medical enhance the portfolio.\nStryker is actively integrating new technologies such as AI-driven imaging and smart surgical systems to improve patient outcomes and maintain its competitive edge. Pricing improvements and a strong hospital order book support 2025 growth.\nHowever, foreign exchange volatility and acquisition-related margin pressures may impact earnings. Supply chain disruptions and rising costs could strain profitability. Intensifying competition in robotics and MedTech demands constant innovation. Macroeconomic risks, including potential downturns in healthcare spending and regulatory shifts, add uncertainty.\n(You can read the full research report on Stryker here >>>)\nValue Line’s shares have outperformed the Zacks Financial - Investment Management industry over the past year (+10% vs. +6.4%). This microcap company with market capitalization of $370.23 million have robust cash generation, with cash balances rising to $27.1 million from $6.1 million YoY, enhances liquidity and supports dividends, buybacks, and growth investments. EAM Trust income surged 47.7% to $13.8 million, driven by AUM growth to $5 billion, providing a rising, diversified passive income stream.\nThe company maintains disciplined capital returns, paying $0.90/share in dividends and repurchasing shares, with $0.9 million authorization remaining. Portfolio gains doubled to $3.6 million, bolstering earnings. Strong branding and diversified offerings serve both retail and institutional clients, supporting market position.\nHowever, core publishing revenue declined to $26.7 million, and customer concentration (30% from one client) heightens risk. Operating costs and taxes rose, further pressuring margins, while limited international presence (~2% of revenues) increases vulnerability to U.S. market shifts.\n(You can read the full research report on Value Line here >>>)\nShares of Sypris Solutions have gained +3.6% over the past year against the Zacks Electronics - Miscellaneous Services industry’s gain of +36.3%. This microcap company with market capitalization of $36.37 million benefits from an extended long-term supply agreement with a global OEM, securing stable revenues as a sole-source supplier of Ultra Axle Shafts.\nSypris Solutions’ diversified presence across automotive, energy, and industrial markets reduces risk and positions it to capitalize on growth trends in heavy-duty vehicles and energy infrastructure. Sypris Solutions is also aligned with growth in aerospace and defense electronics, leveraging its capabilities in high-precision components to meet rising demand. Expansion into the Asia-Pacific region aligns with high-growth markets, leveraging regional investments in defense and infrastructure.\nHowever, liquidity challenges constrain financial flexibility. Rising costs and reliance on cyclical markets such as heavy vehicles and oil and gas exacerbate margin sensitivity. Competitive pressures in aerospace further heighten vulnerability.\n(You can read the full research report on Sypris Solutions here >>>)\nSince 2000, our top stock-picking strategies have blown away the S&P's +7.7% average gain per year. Amazingly, they soared with average gains of +48.4%, +50.2% and +56.7% per year.\nToday you can access their live picks without cost or obligation.\nSee Stocks Free >>\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Previewreports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\nMedia Contact\nZacks Investment Research\n800-767-3771 ext. 9339\nsupport@zacks.com\nhttps://www.zacks.com\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance  for information about the performance numbers displayed in this press release.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBank of America Corporation (BAC) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nStryker Corporation (SYK) : Free Stock Analysis Report\nSypris Solutions, Inc. (SYPR) : Free Stock Analysis Report\nValue Line, Inc. (VALU): Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nCaterpillar (CAT) on Tuesday named Joseph Creed as the company's next chief executive, succeeding D.\nHalliburton (HAL) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nHAL and Nabors' collaboration in Oman delivers first automated drilling solutions, improving operational efficiency, penetration rates and reducing non-productive time.\nWe came across a bullish thesis on Stryker Corporation (SYK) on Substack by Magnus Ofstad. In this article, we will summarize the bulls’ thesis on SYK. Stryker Corporation (SYK)’s share was trading at $353.42 as of April 14th. SYK’s trailing and forward P/E were 45.54 and 26.04 respectively according to Yahoo Finance. Stryker (SYK) stands out as […]\nOceaneering International (OII) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other best oil stocks. After an encouraging start to the year, the energy sector is once again lagging behind the overall […]\nWe came across a bullish thesis on American Express Company (AXP) on Substack by Daan Rijnberk. In this article, we will summarize the bulls’ thesis on AXP. American Express Company (AXP)’s share was trading at $255.38 as of April 14th. AXP’s trailing and forward P/E were 18.23 and 16.75 respectively according to Yahoo Finance. American Express (AmEx) […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 12-25_Is Chevron Corporation (CVX) the Best Undervalued Energy Stock to Invest in Now_",
    "date": "",
    "content": "Title: Is Chevron Corporation (CVX) the Best Undervalued Energy Stock to Invest in Now_\nDate: 2025-04-15 12:25\nURL: https://finance.yahoo.com/news/chevron-corporation-cvx-best-undervalued-122559022.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 11 Best Undervalued Energy Stocks to Invest in Now. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other undervalued energy stocks.\nOn March 18, Tortoise Capital senior portfolio manager Rob Thummel appeared on CNBC’s ‘Squawk on the Street’ to discuss his outlook on the energy sector. He believes that natural gas is positioned to lead growth in the future within the energy sector. This natural gas demand is driven by electricity and energy exports. Thummel noted that the energy and tech sectors are converging due to advancements like AI and data centers. Electricity demand fuels natural gas consumption, while US energy exports help meet global needs for low-cost and low-carbon energy. He also highlighted that the US is now emerging as the largest exporter of LNG, even though it was an LNG importer just years ago. He anticipates that the US LNG exports will soon 2x in volume over time. Thummel also expects Europe and other countries to prioritize energy security and diversify their supply sources. This will ensure reliance on US energy exports.\nThummel emphasized a focus on energy infrastructure companies while discussing his specific investment strategies as they tend to be stable and have high dividend yields even in uncertain market conditions. He thinks that the certainty provided by energy infrastructure investments in an otherwise volatile market should not be neglected. Such companies generate substantial annual cash flows while maintaining disciplined financial practices.\nThummel thinks that the energy sector trades at a discount to historical valuations despite its fundamentals. This offers the potential for high returns.\nWe used the Finviz stock screener to compile a list of the top energy stocks that had a forward P/E ratio under 15 as of April 10. We then selected the 11 stocks that were the most popular among elite hedge funds and that analysts were bullish on. The stocks are ranked in ascending order of the number of hedge funds that have stakes in them, as of Q4 2024. The hedge fund data was sourced from Insider Monkey’s database which tracks the moves of over 1000 elite money managers.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nAn aerial view of an oil rig at sea, the sun glinting off its structure.\nForward P/E Ratio as of April 10: 12.92\nNumber of Hedge Fund Holders: 81\nChevron Corporation (NYSE:CVX) engages in integrated energy and chemicals operations and operates in the Upstream and Downstream segments. The Upstream segment explores, develops, and produces crude oil and natural gas. The Downstream segment refines crude oil into petroleum products, markets crude oil, refined products, & lubricants, and manufactures & markets renewable fuels.\nIn 2024, the company’s Permian Basin operations exceeded expectations with production growth of about 18% compared to the year-ago period, which was another record for Permian production. Over the past 5 years, the company has delivered a CAGR of 16% in the Permian, which has been achieved through optimized pad and drilling designs, as well as completion improvements such as triple frac techniques.\nThis allows the company to reach these production levels with 40% fewer company-operated rigs than previously planned. Chevron Corp. (NYSE:CVX) now expects Permian production to reach one million barrels of oil equivalent per day in 2025. The Permian portfolio delivers superior returns due to royalty-advantaged acreage across all sub-basins, which contributes to both the top and bottom lines.\nOverall, CVX ranks 3rd on our list of the best undervalued energy stocks to invest in now. While we acknowledge the growth potential of CVX, our conviction lies in the belief that AI stocks hold great promise for delivering high returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than CVX but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nFutures edged down Tuesday morning, with the S&P 500, Nasdaq, and Dow trading just below break-even, as investors braced for a flurry of corporate earnings. The muted open followed Monday’s tech-led rally, which briefly masked deeper market jitters tied to tariffs and macro uncertainty.\nBill Gates is one of the most famous billionaires in the world. Originally known as the tech genius who co-founded Microsoft, Gates is now the co-head of one of the largest philanthropic organizations...\nFinding stocks expected to beat quarterly earnings estimates becomes an easier task with our Zacks Earnings ESP.\nWe recently published a list of the 10 Best Machine Learning Stocks to Buy Now. In this article, we are going to take a look at where Oracle Corporation (NYSE:ORCL) stands against other machine-learning stocks. Grand View Research reported that the global machine-learning market was valued at $36.73 billion in 2022. It’s now expected to […]\nMILAN (Reuters) -Stellantis Chairman John Elkann said on Tuesday U.S. tariffs and strict European Union emissions standards were threatening the industry, as the automaker continued its search for a new chief executive.  \"With the current path of painful tariffs and overly rigid regulations, the American and European car industries are being put at risk,\" amid increased competition from China, Elkann said at the group's annual shareholders' meeting.  \"That would be a tragedy as car manufacturing is a source of jobs, innovation and strong communities,\" he said.\nThe amendment will support up to A$100m ($62.8m) in total expenditure for a second JV in the Northern Junee-Narromine Belt.\nWe recently published a list of 11 Top Performing European Stocks So Far In 2025. In this article, we are going to take a look at where ArcelorMittal S.A. (NYSE:MT) stands against other best performing European stocks to invest in. The world economy is hanging by a thread, as the macroeconomic environment consists of trade […]\nOil prices have tumbled this year.  Lower crude prices will impact oil company cash flows.  Three oil companies that can still thrive in the current environment are Devon Energy (NYSE: DVN), ConocoPhillips (NYSE: COP), and Chevron (NYSE: CVX).\nWe recently published a list of 10 Best UK Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Arm Holdings plc (NASDAQ:ARM) stands against other best UK stocks to invest in. Like most of the world, the United Kingdom is also facing slower economic growth in […]\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 13-05_OPEC Revises Oil Demand Outlook Amid Shifting Market Trends",
    "date": "",
    "content": "Title: OPEC Revises Oil Demand Outlook Amid Shifting Market Trends\nDate: 2025-04-15 13:05\nURL: https://finance.yahoo.com/news/opec-revises-oil-demand-outlook-130500538.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThe latest monthly report from OPEC shows that the cartel has revised its global oil demand growth forecast for 2025 downward for the first time since December, now projecting an increase of 1.3 million barrels per day (bpd) — 150,000 bpd less than previous estimates. The revision stems largely from slower-than-expected consumption and new U.S. tariffs that have rattled trade dynamics and economic sentiment globally. As President Trump ramps up tariff measures, including a 125% levy on Chinese imports, investors are growing increasingly wary about how this might dampen energy demand, particularly in emerging markets.Despite these geopolitical headwinds, oil prices remain relatively steady, with WTI crude hovering over $60 per barrel. However, volatility is high. Crude futures are down more than 10% so far this month, largely on fears that slowing global trade and rising supply will pressure prices. Against this backdrop, it may be wise for investors to adopt a more defensive approach—one that focuses on large, resilient players like Chevron CVX, ConocoPhillips COP, and EOG Resources EOG. These companies have the scale, balance sheets, and capital discipline to navigate turbulence, making them safer bets in uncertain times.\nOPEC’s cautious tone isn’t just based on oil-specific fundamentals. The group’s Monthly Oil Market Report also trimmed its global economic growth outlook for 2025 to 3.0%, from 3.1%, reflecting growing uncertainty in light of the ongoing trade tensions. The U.S. economy is forecasted to expand by 2.1% in 2025, while growth in the Eurozone and China is expected to slow to 0.8% and 4.6%, respectively. These projections imply weaker industrial activity and transport fuel demand—the key drivers of global oil consumption.OECD nations are forecast to contribute a mere 40,000 bpd to demand growth in 2025, while non-OECD countries, traditionally the growth engine, are expected to add around 1.25 million bpd. However, these numbers could fall if trade tensions and inflation continue to hurt energy use by consumers and businesses.\nOn the supply front, OPEC’s report showed that the broader OPEC+ group reduced output slightly in March, with total production falling by 37,000 bpd to 41.02 million bpd. Cuts from Nigeria and Iraq offset gains from Kazakhstan, which continues to exceed its output cap. However, OPEC+ is scheduled to increase output again in May, raising questions about how the additional barrels will be absorbed in a softer demand environment.Meanwhile, non-OPEC supply growth has also been revised down. OPEC now expects non-OPEC+ liquids production to rise by 900,000 bpd in 2025—100,000 bpd less than previously forecast. Most of this increase is still expected to come from the U.S., Canada, Brazil, and Argentina. However, with U.S. shale growth slowing and cost inflation a growing concern, the global supply outlook looks slightly more balanced than a month ago.\nThe near-term outlook for oil is shaped by two opposing forces: weak demand growth weighed down by economic uncertainty and trade friction, versus constrained supply growth and OPEC+ discipline. While the trade war has clouded investor sentiment, the fundamentals don’t suggest a collapse. Air travel demand remains solid, road mobility is recovering, and oil use is still expected to grow, albeit at a slower pace.Moreover, OPEC’s view remains more optimistic than other forecasters. While Goldman Sachs and Morgan Stanley have cut their demand forecasts sharply, OPEC still sees long-term demand trending higher, unlike the Paris-headquartered International Energy Agency (IEA), which anticipates a peak within the decade.For investors, the takeaway is clear: volatility is here to stay. But energy is still a vital part of the global economy, and demand isn’t going away—it’s just shifting. That’s why it’s smart to stick with strong, stable companies that generate solid cash flow.\nWith tariffs roiling markets and macro uncertainty clouding short-term outlooks, it’s prudent to hold on to proven, cash-generating energy stocks. Companies like Chevron, ConocoPhillips, and EOG Resources offer resilience and upside potential once the market regains clarity. OPEC’s latest report may signal a slower pace of demand growth, but it also confirms that oil is still very much a necessary commodity. In times like these, investors should stay patient, avoid chasing volatility, and lean on the Zacks Rank #3 (Hold) names best equipped to ride out the storm.You can see the complete list of today’s Zacks #1 Rank stocks here.Chevron: Chevron is well-run and historically a profitable big oil giant. Chevron’s upstream portfolio remains a key strength, with strong production growth from the Permian Basin and Kazakhstan. The company is targeting a 6% annual production increase through 2026, with high-margin projects driving long-term value. Chevron continues to be a strong dividend player, having increased its payout for 37 consecutive years. The latest dividend hike of 4.9% takes its yield to over 4%, making it a reliable income source for long-term investors.ConocoPhillips: Based on production and reserves, ConocoPhillips is among the leading upstream energy players in the United States. In 2024, COP produced a record 1,987 thousand barrels of oil equivalent per day globally, thanks to its strong presence in the prolific low-cost resources in the U.S. Lower 48 and Alaska, along with Asia, Australia, Africa, Europe and Canada. ConocoPhillips, with a debt-to-capitalization of 27.3%, is also demonstrating its strong financials and is well-positioned to navigate the tariff-induced market uncertainty.EOG Resources: In the United States, EOG is among the largest oil and natural gas exploration and production companies. As of year-end 2024, the firm reported total net proved developed reserves of 2,566 million barrels of oil equivalent. Despite the decline in oil prices, EOG’s operations in low-cost resources like the Delaware Basin, a sub-basin of the broader Permian and Eagle Ford shale play, are still profitable. EOG Resources also has a strong balance sheet that the upstream player can rely on to ride the current uncertain business environment. Notably, EOG Resources’ low debt-to-capitalization of 13.9% is considerably below the industry’s 51.4%.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nConocoPhillips (COP) : Free Stock Analysis Report\nEOG Resources, Inc. (EOG) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nOXY is exposed to commodity price fluctuation, but investors can remain invested, given its strong Permian Basin assets and free cash flow generation capacity.\nWe recently published a list of the 11 Best Undervalued Energy Stocks to Invest in Now. In this article, we are going to take a look at where EOG Resources, Inc. (NYSE:EOG) stands against other undervalued energy stocks. On March 18, Tortoise Capital senior portfolio manager Rob Thummel appeared on CNBC’s ‘Squawk on the Street’ […]\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nThe kidney dialysis firm doesn’t have an estimate for how long disruption from the attack will last, though DaVita stressed it’s continuing to provide patient care.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nRecessions are a natural part of the economic cycle, but they can have severe negative consequences for your savings and finances. To minimize its impact on your life, take these steps to recession-proof your savings.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 17-41_Chevron Corporation (CVX)_ Among the Best Oil Stocks to Invest in According to Billionaires",
    "date": "",
    "content": "Title: Chevron Corporation (CVX)_ Among the Best Oil Stocks to Invest in According to Billionaires\nDate: 2025-04-15 17:41\nURL: https://finance.yahoo.com/news/chevron-corporation-cvx-among-best-174118838.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 10 Best Oil Stocks to Invest in According to Billionaires. In this article, we are going to take a look at where Chevron Corporation (NYSE:CVX) stands against other best oil stocks.\nAfter an encouraging start to the year, the energy sector is once again lagging behind the overall market. At the time of writing this piece, the broader energy sector has slid by almost 8.2% since the beginning of 2025, against declines of around 7.9% by the wider market. The principal reason behind this fall is the decline in the global prices of oil, which have plunged by almost 14.5% since the beginning of the year.\nREAD NEXT: 10 Best Clean Energy Stocks to Buy According to Billionaires\nThe continued uncertainty surrounding the ongoing tariff war and the recent decision by OPEC+ to increase supply in May have taken a toll on the global price, with the West Texas Intermediate (WTI) crude price now hovering around a 3-year low of $61.5. The US Energy Information Administration (EIA) has forecasted WTI price to average $63.88 per barrel for 2025 before dropping to an average of $57.48 next year. Such a sharp decline in prices could threaten US oil production growth this year. According to data from the Federal Reserve Bank of Dallas, the US oil industry needs prices between $61 and $70 per barrel to be profitable.\nThe escalating trade tensions between the US and China have also raised the prospect of a global economic slowdown, potentially leading to a lower-than-forecasted consumption of oil. In its latest report, the EIA now expects global oil consumption to increase by 900,000 b/d in 2025 and 1 million b/d in 2026, down by 400,000 b/d and 100,000 b/d, respectively, from its initial forecast last month. The decrease in demand, coupled with increasing production, will continue putting pressure on crude prices, forcing many industry players to cut back activity to maintain investor payouts.\nThe American oil and gas sector is also frustrated by the back and forth trade policies of President Trump and is questioning how they align with his ‘drill, baby, drill’ mandate to further boost production. According to a survey by the Federal Reserve Bank of Dallas, nearly a third of oil executives have stated that their business outlook has worsened since the end of 2024. Moreover, the imposition of the 25% tariff on steel and aluminum has already led to an estimated 4% increase in costs for drilling a well.\nThe pressing issues surrounding the global oil trade have forced the industry to shift focus to its second major source of revenue – natural gas. In contrast to oil, the benchmark US natural gas price at Henry Hub has surged by more than 123% since last year and by almost 18% since the beginning of 2025. The uptick comes as a result of slowing output in 2024, booming LNG exports, and fast-depleting inventories during the coldest winter in six years. Moreover, natural gas has emerged as a leading candidate to power the ongoing AI boom and its accompanying data centers, with many providers now even aiming to surpass utilities and supply directly to these power-hungry facilities.\nAlso, despite the broad concerns, many billionaires continue to invest and remain bullish on the oil sector. A great example is how Warren Buffett’s Berkshire Hathaway maintains significant holdings in multiple oil majors and even recently invested hundreds of millions of dollars in an oil and gas giant over the last few months.\nAn aerial view of an oil rig at sea, the sun glinting off its structure.\nTo collect data for this article, we scanned Insider Monkey’s database of billionaires’ stock holdings and picked the top 10 companies operating in the oil sector with the highest number of billionaire investors in the Insider Monkey database in Q4 of 2024. When two or more companies had the same number of billionaires backing them, we ranked them by the revenue of their last financial year. Following are the Best Oil Stocks According to Billionaires.\nAt Insider Monkey, we are obsessed with the stocks that hedge funds pile into. The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Billionaire Holders: 14\nChevron Corporation (NYSE:CVX) manufactures and sells a range of high-quality refined products, including gasoline, diesel, marine and aviation fuels, premium base oil, finished lubricants, and fuel oil additives. The oil and gas giant owns five US fuel refineries and boasts a network of Chevron and Texaco service stations.\nChevron Corporation (NYSE:CVX) narrowly missed earnings expectations in Q4 2024 as weak margins dragged its refining business into a loss for the first time in the last four years. However, the company increased its revenue by 10.7% YoY to $52.23 billion during the quarter, topping estimates as it increased its worldwide and US production by 7% and 19%, respectively, to record levels in 2024. CVX also maintains a robust balance sheet and generated $31.5 billion in operating cash flow and $15 billion in free cash flow in FY 2024, ending the year with a net debt ratio of 10%. The industry giant expects to maintain this momentum, expecting to add $10 billion of annual free cash flow in 2026 (assuming $70 oil) and around $9 billion at the current Brent price.\nChevron Corporation (NYSE:CVX) is known for its commitment to shareholders, and the company returned a record $27 billion to its shareholders in 2024 in the form of dividends and share repurchases. The company has returned over $75 billion to shareholders over the last three years and recently increased its quarterly dividend by 4.9% to $1.71 per share, maintaining a 38-year streak of consistent dividend growth.\nAs a result, Chevron Corporation (NYSE:CVX) was also included in our list of the 25 Best Dividend Stocks to Buy According to Billionaires.\nOverall, CVX ranks 4th on our list of the best oil stocks to invest in according to billionaires. While we acknowledge the potential of CVX to grow , our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than CVX but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nRealty Income (NYSE: O) is a well-run net lease real estate investment trust (REIT).  Here's a look at why dividend investors like Realty Income and why there's another net lease REIT that may be a better choice today.  What does Realty Income do?\nIn the current environment, defensiveness is the best stance, and Berkshire Hathaway (BRK-A, BRK-B) is the “top-in-class” name when it comes to defensive stocks, Joe Tigay, the Portfolio Manager of the Rational Equity Armor Fund told Yahoo Finance recently. Why Defensiveness Is Appropriate “The bond market is flashing major warning signs of a recession, so […]\nBank of America, Chevron, Stryker, Value Line and Sypris are included in this Analyst Blog.\nDespite falling prices, natural gas is actually in short supply right now, and gas producers could come out ahead if prices rebound.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 09-45_3 Dividend Stocks Yielding Over 4% to Buy in April",
    "date": "",
    "content": "Title: 3 Dividend Stocks Yielding Over 4% to Buy in April\nDate: 2025-04-16 09:45\nURL: https://www.fool.com/investing/2025/04/16/3-high-yield-dividend-stocks-buy-april/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=daa3df54-cfe4-4db2-8ed3-79459fbf1b94&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nMany companies reward shareholders by passing along a portion of profits through dividends. But oftentimes, the dividend yield on a stock might not be much to write home about. Many growth-focused companies don't pay dividends at all, which is why the yield on the S&P 500 (SNPINDEX: ^GSPC) has fallen to just 1.4%. \nHowever, there are some companies that yield a considerable amount -- to the point where the dividend is a core part of the investment thesis. Stocks with reliable dividends and high yields can be excellent ways to collect passive income no matter what the broader market is doing.\nHere's why these three fool.com contributors think Chevron (CVX 0.65%), Brookfield Renewable Partners (BEP -0.90%) (BEPC -1.05%), and MSC Industrial Direct (MSM -1.48%) are three high-yield dividend stocks to buy now.\nImage source: Getty Images.\nDaniel Foelber (Chevron): Chevron stock is hovering around a three-year low. The sell-off in the integrated oil major could be a phenomenal buying opportunity for income investors.\nThe company has raised its dividend for 38 consecutive years, an impressive track record considering multiple oil and gas downturns and recessions have occurred during that period. The sell-off in the stock has pushed its yield up to 4.8%, providing investors with the opportunity to generate sizable passive income.\nAnd Chevron has an excellent balance sheet that acts as a cushion in case of a prolonged oil and gas downturn. The company has used outsize profits in recent years to pay down debt and return cash to investors through buybacks and dividends. It has just $17.2 billion in net long-term debt and an ultra-low debt-to-capital ratio of just 13.6%, showcasing how its capital structure isn't dependent on debt.\nDespite its strengths, Chevron will probably generate a lot less free cash flow (FCF) if oil prices stay at lower levels (they are at their lowest level in four years). And although the company has reduced its cost of production over time, there comes a point when it can no longer support its dividend and capital-spending plans with cash.\nWhen our analyst team has a stock tip, it can pay to listen. After all, Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500.\nThey just revealed what they believe are the 10 best stocks for investors to buy right now…\n*Stock Advisor returns as of April 14, 2025\nAt current oil prices, management will likely pull back on capital spending and buybacks, but it still has a margin for error considering 75% of its oil investments can break even below $50 per barrel. The company has been testing its new \"triple frac\" technology, which could reduce costs and cut completion times for new wells in the Permian Basin.\nAnother advantage of Chevron over other producers is its geographic diversification. It isn't dependent on one region and has a massive refining business and growing low-carbon segment.\nThe company has what it takes to generate positive FCF even at lower oil prices and support its growing dividend. In past downturns, it has pulled back on stock repurchases and spending but continued to support the dividend by leaning on its balance sheet.\nIf oil prices fall below $50 per barrel, many companies would be in dire straits. But the business has proved time and time again that investors can count on it for passive income even during downturns.\nAdd it all up, and Chevron is as safe a bet as you'll find in the oil patch.\nScott Levine (Brookfield Renewable Partners): With markets turning in topsy-turvy performances right now, many investors are eager for some stability. At the forefront of the many ways that they can gird themselves, buying reliable dividend stocks like green energy specialist Brookfield Renewable Partners is a savvy choice. The limited partnership currently offers an enticing 7.3% forward yield.\nProviding an ultra-high yield, Brookfield might spark doubt in investors who question whether the company can sustain its generous payout during the current market downturn. But that's the allure: With its stable business model, the company enjoys tremendous resilience during times like these.\nFrom solar to wind to other green energy assets, Brookfield Renewable Partners operates a massive global green energy portfolio -- about 46 gigawatts of operating capacity -- and it inks long-term deals with customers, which agree to purchase the generated power.\nThis model ensures that the company will continue generating revenue, and it will have the resources to continue rewarding investors. In its fourth-quarter 2024 financial results, for example, management noted that about 90% of the company's generation capacity is contracted, and about 70% of its revenue is protected from inflation.\nIn its relatively short time as a publicly held company, it has demonstrated steadfast dedication to returning capital to investors, further illustrating its appeal. Every year since its initial public offering in 2011, the company has hiked its dividend by at least 5%. Regarding the years ahead, management has stated a goal of continuing to boost its dividend 5% to 9% annually.\nFor income-hungry investors, now's a great time to buy Brookfield Renewable Partners' stock, which is currently trading at a discount to its historical valuation.\nLee Samaha (MSC Industrial Direct): It's incredibly challenging to know whether the White Houe tariffs are tactical (to aid trade-deal negotiations) or strategic (to engineer a long-term structural shift in the global economy), but it's probably true to think they are a bit of both.\nHowever, one thing we do know with a high degree of certainty is that President Donald Trump, one way or another, wants to see the U.S. rebuild its industrial base. That could be great news for metalworking supply company MSC Industrial.\nReaders should be under no illusions: If the current uncertainty persists, there's a serious risk of an industrial recession, and MSC Industrial will inevitably suffer the consequences.\nHowever, the long-term outlook is brighter, as a shift in manufacturing back to the U.S. implies an improving environment for metalworking suppliers. The company has negative exposure to tariffs via 10% of its cost of goods sold from China, with a similar amount from Europe, and low-single-digit percentages from Canada and Mexico.\nOn a positive note, distributors like MSC will try to pass on the tariff increases in pricing. In any case, most of its products are sourced in the U.S. All told, if you are confident that the global economy will avoid a recession and that the president's determination to reinvigorate the industrial base will work, then MSC Industrial is a good choice for long-term investors.\nJust be aware that the near-term risk is rising while companies set about reshaping their supply chains and product sourcing.\n\n \n\nBefore you buy stock in Chevron, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Chevron wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nDaniel Foelber has no position in any of the stocks mentioned. Lee Samaha has no position in any of the stocks mentioned. Scott Levine has positions in Brookfield Renewable. The Motley Fool has positions in and recommends Chevron. The Motley Fool recommends Brookfield Renewable and Brookfield Renewable Partners. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-16 10-44_Petrobras' Environmental Hurdles Lead to Oil Blocks Auction in Brazil",
    "date": "",
    "content": "Title: Petrobras' Environmental Hurdles Lead to Oil Blocks Auction in Brazil\nDate: 2025-04-16 10:44\nURL: https://finance.yahoo.com/news/petrobras-environmental-hurdles-lead-oil-104400391.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nPetróleo Brasileiro S.A. – Petrobras’ PBR years-long disputes with the environmental authorities on drilling licenses recently led to an oil block auction, whereby Brazil’s oil regulator, ANP, will provide exploration rights in several offshore oil blocks.\nThe auction, which is scheduled to take place on June 17, will offer 172 blocks spanning both land and deep-water zones in northeastern and southern Brazil, including the Equatorial Margin — a region that could be key to Brazil’s energy future. The blocks across five sedimentary basins, including the deepwater Potiguar and Foz do Amazonas, located near the equator, will also be offered, which are considered to hold Brazil’s greatest potential for replenishing reserves and are projected to start declining by 2030.\nOut of the 172 oil blocks, 47 are at the Foz do Amazonas, where Petrobras, currently carrying a Zacks Rank #3 (Hold),won the exploration deal in 2023 and since then, has been awaiting environmental clearance to drill its first well. These oil blocks are expected to contain the same potential as those in Suriname and Guyana, where Exxon Mobil found billions of barrels of oil. The delay in environmental clearance certainly reduces the attractiveness of these blocks for the auction.\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\nCertain environmental working groups have suggested dropping some Potiguar Basin oil blocks, like Atol das Rocas and the Fernando de Noronha archipelago as they are in places of extreme environmental sensitivity and ecosystem connectivity.\nHowever, Brazil’s several ministries jointly allowed these sensitive areas to be offered for auction, even though this authorization expires just a day after the auction. This puts the Potiguar Basin at particular risk of exclusion from future rounds.\nDespite the controversies, the auction has attracted interest from the industry’s big players. Thirty-one companies have registered themselves to bid for the upcoming auction, including Petrobras, Exxon Mobil Corporation XOM, Chevron Corporation CVX, BP p.l.c. BP,Shell and Equinor.\nExxon Mobil is a U.S.-based oil and gas giant that has a track record of optimal capital structure and Capex discipline across the commodity price cycle, making it a low-risk energy player producing industry-leading returns. XOM’s expected growth rate for earnings per share for the next year is 21.88%, which aligns favorably with the industry growth rate of 16.30%.\nHouston, TX-based Chevron is one of the largest publicly traded oil and gas companiesthat participates in every aspect related to energy,from oil production to refining and marketing. CVX generates more than $200 billion in annual revenues and produces over three million barrels per day of oil equivalent. The Zacks Consensus Estimate for CVX’s 2025 earnings indicates 2.49% year-over-year growth.\nBP, an integrated oil and gas company, is driven by its strategic shift toward traditional and renewable energy. BP plans to reduce debt and strengthen its balance sheet while prioritizing shareholder returns by generating proceeds from asset sales. XOM’s expected growth rate for earnings per share for the next year is 11.76%.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nBP p.l.c. (BP) : Free Stock Analysis Report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nPetroleo Brasileiro S.A.- Petrobras (PBR) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nCVX and XOM are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nBP, together with its partner CVX, operates the Far South field, situated 4 miles toward the north of the Constellation field.\nCVX, COP and EOG offer stability and upside, as OPEC's outlook signals slower growth but confirms oil's lasting role in the global economy.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-07_Chevron or ExxonMobil_ Which Big Oil Leads the Permian Charge_",
    "date": "",
    "content": "Title: Chevron or ExxonMobil_ Which Big Oil Leads the Permian Charge_\nDate: 2025-04-16 13:07\nURL: https://finance.yahoo.com/news/chevron-exxonmobil-big-oil-leads-130700866.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nChevron CVX and ExxonMobil XOM are two of the largest publicly traded oil and gas companies in the world with operations that span almost every corner of the globe. The Permian Basin has become a linchpin for both as they sharpen their focus on scalable, high-return assets. Each company is doubling down on this prolific region serving as a key source of cash flow, but their paths diverge in strategy and execution.\nAccording to the Energy Information Administration (“EIA”), U.S. crude oil production, largely driven by the Permian, is expected to reach 13.5 million barrels per day (bpd) in 2025 and 13.6 million bpd in 2026. With Permian output set to grow by 290,000 bpd this year from 2024 and an additional 170,000 bpd in 2026, the region will account for nearly half of the nation’s oil supply, solidifying its role in the energy market. This surge in production is backed by record-breaking rig efficiency, robust infrastructure and continued investments in drilling innovations, ensuring long-term sustainability and profitability for key players in the basin.\nChevron holds 1.78 million net acres in the Delaware and Midland sub-basins of Texas and New Mexico, making it one of the largest leaseholders in the Permian. It boosts efficiency by drilling several horizontal wells from a single site, a method known as factory-style development. In 2024, Chevron’s average daily output from the Permian basin stood at 405,000 barrels of oil, 251,000 barrels of NGLs, and 1.6 billion cubic feet of natural gas.Chevron aims to reach 1 million barrels of oil-equivalent per day (BOE/d) in 2025 and is already close, producing 992,000 BOE/d in the fourth quarter of 2024. With layered rock formations, upgraded infrastructure, and sustainability steps like using electric fleets and solar energy, Chevron’s strategy focuses on both growth and reducing environmental impact.Meanwhile, ExxonMobil has aggressively ramped up its Permian presence through acquisitions — most notably its $63 billion buyout of Pioneer Natural Resources in 2024. This move expanded Exxon’s footprint to more than 1.3 million net acres and significantly boosted output. In 2024, ExxonMobil’s Permian production averaged 1.185 million BOE/d, up 570,000 from the prior year. The company plans to double that to 2.3 million BOE/d by 2030. To get there, it’s using advanced methods like special proppants and cube drilling, and it aims to cut emissions to net zero in its original Permian operations by 2030 and in Pioneer’s by 2035.\nChevron leans on a disciplined capital allocation model, emphasizing cost control and asset returns. It supplements operated activity with joint ventures and royalty interests to balance risk and capital intensity. In particular, Chevron’s use of royalty interests allows it to benefit from production upside without committing large amounts of capital. On the other hand, ExxonMobil is leaning heavily into scale and integration. ExxonMobil, on the other hand, is integrating scale through acquisitions and focusing on operational synergies. Its Pioneer deal gave it high-quality, contiguous acreage, which is expected to support production growth at lower costs. Both companies are aligning their Permian strategies with broader low-carbon goals but are taking slightly different paths to get there.\nOver the past six months, Chevron has outperformed ExxonMobil despite both stocks being weighed down by trade-related uncertainty and new U.S. tariffs. The market has been jittery amid fears that steep levies could dent global demand.\nImage Source: Zacks Investment Research\nChevron’s valuation remains attractive, too. It trades at an EV/EBITDA multiple of 5.55, which is more favorable compared to ExxonMobil. This suggests better value for investors focused on cash flow and capital discipline.\nImage Source: Zacks Investment Research\nLooking ahead, Chevron appears better positioned in terms of earnings momentum. The Zacks Consensus Estimate calls for a 2.9% decline in its 2025 EPS, followed by a strong 23.1% rebound in 2026.\nImage Source: Zacks Investment Research\nIn contrast, ExxonMobil is projected to see a steeper 10.5% decline this year, with a 21.1% recovery anticipated in 2026. The near-term outlook for ExxonMobil remains more uncertain, weighed down by integration costs from recent acquisitions and ongoing inflationary pressures. (Find the latest EPS estimates and surprises on Zacks Earnings Calendar.)\nImage Source: Zacks Investment Research\nWhile both Chevron and ExxonMobil are deeply invested in the Permian Basin and share a commitment to scale and lower emissions, Chevron currently holds the upper hand. It combines consistent execution with financial discipline and a clear path toward its production goals. While CVX holds a Zacks Rank #3 (Hold), it stands on firmer ground than XOM, which holds a Zacks Rank #4 (Sell). For now, Chevron looks better placed to navigate market headwinds and deliver stable, long-term shareholder value. You can see the complete list of today’s Zacks #1 Rank stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nChevron Corporation (CVX) : Free Stock Analysis Report\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nXOM's fourth FPSO, One Guyana, has arrived, setting the stage for a major output boost from the Yellowtail field by year-end.\nStoneCo and RH have been highlighted as Zacks Bull and Bear of the Day\nPBR's long-dragged environmental hurdle compels the Brazilian oil regulator to open 172 oil blocks for bidding.\nXOM's preliminary assessments indicate that the gas reserves at the Elektra-1 prospect are commercially infeasible for development.\nMany growth-focused companies don't pay dividends at all, which is why the yield on the S&P 500 (SNPINDEX: ^GSPC) has fallen to just 1.4%.  Stocks with reliable dividends and high yields can be excellent ways to collect passive income no matter what the broader market is doing.  Here's why these three fool.com contributors think Chevron (NYSE: CVX), Brookfield Renewable Partners (NYSE: BEP) (NYSE: BEPC), and MSC Industrial Direct (NYSE: MSM) are three high-yield dividend stocks to buy now.\nThe move comes amid an ongoing labor dispute post the expiration of the members' contract on April 4 at Electric Boat, a part of the defense contractor's marine systems segment, which assembles nuclear-powered submarines for the U.S. Navy.  The union members are also seeking the restoration of pensions, as they argue that General Dynamics is pushing for increases of 52% to 161% in weekly medical insurance costs.  General Dynamics has received significant contract awards from the Pentagon for building the Navy's Virginia-class submarines, but is years behind schedule because of skilled labor shortages, design issues, and supply chain challenges stemming from the pandemic.\nWe recently published a list of 10 Dirt Cheap Stocks To Invest In Now. In this article, we are going to take a look at where Bristol-Myers Squibb Company (NYSE:BMY) stands against other dirt cheap stocks to invest in now. Investor’s Guide to Navigating the Volatilitc The stock market has been experiencing volatility and has […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]