[
  {
    "title": "2025-04-13 21-57_Is UnitedHealth Group Incorporated (UNH) the Best Medical Stock to Buy According to Billionaires_",
    "date": "",
    "content": "Title: Is UnitedHealth Group Incorporated (UNH) the Best Medical Stock to Buy According to Billionaires_\nDate: 2025-04-13 21:57\nURL: https://finance.yahoo.com/news/unitedhealth-group-incorporated-unh-best-215715708.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of 10 Best Medical Stocks to Buy According to Billionaires. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best medical stocks to buy according to billionaires.\nSome experts view medical, healthcare, and big pharma stocks as immune from trade carnage, making them a safe haven amid the uncertainty brought about by Trump’s tariffs. On April 8, Mizuho Securities America healthcare sector strategist Jared Holz appeared on CNBC’s ‘Power Lunch’ to talk about whether the speculations around the healthcare sector being a safe haven during market turmoil are true. He also discussed why healthcare companies are failing to get increased investor respect, given that healthcare is 20% of the American economy, which translates to around 1/5th of the country’s entire national output.\nHolz said that the country’s major healthcare and pharmaceutical companies undoubtedly help fight its healthcare problems. However, when we look at their financial models and the way their businesses are currently set up, we have got generic patent cliffs over the next 5-7 years on the medium to long-term angle of the company, along with price concessions with the IRA and some of the things the Biden administration put into place. We have also got pricing degradation over the near term, and between those two lies competition and other setbacks. The models thus never line up well enough for investors to have a lot of confidence, as the business models do not lend themselves to long-term viability. These are the primary reasons the sector and stocks have been under pressure for so long.\nREAD ALSO: 10 Best Mid Cap Biotech Stocks to Buy and 12 Best Diagnostics Stocks to Invest In Right Now. \nHolz further opined that managed care, particularly the government-centric names, are somewhat safe as they are insulated from tariffs as US-based companies. In fact, the economic slowdown is actually beneficial for them as they want less utilization and less patience through the system, which is how they typically beat numbers. He said that managed care is having a good day, and investors might think about owning some companies in the sector.\nIt is, however, a relative game, as there are several different variables at play, and investors are essentially playing a game of hopscotch in an attempt to jump from one area to another, whether it’s tariffs, drug pricing, or other public policies. He painted a similar picture for medical device stocks that are more US-centric. These two sectors thus have less risk relative to others, making them somewhat of a safe haven.\nIn this article, we first sifted through ETFs and financial media reports to compile a preliminary list of stocks. We then examined Insider Monkey’s exclusive database of billionaire stock holdings to select the 10 best medical stocks with the most billionaire investors. These billionaires are founders or managers of some of the world’s leading hedge funds and companies.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 275% since May 2014, beating its benchmark by 150 percentage points (see more details here).\nA senior healthcare professional giving advice to a patient in a clinic.\nNumber of Billionaire Investors: 23\nNumber of Hedge Fund Holders: 150\nUnitedHealth Group Incorporated (NYSE:UNH) provides healthcare coverage, data consultancy, and software services. It operates through the OptumRx, OptumInsight, OptumHealth, and UnitedHealthCare segments, which have solid operations. UnitedHealthcare, its insurance division, added millions of customers during fiscal 2024 and is continuing to expand its operations. Its OptumHealth division grew revenues to around $105 billion in fiscal 2024 and is expected to touch $117 billion in fiscal 2025.\nUnitedHealth Group Incorporated (NYSE:UNH) also employed around $17 billion in growth capital in fiscal 2024 to strengthen its capabilities and returned over $16 billion to shareholders through share repurchases and dividends. UnitedHealth Group Incorporated (NYSE:UNH) expects cash flow from operations to reach $33 billion in fiscal 2025, or 1.2 times net income.\nOn April 9, Mizuho analyst Ann Hynes raised the firm’s price target on UnitedHealth Group Incorporated (NYSE:UNH) to $650 from $600 and kept an Outperform rating on the shares. The company takes the second spot on our list of the best medical stocks to invest in now.\nVulcan Value Partners stated the following regarding UnitedHealth Group Incorporated (NYSE:UNH) in its Q4 2024 investor letter:\n“UnitedHealth Group Incorporated (NYSE:UNH), a company that we have owned several times in the past, is the largest health insurer in the United States. UnitedHealth Group also owns Optum, which is a rapidly growing healthcare services company. The environment for the health insurance business remains positive as growth in healthcare spending, driven by chronic diseases and an aging population, will continue to outpace overall economic growth. The insurance business benefits from powerful network effects as more members attract more providers and vice versa, which reinforces United’s value proposition and bargaining power with each side of the network. We respect UnitedHealth Group’s management team and have been very pleased with their long-term vision and execution.”\nOverall, UNH ranks 2nd on our list of best medical stocks to buy according to billionaires. While we acknowledge the potential for UNH as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than UNH but trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nThe Nasdaq Composite's (NASDAQINDEX: ^IXIC) over 12% pop on April 9 pole-vaulted the index out of bear market territory -- which is a decline of over 20% from a recent high.  Bear markets have historically been phenomenal times to put hard-earned savings to work in the market, but only for businesses that have the qualities necessary to endure a prolonged slowdown.  Here are some risks worth considering before diving headfirst into buying the dip, and why Meta Platforms (NASDAQ: META) passes the risk test.\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 11-25_How Should You Play UnitedHealth Stock Going Into Q1 Earnings_",
    "date": "",
    "content": "Title: How Should You Play UnitedHealth Stock Going Into Q1 Earnings_\nDate: 2025-04-14 11:25\nURL: https://finance.yahoo.com/news/play-unitedhealth-stock-going-q1-112500462.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUnitedHealth Group Incorporated UNH is set to report first-quarter 2025 results on April 17, 2025, before the opening bell. The Zacks Consensus Estimate for the to-be-reported quarter’s earnings is currently pegged at $7.27 per shareon revenues of $111.01 billion.\nSee the Zacks Earnings Calendar to stay ahead of market-making news.\nFirst-quarter earnings estimates have remained stable over the past week. The bottom-line projection indicates an increase of 5.2% from the year-ago reported number. The Zacks Consensus Estimate for quarterly revenues suggests year-over-year growth of 11.2%.\nImage Source: Zacks Investment Research\nFor the current year, the Zacks Consensus Estimate for UnitedHealth’s revenues is pegged at $451.24 billion, implying a rise of 12.7% year over year. Also, the consensus mark for current-year earnings per share is pegged at $29.73, implying a jump of around 7.5% on a year-over-year basis.\nUnitedHealthhas a robust history of surpassing earnings estimates, beating the consensus estimate in each of the last four quarters, with the average surprise being 2.5%. This is depicted in the figure below.\nUnitedHealth Group Incorporated price-eps-surprise | UnitedHealth Group Incorporated Quote\nHowever, our proven model does not conclusively predict an earnings beat for the company this time around. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy), or 3 (Hold) increases the odds of an earnings beat, but that’s not the case here.\nUNH has an Earnings ESP of 0.00% and a Zacks Rank #2. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\nUnitedHealth's first-quarter earnings are expected to have benefited from higher premiums, driven by the expansion of its domestic commercial membership base. The Zacks Consensus Estimate for premium revenues for the first quarter indicates 11.5% year-over-year growth, whereas our model estimate suggests a nearly 9% increase. Higher contributions from both Optum Health and UnitedHealthcare divisions are expected to have supported premium growth.\nUNH's first-quarter top-line performance is expected to have been enhanced by a rise in service revenues from the Optum brand. Both the consensus estimate and our model estimate imply a nearly 10% jump in service revenues. Similarly, the Zacks Consensus Estimate for product revenues indicates an almost 12% increase.\nValue-based care expansion in Optum Health, new client wins at Optum Rx,and enhanced technology-enabled offerings are major tailwinds for the company’s results. The Zacks Consensus Estimate for operating income from the Optum business segment suggests a 28.6% year-over-year increase. Meanwhile, the Zacks Consensus Estimate for operating income from UnitedHealthcare indicates 7.6% year-over-year growth. These are expected to have positioned the company for year-over-year growth in the first quarter.\nNow, let’s focus on memberships in selected programs. The Zacks Consensus Estimate for UnitedHealthcare’s total domestic commercial customers suggests 3.5% year-over-year growth, whereas our estimate implies a nearly 2% gain. The consensus mark for Medicare Advantage members indicates a 5.8% year-over-year rise.\nHowever, the consensus estimate for Medicaid memberships implies a 0.8% decline from the year-ago level. Also, international memberships are expected to have declined in the quarter under review due to divestments. These are likely to have pulled total memberships down from the year-ago period. The consensus estimate implies a 0.6% fall year over year.\nRising medical costs, as seniors continue resuming elective procedures,are expected to have elevated UnitedHealth’s overall expenses in the quarter. The expected growth in healthcare utilization, especially in the Medicare Advantage space, might have affected margins, making an earnings beat uncertain this time around. Our model estimate for total operating costs indicates an 8.6% increase from the prior-year period.\nThe Zacks Consensus Estimate for UNH’s medical care ratio is pegged at 85.92%, up from 84.3% in the year-ago quarter. Our estimates for medical costs and costs of products soldindicate 10% and 9.1% year-over-year increases, respectively.\nUnitedHealth's stock has jumped 18.5% in the year-to-date period compared with the industry’s growth of 18%. Its peers, such as Humana Inc. HUM and Molina Healthcare, Inc. MOH, have gained 16.3% and 18.6%, respectively, during this time. All these stocks have outperformed the S&P 500 significantly, which has plunged 9.1% during the same period.\nImage Source: Zacks Investment Research\nNow, let’s look at the value UnitedHealth offers investors at current levels.\nThe company’s valuation looks a bit stretched compared with the industry average. Currently, UNH is trading at 19.47X forward 12 months earnings, slightly above its five-year median of 19.20X and above the industry’s average of 16.71X. In comparison, Humana and Molina Healthcare are currently trading at 19.17X and 13.60X, respectively.\nImage Source: Zacks Investment Research\nUnitedHealth’s strategic investments in technology and value-based care — particularly through its Optum segment — continue to position the company as a frontrunner in healthcare innovation. This emphasis not only drives operational efficiency but also improves patient outcomes, a key advantage as the industry increasingly shifts toward quality-based models.\nWith projected annual earnings growth of 12.4% over the next five years, UnitedHealth remains a compelling long-term investment. The company’s strong cash flow underpins consistent shareholder returns through dividends and share repurchases, reinforcing its financial stability and disciplined capital allocation.\nAdding to the bullish case, the Centers for Medicare & Medicaid Services recently approved a 5.06% increase in Medicare Advantage (MA) payments for fiscal 2026, a sharp revision from the initially proposed 2.23%. This development is expected to meaningfully boost profitability for top-tier MA providers like UnitedHealth and Humana.\nWe anticipate that UnitedHealth will extend its profit growth trajectory in the upcoming earnings report, likely supporting continued stock price momentum. The company’s push toward managing costs effectively — through disciplined contract negotiations and optimized patient discharge processes — should further enhance margins. Given its strong fundamentals, long-term growth outlook, and favorable policy backdrop, UnitedHealth’s premium valuation appears justified. Investors may consider adding to their positions now.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nHumana Inc. (HUM) : Free Stock Analysis Report\nMolina Healthcare, Inc (MOH) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nIt can be a smart strategy, provided you understand what you’re risking.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 12-02_Beat the Market the Zacks Way_ Casey's, Stride, McDonald's in Focus",
    "date": "",
    "content": "Title: Beat the Market the Zacks Way_ Casey's, Stride, McDonald's in Focus\nDate: 2025-04-14 12:02\nURL: https://finance.yahoo.com/news/beat-market-zacks-way-caseys-120200040.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nLast Friday, the three most widely followed benchmark indexes closed a volatile yet winning week. The Nasdaq Composite, the S&P 500 and the Dow Jones Industrial Average advanced 7.3%, 5.7% and 5%, respectively.\nThroughout the week, trade was influenced by tariff reprieves announced on European goods and a trade war between the United States and China. The S&P 500 and the Dow registered their biggest weekly percentage gains since November 2023, and the tech-focused Nasdaq claimed its biggest advance since November 2022. For March, inflation numbers both on the consumer and producer side came in negative, against expectations.\nConsumer sentiments, however, have declined further, and all eyes are currently set on developments from the White House and its multi-front tariff war.\nRegardless of market conditions, we, here at Zacks, provide investors with unbiased guidance on how to beat the market.\nAs usual, Zacks Research guided investors over the past three months with its time-tested methodologies. Given the prevailing market uncertainty, you may want to look at our feats to prepare better for your next action.\nHere are some of our key achievements:\nShares of Palomar Holdings, Inc. PLMR have gained 16.5% (versus the S&P 500’s 12.4% decrease) since it was upgraded to a Zacks Rank #1 (Strong Buy) on February 18.\nAnother stock, Heineken N.V. HEINY, which was upgraded to a Zacks Rank #2 (Buy) also on February 18, has returned 2.4% since then.\nA hypothetical portfolio of Zacks Rank # 1 (Strong Buy) stocks returned -3.48% in January 2025 (through February 3rd) vs. -0.60% for the S&P 500 index and -2.75% for the equal-weight version of the index\nThis portfolio returned +22.3% in 2024, vs. +28% for the S&P 500 index and +19.9% for the equal-weight version of the S&P 500 index. \nThis hypothetical portfolio returned +20.63% in 2023 vs. +24.83% for the S&P 500 index and +15% for the equal-weight S&P 500 index. \nThe portfolio of Zacks Rank #1 stocks is an equal-weight portfolio, while the S&P 500 index is a market-cap-weighted index that has been notably distorted by the concentrated performance of mega-cap stocks since late 2022. \nThe Zacks Model Portfolio - consisting of Zacks Rank #1 stocks – has outperformed the S&P index by almost 13 percentage points since 1988 (through the end of January 2025, the Zacks # 1 Rank stocks generated an annualized average return of +23.9% since 1988 vs. +11.3% for the S&P 500 index).\nYou can see the complete list of today’s Zacks Rank #1 stocks here >>>\nCheck Palomar’s historical EPS and Sales here>>>\nCheck Heineken’s historical EPS and Sales here>>>\nImage Source: Zacks Investment Research\nShares of Munchener Ruckversicherungs MURGY and Sprouts Farmers Market, Inc. SFM have advanced 11.7% (versus the S&P 500’s 10.1% fall) and 9.7% (versus the S&P 500’s 10.9% fall) since their Zacks Recommendation was upgraded to Outperform on February 27 and February 24, respectively.\nWhile the Zacks Rank is our short-term rating system that is most effective over the one- to three-month holding horizon, the Zacks Recommendation aims to predict performance over the next 6 to 12 months. However, just like the Zacks Rank, the foundation for the Zacks Recommendation is trends in earnings estimate revisions.\nThe Zacks Recommendation classifies stocks into three groups — Outperform, Neutral and Underperform. While these recommendations are determined quantitatively, our analysts have the flexibility to override them for the 1100+ stocks they closely follow based on their better judgment of factors such as valuation, industry conditions and management effectiveness than the quantitative model.\nTo access our research reports with Zacks Recommendations for the 1100+ stocks we cover, click here>>>\nShares of Casey's General Stores, Inc. CASY, which belongs to the Zacks Focus List, have gained 15.8% over the past 12 weeks. The stock was added to the Focus List on August 20, 2019. Another Focus-List holding, UnitedHealth Group Incorporated UNH, which was added to the portfolio on June 22, 2015, has returned 10.3% over the past 12 weeks. The S&P 500 has declined 8.2% over this period.\nThe Focus List portfolio returned -2.96% in the first quarter of 2025 vs. -4.30% for the S&P 500 index and -0.61% for the equal-weight version of the index. \nThe 50-stock Zacks Focus List portfolio returned +18.41% in 2024 vs. +25.04% for the S&P 500 index and +13% for the equal-weight S&P 500 index. The portfolio had returned +29.54% in 2023 vs. +26.28% for the S&P 500 index and +13.61% for the equal-weight S&P 500 index. In 2022, the portfolio returned  -15.2% vs. the S&P 500 index’s -17.96%. \nSince 2004, the Focus List portfolio has produced an annualized return of +11.39% (through the end of 2025 Q1). This compares to a +10.03% annualized return for the S&P 500 index and +9.87% for the equal-weight version of the index in the same time period.\nThe portfolio lags the broader market over the preceding year, but leads over the preceding 3, 5, and 10-year periods.\nUnlock all of our powerful research, tools and analysis, including the Focus List, Zacks #1 Rank List, Equity Research Reports, Zacks Earnings ESP Filter, Premium Screener and more, as part of Zacks Premium. Gain full access now >>\nCheck Point Software Technologies Ltd. CHKP, a component of our Earnings Certain Admiral Portfolio (ECAP), has jumped 18.8% over the past 12 weeks. Cencora, Inc. COR has followed Check Point with 18.5% returns.\nThe Zacks Earnings Certain Admiral Portfolio (ECAP), which consists of 30 concentrated, ultra-defensive, long-term Buy-and-Hold stocks, returned +3.20% in the first quarter of 2025 vs. the S&P 500 index’s -4.30% decline (SPY ETF). \nFor the year 2024, the portfolio returned +16.26% vs. +24.89% for the S&P 500 index (SPY ETF). \nIn 2023, the portfolio returned +12.17% vs. +26.28% for the S&P 500 index. The portfolio returned -4.7% in 2022 vs. the S&P 500 index’s -17.96%.\nWith little to no turnover and annual rebalance periodicity, ECAP seeks to minimize capital loss by holding shares of companies whose earnings streams exhibit a proven 20+ year track record of surviving recessionary periods with minimal impact on aggregate earnings growth relative to the overall S&P 500.\nThe ECAP and many other model portfolios are available as part of Zacks Advisor Tools, a cloud-based solution to access Zacks award-winning stock, mutual fund and ETF research. Click here to schedule a demo.\nAmerican Tower Corporation AMT, which is part of our Earnings Certain Dividend Portfolio (ECDP), has returned 19.3% over the past 12 weeks. Another ECDP stock, McDonald's Corporation MCD, has climbed 10.1% over the same time frame. Of course, the inclination of investors toward quality dividend stocks to secure an income stream amid heightened market volatility contributed to this performance.\nCheck American Tower's dividend history here>>>\nCheck McDonald’s dividend history here>>>\nWith an extremely low beta and a history of minimum earnings variability over the last 20+ years, this 25-stock portfolio helps significantly mitigate risk.\nThe Zacks Earnings Certain Dividend Portfolio (ECDP) returned +5.74% in 2025 Q1 vs. the S&P 500 index’s -2.41% pullback and the Dividend Aristocrats ETF’s (NOBL) +3.11% return. \nFor the full-year 2024, the portfolio returned +6.95% vs. +24.89% for the S&P 500 index and +6.72% for NOBL. \nThe portfolio returned -0.9% in 2023 vs. +26.28% for the S&P 500 index and +8.11% for NOBL. The portfolio returned -2.3% in 2022 vs. -17.96% for the S&P 500 index and -8.34% for NOBL.\nClick here to access this portfolio on Zacks Advisor Tools.\nStride, Inc. LRN, from the Zacks Top 10 Stocks for 2025, has jumped 29.7% year to date against the S&P 500 Index’s 6.5% decrease.\nThe Top 10 portfolio returned -11% this year in 2025 Q1 vs. -4.3% for the S&P 500 index and -0.61% for the equal-weight version of the index. \nThe Top 10 portfolio returned +62.98% in 2024, vs. +25.04% for the S&P 500 index and +13% for the equal-weight version of the index. The portfolio had returned +25.15% in 2023 vs. +26.28% for the S&P 500 index. \nSince 2012, the Top 10 portfolio has produced a cumulative return of +1767.4% through the end of 2025 Q1 vs. +437.9% for the S&P 500 index and +348.9% for the equal-weight version of the index. The portfolio has produced an average return of +24.2% in the period 2012 through 2025 Q1 vs. +11.79% for the S&P 500 index and +9.89% for the equal-weight version of the index.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nAmerican Tower Corporation (AMT) : Free Stock Analysis Report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\nCheck Point Software Technologies Ltd. (CHKP) : Free Stock Analysis Report\nCencora, Inc. (COR) : Free Stock Analysis Report\nCasey's General Stores, Inc. (CASY) : Free Stock Analysis Report\nStride, Inc. (LRN) : Free Stock Analysis Report\nSprouts Farmers Market, Inc. (SFM) : Free Stock Analysis Report\nHeineken NV (HEINY) : Free Stock Analysis Report\nM?nchener R?ckversicherungs-Gesellschaft (MURGY) : Free Stock Analysis Report\nPalomar Holdings, Inc. (PLMR) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nWe recently published a list of 11 Top Performing European Stocks So Far In 2025. In this article, we are going to take a look at where Coca-Cola Europacific Partners PLC (NASDAQ:CCEP) stands against other best performing European stocks to invest in. The world economy is hanging by a thread, as the macroeconomic environment consists […]\nIncome investors that want to generate increase the yield on a defensive stock like Coke could look at a covered call trade.\nArkansas Governor Sarah Huckabee Sanders is seeking clearance from the USDA to make candy and all types of soda ineligible for purchases under the Supplemental Nutrition Assistance Program, or SNAP, starting in July 2026 and the Agriculture Department is fast-tracking such requests from that state and others, reported The Wall Street Journal’s Laura Cooper, Kristina Peterson and Josh Dawsey. Soda, snack and candy makers include Coca-Cola (KO), PepsiCo (PEP), Keurig Dr Pepper (KDP), Hershey (HSY)\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nNKE's Jordan Brand Air Rev comes up with Flight Lock technology to bring a customizable system of containment to aid golfers.\nWe came across a bullish thesis on UnitedHealth Group Incorporated (UNH) on Substack by Oguz Erkan. In this article, we will summarize the bulls’ thesis on UNH. UnitedHealth Group Incorporated (UNH)’s share was trading at $587.06 as of April 14th. UNH’s trailing and forward P/E were 37.85 and 19.72 respectively according to Yahoo Finance. UnitedHealth Group stands […]\nThe purchases are a sign of confidence despite growing concern about an economic slowdown this year.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 13-15_Gear Up for UnitedHealth (UNH) Q1 Earnings_ Wall Street Estimates for Key Metrics",
    "date": "",
    "content": "Title: Gear Up for UnitedHealth (UNH) Q1 Earnings_ Wall Street Estimates for Key Metrics\nDate: 2025-04-14 13:15\nURL: https://finance.yahoo.com/news/gear-unitedhealth-unh-q1-earnings-131518260.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nAnalysts on Wall Street project that UnitedHealth Group (UNH) will announce quarterly earnings of $7.27 per share in its forthcoming report, representing an increase of 5.2% year over year. Revenues are projected to reach $111.01 billion, increasing 11.2% from the same quarter last year.\nThe current level reflects an upward revision of 0.1% in the consensus EPS estimate for the quarter over the past 30 days. This demonstrates how the analysts covering the stock have collectively reappraised their initial projections over this period.\nAhead of a company's earnings disclosure, it is crucial to give due consideration to changes in earnings estimates. These revisions serve as a noteworthy factor in predicting potential investor reactions to the stock. Numerous empirical studies consistently demonstrate a strong relationship between trends in earnings estimate revision and the short-term price performance of a stock.\nWhile it's common for investors to rely on consensus earnings and revenue estimates for assessing how the business may have performed during the quarter, exploring analysts' forecasts for key metrics can yield valuable insights.\nGiven this perspective, it's time to examine the average forecasts of specific UnitedHealth metrics that are routinely monitored and predicted by Wall Street analysts.\nAnalysts expect 'Revenues- Products' to come in at $13.33 billion. The estimate indicates a year-over-year change of +11.9%.\nThe average prediction of analysts places 'Revenues- Services' at $9.76 billion. The estimate suggests a change of +9.8% year over year.\nAccording to the collective judgment of analysts, 'Revenues- Premiums' should come in at $86.94 billion. The estimate indicates a year-over-year change of +11.5%.\nAnalysts' assessment points toward 'Revenues- Investment and other income' reaching $1.06 billion. The estimate points to a change of +4.4% from the year-ago quarter.\nAnalysts predict that the 'Operating Statistics - Medical Care Ratio' will reach 85.9%. The estimate is in contrast to the year-ago figure of 84.3%.\nThe combined assessment of analysts suggests that 'UnitedHealthcare Customer Profile - People Served - Commercial - Domestic- Risk-based' will likely reach 9 million. Compared to the current estimate, the company reported 8.55 million in the same quarter of the previous year.\nThe consensus estimate for 'UnitedHealthcare Customer Profile - People Served - Commercial - Domestic- Fee-based' stands at 21.46 million. The estimate compares to the year-ago value of 20.87 million.\nBased on the collective assessment of analysts, 'UnitedHealthcare Customer Profile - People Served - Total Community and Senior' should arrive at 20.16 million. Compared to the current estimate, the company reported 19.77 million in the same quarter of the previous year.\nThe consensus among analysts is that 'UnitedHealthcare Customer Profile - People Served - Community and Senior - Medicare Advantage' will reach 8.21 million. The estimate compares to the year-ago value of 7.76 million.\nThe collective assessment of analysts points to an estimated 'UnitedHealthcare Customer Profile - People Served - Community and Senior - Medicaid' of 7.62 million. The estimate compares to the year-ago value of 7.68 million.\nIt is projected by analysts that the 'UnitedHealthcare Customer Profile - People Served - Community and Senior - Medicare Supplement (Standardized)' will reach 4.33 million. Compared to the current estimate, the company reported 4.33 million in the same quarter of the previous year.\nAnalysts forecast 'UnitedHealthcare Customer Profile - People Served - Medicare Part D stand-alone' to reach 2.81 million. The estimate is in contrast to the year-ago figure of 3.09 million.View all Key Company Metrics for UnitedHealth here>>>UnitedHealth shares have witnessed a change of +22.7% in the past month, in contrast to the Zacks S&P 500 composite's -3.6% move. With a Zacks Rank #2 (Buy), UNH is expected outperform the overall market performance in the near term. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nThis summer, UnitedHealth, Amedisys and antitrust regulators will have a magistrate judge’s help in hashing out a solution to the DOJ’s opposition to the merger.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nWe recently compiled a list of the 14 Best American Tech Stocks To Buy Now. In this article, we are going to take a look at where Broadcom Inc. (NASDAQ:AVGO) stands against the other American tech stocks. American stocks moved up a bit on Monday, April 14 as investors focused on news about tech companies […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nFinancial advisors assist you in achieving your financial goals.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 13-16_These Were the 2 Top-Performing Stocks in the Dow Jones Industrial Average in March 2025",
    "date": "",
    "content": "Title: These Were the 2 Top-Performing Stocks in the Dow Jones Industrial Average in March 2025\nDate: 2025-04-14 13:16\nURL: https://www.fool.com/investing/2025/04/14/these-were-the-2-top-performing-stocks-in-the-dow/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=5608733a-69bb-438d-976d-0de9dcfd2f6a&.tsrc=rss\nContent:\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, top-rated podcasts, and non-profit The Motley Fool Foundation.\nFounded in 1993, The Motley Fool is a financial services company dedicated to making the world smarter, happier, and richer. The Motley Fool reaches millions of people every month through our premium investing solutions, free guidance and market analysis on Fool.com, personal finance education, top-rated podcasts, and non-profit The Motley Fool Foundation.\nKey Points\nMarch 2025 might seem like ages ago in market years, as the Trump tariffs have rocked the market like few things before it. However, the trends in March are not so different from what's happening now, as consumer sentiment was rapidly weakening and fears of a recession were mounting before the tariff announcement.\nLet's take a look at the two best-performing Dow Jones Industrial Average (^DJI -1.73%) companies to see if they're worth buying today.\nImage source: Getty Images.\nUnitedHealth Group (UNH 0.30%) is one of the most resilient stocks on the market. Healthcare is considered a recession-proof industry, but health insurance is even more unaffected by the economy because people need coverage regardless.\nIt's not a surprise, then, that investors have piled into the stock in March and have continued to do so through the tariff-related chaos of April.\nThere was no major company-specific news out on UnitedHealth in March, and investors seem to be returning to the stock after it tumbled following the assassination of one of its executives in December 2024.\nUnitedHealth has been one of the rare winners on the stock market in April, gaining 15% thanks to a 5.06% increase in Medicare Advantage benchmarks and its reputation as a port in a storm during turbulent market times.\nChevron (CVX 0.65%) might seem like a surprise on this list as the energy sector is typically highly sensitive to the economic cycle.\nThe source of Chevron's gains was a surprising one, as Reuters reported that the company was angling for a piece of the data center market, developing the sites and supplying the electricity for facilities. \nData center demand is surging along with AI, and the energy to power it is at a premium.\nHowever, while that was a smart strategic move, it wasn't enough to keep the stock climbing in April as it fell sharply after tariffs were announced. Chevron will continue to be sensitive to the health of the global economy and oil prices.\n\n \n\nBefore you buy stock in UnitedHealth Group, consider this:\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and UnitedHealth Group wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $526,499!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $687,684!*\nNow, it’s worth noting Stock Advisor’s total average return is 818% — a market-crushing outperformance compared to 156% for the S&P 500. Don't miss out on the latest top 10 list, available when you join Stock Advisor.\nSee the 10 stocks ›\n\n*Stock Advisor returns as of April 14, 2025\n\n\nJeremy Bowman has no position in any of the stocks mentioned. The Motley Fool recommends UnitedHealth Group. The Motley Fool has a disclosure policy.\nThis tech could reach $80 trillion. Imagine a technology worth over 30 Nvidias.\nWhat in the world could be worth 30 Nvidias? The answer is a radical tech breakthrough that our experts think is transforming every walk of life. And this giant leap forward has many on Wall Street very excited.\nLearn more ›\nLimited Time: Get a $250 Bonus with This Cash Back Card!\nEarn $250 when you spend $500 in 3 months—that's an easy 50% return! Plus, enjoy 0% intro APR for 15 months & up to 5% cash back.\nStocks Mentioned\n\n*Average returns of all recommendations since inception. Cost basis and return based on previous market day close.\nRelated Articles\nMotley Fool Returns\nMarket-beating stocks from our flagship service.\nCalculated by average return of all stock recommendations since inception of the Stock Advisor service in February of 2002. Returns as of 04/16/2025.\nDiscounted offers are only available to new members. Stock Advisor list price is $199 per year.\nCalculated by Time-Weighted Return since 2002. Volatility profiles based on trailing-three-year calculations of the standard deviation of service investment returns.\n\n        Invest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\n      \nMaking the world smarter, happier, and richer.\n© 1995 - 2025 The Motley Fool. All rights reserved.\nMarket data powered by Xignite and Polygon.io.\nAbout The Motley Fool\nOur Services\nAround the Globe\nFree Tools\nAffiliates & Friends\nJoin Stock Advisor Now to Get Our Newest Rec and Save 50%*\nBy signing up today, you secure your spot to be among the first to receive our latest stock recommendation when it's released at 1 pm ET tomorrow!\nSince inception, Motley Fool Stock Advisor has beaten the S&P 500 by 662.32%!** Don't Miss Out!\n Continue ›\n*$99/year is a promotional price for new members only. 50% discount based on current list price of Stock Advisor of $199/year. Membership will renew annually at the then current list price.**Returns as of April 16, 2025."
  },
  {
    "title": "2025-04-14 13-35_“No China Exposure_ Incredible!” – Jim Cramer Flags UnitedHealth Group (UNH) as a Safe Haven",
    "date": "",
    "content": "Title: “No China Exposure_ Incredible!” – Jim Cramer Flags UnitedHealth Group (UNH) as a Safe Haven\nDate: 2025-04-14 13:35\nURL: https://finance.yahoo.com/news/no-china-exposure-incredible-jim-133512199.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer Discussed These 12 Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other stocks that Jim Cramer discussed.\nOn Thursday, Jim Cramer, host of Mad Money, described the 145% duty on China as so extreme that it essentially acts as an embargo rather than a conventional tariff.\n“We now have 145% tariff on Chinese goods. Now, a number that high frankly isn’t really a tariff. It’s more of an embargo. Almost nobody’s gonna pay that much of a markup. It’s a recipe for losing money.”\nREAD ALSO 10 Stocks on Jim Cramer’s Radar Recently and Jim Cramer Talked About These 8 Stocks\nCramer said that he believes Trump is more frustrated with prior administrations for what he sees as allowing China to take advantage of U.S. trade policy than he is with President Xi Jinping himself, who Trump continues to speak of respectfully. While Cramer acknowledged that he sympathizes with Trump’s objective, he warned that the country is not prepared to handle the fallout. “As a nation, shamefully, we’ve gotten addicted to cheap Chinese imports,” he said\n“I think what we saw today was the beginning of a sorting period between those that have no China exposure and those that do. Unfortunately, those that do employ a lot of people and are excellent companies, but they may not be excellent enough to make it through this new environment and that is a real shame.”\nCramer emphasized that while he believes the U.S. can function without economic ties to China, doing so would significantly raise domestic costs, drive up unemployment, and force reliance on other global partners. The stakes, he said, are enormous. “Yes, we have to take them on now or never,” he stated, but he cautioned that the consequences will involve more pain than the public is likely prepared to accept.\n“So the bottom line: Is it worth it? Depends. I think it’s worth some temporary pain to drive a hard bargain though and get a more favorable trade deal out of the Chinese government. But it’s not worth it to go back… [from] $439 billion in imports to zero. Unfortunately, I’m actually thinking that might be where we’\nFor this article, we compiled a list of 12 stocks that were discussed by Jim Cramer during the episode of Mad Money aired on April 10. We listed the stocks in the order that Cramer mentioned them. We also provided hedge fund sentiment for each stock as of the fourth quarter of 2024, which was taken from Insider Monkey’s database of over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 150\nCommenting on how people are investing in light of tariffs, Cramer mentioned UnitedHealth Group Incorporated (NYSE:UNH) and said:\n“Is the market reflecting any of this? No, but something else is happening too. People are investing in companies, just started yesterday, that don’t have all that much exposure to China or none. You can see it in healthcare, excluding drugs, which are still facing the possibility of their own set of tariffs. UnitedHealth Group and Humana are good examples. They were up once again. I mean it’s really incredible. Former up nearly 3%, The latter up 2%.”\nUnitedHealth Group (NYSE:UNH) is a healthcare company that provides health benefit plans, care delivery, pharmacy services, and health management programs. It supplies software, consulting, and data products to businesses in the healthcare industry.\nParnassus Investments stated the following regarding UnitedHealth Group Incorporated (NYSE:UNH) in its Q4 2024 investor letter:\n“We sold two Health Care positions during the quarter, pharmaceutical company AstraZeneca and insurerUnitedHealth Group Incorporated (NYSE:UNH). UnitedHealth’s business model is becoming higher-risk, which coupled with slowing Medicare Advantage growth and regulatory uncertainty led to us exiting the position.\nOverall, UNH ranks 2nd on our list of stocks that Jim Cramer discussed. While we acknowledge the potential of UNH as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than UNH but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nBOSTON/LONDON (Reuters) -Some trade policy relief and strong bank earnings were not enough to keep Wall Street from pushing U.S. stocks down slightly on Tuesday, although U.S. government bonds and the dollar regained some ground after sharp declines last week.  U.S. President Donald Trump on Monday said he was considering a modification to the 25% tariffs imposed on foreign auto and auto parts imports from Mexico, Canada and other places.  That followed the move late on Friday to exempt smartphones, computers and some other electronics from Trump's \"reciprocal\" tariffs.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nBarclays Bank offers high-yield online savings accounts and CDs. Learn more about Barclays' interest rates, fees and more with this in-depth expert review.\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-14 16-00_What Makes UnitedHealth Group (UNH) a Strong Momentum Stock_ Buy Now_",
    "date": "",
    "content": "Title: What Makes UnitedHealth Group (UNH) a Strong Momentum Stock_ Buy Now_\nDate: 2025-04-14 16:00\nURL: https://finance.yahoo.com/news/makes-unitedhealth-group-unh-strong-160003229.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nMomentum investing is all about the idea of following a stock's recent trend, which can be in either direction. In the 'long' context, investors will essentially be \"buying high, but hoping to sell even higher.\" And for investors following this methodology, taking advantage of trends in a stock's price is key; once a stock establishes a course, it is more than likely to continue moving in that direction. The goal is that once a stock heads down a fixed path, it will lead to timely and profitable trades.\nEven though momentum is a popular stock characteristic, it can be tough to define. Debate surrounding which are the best and worst metrics to focus on is lengthy, but the Zacks Momentum Style Score, part of the Zacks Style Scores, helps address this issue for us.\nBelow, we take a look at UnitedHealth Group (UNH), a company that currently holds a Momentum Style Score of B. We also talk about price change and earnings estimate revisions, two of the main aspects of the Momentum Style Score.\nIt's also important to note that Style Scores work as a complement to the Zacks Rank, our stock rating system that has an impressive track record of outperformance. UnitedHealth Group currently has a Zacks Rank of #2 (Buy). Our research shows that stocks rated Zacks Rank #1 (Strong Buy) and #2 (Buy) and Style Scores of A or B outperform the market over the following one-month period.\nYou can see the current list of Zacks #1 Rank Stocks here >>>\nLet's discuss some of the components of the Momentum Style Score for UNH that show why this largest U.S. health insurer shows promise as a solid momentum pick.\nA good momentum benchmark for a stock is to look at its short-term price activity, as this can reflect both current interest and if buyers or sellers currently have the upper hand. It is also useful to compare a security to its industry, as this can help investors pinpoint the top companies in a particular area.\nFor UNH, shares are up 14.17% over the past week while the Zacks Medical - HMOs industry is up 1.21% over the same time period. Shares are looking quite well from a longer time frame too, as the monthly price change of 22.68% compares favorably with the industry's 2.76% performance as well.\nWhile any stock can see its price increase, it takes a real winner to consistently beat the market. That is why looking at longer term price metrics -- such as performance over the past three months or year -- can be useful as well. Over the past quarter, shares of UnitedHealth Group have risen 17.6%, and are up 36.49% in the last year. In comparison, the S&P 500 has only moved -7.64% and 4.64%, respectively.\nInvestors should also pay attention to UNH's average 20-day trading volume. Volume is a useful item in many ways, and the 20-day average establishes a good price-to-volume baseline; a rising stock with above average volume is generally a bullish sign, whereas a declining stock on above average volume is typically bearish. UNH is currently averaging 5,807,295 shares for the last 20 days.\nThe Zacks Momentum Style Score encompasses many things, including estimate revisions and a stock's price movement. Investors should note that earnings estimates are also significant to the Zacks Rank, and a nice path here can be promising. We have recently been noticing this with UNH.\nOver the past two months, 1 earnings estimate moved higher compared to none lower for the full year. These revisions helped boost UNH's consensus estimate, increasing from $29.63 to $29.73 in the past 60 days. Looking at the next fiscal year, 2 estimates have moved upwards while there have been no downward revisions in the same time period.\nGiven these factors, it shouldn't be surprising that UNH is a #2 (Buy) stock and boasts a Momentum Score of B. If you're looking for a fresh pick that's set to soar in the near-term, make sure to keep UnitedHealth Group on your short list.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nLast week's rally in the broader stock market indexes sprung the Nasdaq Composite (NASDAQINDEX: ^IXIC) back upward after a more than 20% that technically put it into a bear market.  Income investors looking at the current landscape may be wondering if now is the best time to buy dividend stocks given the wild swings to the upside and the downside.  Here are some risks worth considering before buying dividend stocks and why ExxonMobil (NYSE: XOM) is a good example of a dividend stock that you can buy with confidence during a bear market.\nHere are our top picks for the best online brokers for bonds.\nHere’s how inheriting an annuity works and what to do with it.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nA personal loan could be a good way to pay for emergencies.\nDeciding between a $500,000 lump sum or $3,500 monthly annuity payments for your pension isn’t straightforward and involves weighing several personal factors. You need to consider how long you might live, which impacts how much total money you’ll get from monthly payments, alongside your retirement age to see how long your funds need to last. […] The post Should I Take a $500,000 Lump Sum or $3,500 Monthly Payments for My Pension? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 08-00_The fallout from UnitedHealth’s CEO slaying",
    "date": "",
    "content": "Title: The fallout from UnitedHealth’s CEO slaying\nDate: 2025-04-15 08:00\nURL: https://www.pharmavoice.com/news/united-healthcare-ceo-brian-thompson-pharma-pbm-moderna-pfizer/745309/?.tsrc=rss\nContent:\nLet PharmaVoice’s free newsletter keep you informed on what industry leaders are saying, straight from your inbox.\n                    \n                \n            \n\nBrian Thompson’s murder has raised questions about the cost of U.S. healthcare, embroiling insurers, drugmakers and PBMs in a battle for the future of the industry.\nWhat started as the shocking murder of a healthcare executive has now become a watershed moment for an entire industry.\nBrian Thompson, the CEO of UnitedHealthcare, was gunned down in December while walking along a Manhattan sidewalk. After an intense manhunt, the suspected assailant was caught and identified as Luigi Mangione.\nThe case against 26-year-old Mangione, which includes state and federal charges, is moving swiftly. U.S. Attorney General Pam Bondi announced earlier this month that the Justice Department will seek the death penalty against Mangione, who allegedly wrote the words “delay,” “deny” and “depose” on shell casings used in the murder of the health insurance executive. Mangione’s lawyers have since asked a federal judge to block the DOJ’s attempt at capital punishment.\nAnd while Mangione’s courtroom drama unfolds, the slaying’s impact is still rippling through the healthcare industry, from payers to pharma.\nNews of the murder uncorked long-simmering outrage across the country over insurer profits and patients’ struggles to pay for healthcare. Scrutiny of UnitedHealth — the largest U.S. health insurance company — has quickly intensified.\nWith a market capitalization of over $400 billion, UnitedHealth brings in as much revenue as the tech giant Apple. \nLaunched in the 1970s in Minnesota, the insurance company built its empire through a string of deals that expanded its reach. Several large acquisitions deepened United’s investment into the Medicare coverage field. It also swallowed up several insurance competitors, bought hundreds of surgical sites, became a player in the home health industry and launched a pharmacy benefit manager called Optum Rx.\nThroughout its history, UnitedHealth has been embroiled in controversies that include antitrust suits and a stock manipulation scandal in 2006 that led its CEO to resign.\nBefore Thompson was murdered, UnitedHealth was being investigated by the DOJ for potential antitrust activities, and PBMs in general have been under a microscope from U.S. lawmakers over their role in drug pricing. Now, more revelations have turned the heat up on UnitedHealth’s business dealings in the fraught U.S. healthcare system.\nA range of policymakers and regulators are unpacking more about the company’s far-reaching business — and United is fighting back by blaming the pharma industry and other players in healthcare. Meanwhile, industry executives have been shoring up security as distrust and criticisms of the industry mount. \nThe killing of a chief executive shed light on the disparities inherent in a system that rewards corporate profit-seeking while leaving millions of patients unable to afford life-saving medications.\nKeep up with the story. Subscribe to the PharmaVoice free daily newsletter\nBefore Thompson’s assassination, UnitedHealth was raking in billions from price hikes from 2017 to 2022 on drugs for patients with conditions like heart disease and cancer, according to a report from the Federal Trade Commission. \nAlong with fellow PBMs Cigna and CVS Health, drug markups with percentages sometimes in the thousands drove revenue of $7.3 billion above what they paid for the drugs in the first place, the regulator said.\nInvestigators have found that these companies allegedly continue to pump up revenues through extralegal means. An audit in Tennessee revealed that Cigna’s Express Scripts in 2023 mishandled transactions with pharmacies to keep from paying reimbursements.\nUnitedHealth has also raked in profit from government insurers like Medicare. Through Medicare Advantage, PBMs made about $33 billion in 2021 from coding diagnoses that exaggerated patients’ conditions to pull in more from the program, and UnitedHealth made up about half of those additional payments, according to a report in the Annals of Internal Medicine.\nIn response to the scrutiny, United hasn’t conceded much with its business model. Instead, the insurance giant has blamed the pharma industry.\nDuring the company’s end-of-year earnings call in January, UnitedHealth Group CEO Andrew Witty pointed to the high cost of drugs in the U.S. compared to other countries and specifically called out GLP-1 drugmakers, noting that “one drug which costs $900 in the U.S. costs about a tenth of that in Europe.” He also defended the role of Optum Rx in negotiating “many tens of billions of dollars in savings” for patients and passing through 98% of rebates directly to patients. \nBeyond drug prices, Witty said that hospitals benefit from higher costs for healthcare services. The comments came as the company declared record revenues in 2024 that topped $400 billion.\nIn the months since, United has made at least one notable change on the PBM side: Optum Rx will stop requiring reauthorizations for around 80 drugs. The move will eliminate some paperwork burdens for physicians and patients and cut about 10% of Optum’s prior authorizations, the PBM said in March. \nPrior authorizations, which require providers to receive approval from a patient’s insurance plan before providing a service or drug, are a major source of discontent among providers and patients. UnitedHealthcare also said last month that it planned to reduce 10% of prior authorizations this year.\nWhile much of the public ire related to the Thompson murder has been directed at health insurers, a range of companies are investing in beefed up security for their top executives.\nOver 70% of companies across industries have security plans in place for their top leaders, according to a survey conducted by HR Policy Association released earlier this year. While 37% focus their security efforts solely on the CEO, nearly 70% provide protection for all C-suite executives, and most use third-party contractors. Over half of the 180 respondents to the survey said they are prioritizing security for travel and physical safety in 2025.\nIn pharma, the increased emphasis on safety was acutely felt at the J.P. Morgan Healthcare Conference in San Francisco in January, which is one of the industry’s largest events of the year. The San Francisco Police Department added barriers and checkpoints to the event’s main hub — the Westin St. Francis hotel — and canceled some officers’ days off to make sure the event was fully staffed.\nProxy statements released this year have also revealed just how much large pharmas are shelling out to protect their executives. About $960,000 of Moderna’s CEO pay package for Stéphane Bancel was used for security in 2024.\nPfizer spent more than $661,000 to protect CEO Albert Bourla, while Gilead Sciences reported more than $285,000 in security services for CEO Daniel O’Day. In general, other large pharmas — including Johnson & Johnson, AbbVie, Merck & Co. and Eli Lilly — spent between $70,000 and $200,000 on CEO security last year.\nGet the free daily newsletter read by industry leaders\nBrian Thompson’s murder has raised questions about the cost of U.S. healthcare, embroiling insurers, drugmakers and PBMs in a battle for the future of the industry.\nSubscribe to PharmaVoice for important stories, insights & perspectives\nGet the free daily newsletter read by industry leaders\nBrian Thompson’s murder has raised questions about the cost of U.S. healthcare, embroiling insurers, drugmakers and PBMs in a battle for the future of the industry.\nThe free newsletter covering the top industry headlines\nFacing price negotiations, patent cliffs and trade tariffs, big pharma is refining its strategy. Explore how industry leaders are navigating a complex landscape in this Trendline."
  },
  {
    "title": "2025-04-15 10-07_UnitedHealth to enter mediation with DOJ over Amedisys deal",
    "date": "",
    "content": "Title: UnitedHealth to enter mediation with DOJ over Amedisys deal\nDate: 2025-04-15 10:07\nURL: https://www.healthcaredive.com/news/unitedhealth-amedisys-doj-mediation/745386/?.tsrc=rss\nContent:\nLet Healthcare Dive’s free newsletter keep you informed, straight from your inbox.\n                    \n                \n            \n\nThis summer, UnitedHealth, Amedisys and antitrust regulators will have a magistrate judge’s help in hashing out a solution to the DOJ’s opposition to the merger.\nUnitedHealth’s health services division Optum first announced plans to buy Amedisys in summer 2023 after a bidding war over the Louisiana-based home health and hospice provider. Amedisys shareholders approved the deal later that year.\nHowever, the merger has been held up by antitrust regulators, who say UnitedHealth’s ownership of LHC Group, a rival to Amedisys that UnitedHealth acquired for $5.4 billion in 2023, is cause for concern.\nIf the transaction goes through, Optum will control 30% or more of the home health or hospice markets in eight states, the DOJ said in its complaint. The deal will also add 500 care sites to Optum’s home health and hospice portfolio and extend its reach into five additional states, harming patients and providers by eliminating competition, according to the DOJ.\nUnitedHealth and Amedisys, which deny that their merger would have anticompetitive effects, have offered plans to divest businesses to ameliorate the DOJ’s concerns.\nMost recently, UnitedHealth and Amedisys offered to sell more than 120 home health and hospice facilities, according to a court filing in February. If the sales are approved, UnitedHealth would only operate 10% of home health and 4% of hospice services in the U.S.\nStill, the offers have not proved sufficient for the DOJ, which has grown increasingly concerned about the size and influence of UnitedHealth — a company that operates one of the largest insurers in the nation, a major pharmacy benefit manager and a healthcare technology company, while employing thousands of physicians.\nThe DOJ is reportedly investigating the conglomerate for its potential anticompetitive effects, including the relationship between Optum and its insurer UnitedHealthcare. Meanwhile, the Federal Trade Commission is suing UnitedHealth’s PBM, Optum Rx, along with other PBMs for allegedly driving up the price of insulin.\nGet the free daily newsletter read by industry experts\nKennedy’s views on vaccines in particular are causing alarm among some physicians and investors.\nPhysician groups slammed Congress for allowing a 2.8% cut to their Medicare pay to go into effect.\nSubscribe to Healthcare Dive for top news, trends & analysis\nGet the free daily newsletter read by industry experts\nKennedy’s views on vaccines in particular are causing alarm among some physicians and investors.\nPhysician groups slammed Congress for allowing a 2.8% cut to their Medicare pay to go into effect.\nThe free newsletter covering the top industry headlines"
  },
  {
    "title": "2025-04-15 11-23_UnitedHealth Group (UNH)_ One of the Best Dividend Paying Stock According to Hedge Funds",
    "date": "",
    "content": "Title: UnitedHealth Group (UNH)_ One of the Best Dividend Paying Stock According to Hedge Funds\nDate: 2025-04-15 11:23\nURL: https://finance.yahoo.com/news/unitedhealth-group-unh-one-best-112336073.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks.\nDividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining the historical performance of the broader market. Between 1960 and 2024, a $10,000 investment in the index would have grown to over $982,000 purely from stock price appreciation, based on data from FactSet and NYU Stern. However, many companies in the index also returned capital to shareholders through dividends. Had an investor reinvested those dividends over the years, the investment would have ballooned to approximately $6.42 million by the beginning of 2025.\nThis outlook seems reasonable, especially when considering how crucial cash flow has become in today’s economic environment. Investors continue to favor income-generating assets, and dividends remain one of the most reliable ways to deliver that income. Reflecting this trend, several companies within the market have recently introduced dividend payments.\nAccording to S&P Global, companies in the S&P index now contribute roughly 85% of the total dividends paid across the market—up from 82% in 2024. This increase includes 2.7% of the total dividend pool coming from firms that only recently began issuing dividends. The top 29 companies in the index alone are responsible for 40% of all dividends paid by the index’s constituents and 35% of the total dividends across the entire US equity market. Under the current base-case forecast, these leading firms are expected to distribute a combined $280 billion in dividends. In a more optimistic (upside) scenario, that figure could climb by 2.75% to $288 billion, with major large cap companies projected to deliver the most significant gains by weighted average. If the most favorable (bull-case) conditions materialize, these 29 companies could boost total dividend payouts by an estimated 4.5%, contributing an additional 1% themselves.\nIt’s no surprise, then, that dividends have become a central theme in many investors’ strategies. According to Brian Bollinger, founder of Simply Safe Dividends, focusing on companies that regularly pay dividends can offer a sense of reassurance. He further noted that younger investors, in particular, have the opportunity to build long-term dividend growth portfolios aimed at maximizing total return and capital appreciation over time.\nAccording to Nuveen, companies that focus on dividend growth tend to possess strong long-term fundamentals and may deliver relatively attractive performance in the year ahead. Historically, firms that consistently increased or initiated dividend payments have produced higher annualized returns and exhibited lower volatility compared to the broader equity market. While such companies may not lead in every market environment, their favorable risk-adjusted returns over extended periods make them a solid foundation for equity portfolios.\nNuveen also suggested that many firms remain in a strong position to continue raising dividends over time. In the US, corporate balance sheets are generally healthy, consumer spending remains steady, and earnings growth is projected to pick up pace in 2025. Data from FactSet shows that dividends per share for the S&P index rose by 7.6% in 2024, with consensus forecasts pointing to a further 4.2% increase in 2025.\nA senior healthcare professional giving advice to a patient in a clinic.\nFor this list, we scanned Insider Monkey’s database of over 1,000 hedge funds, as of the close of Q4 2024. From the top 60 companies, we selected 11 dividend stocks with yields of at least 1% as of April 12. These companies show strong financial performance and have solid records of paying dividends. The stocks are ranked according to the number of hedge funds having stakes in them.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 150\nUnitedHealth Group Incorporated (NYSE:UNH) is an American health insurance company. It is well-positioned for steady growth thanks to its broad-based business model, which spans health insurance, pharmacy benefit management, and healthcare services. This integrated setup not only enhances care efficiency but also boosts cross-selling opportunities. The stock is returning strong returns this year, surging by nearly 19% since the start of 2025.\nAnalysts have praised the company’s ability to trim its operating cost ratio, which dropped to 13.2% in 2024 from 14.7% the previous year, largely due to strategic adjustments in its business portfolio—moves that support long-term profitability.\nIn fiscal 2024, UnitedHealth Group Incorporated (NYSE:UNH) surpassed investor expectations, with revenue climbing 8% to $400 billion, supported by solid performance across all service areas. Operating earnings came in at $32.3 billion, and after accounting for expenses tied to a cyberattack and difficulties in South America, adjusted earnings totaled $34.4 billion.\nUnitedHealth Group Incorporated (NYSE:UNH) also maintained robust cash flow, generating $24.2 billion in operating cash flow, equivalent to 1.6 times its net income. It returned more than $16 billion to shareholders via dividends and share repurchases. The company’s return on equity reached 23.7% in the fourth quarter, reflecting both strong earnings and effective capital allocation. UnitedHealth paid a quarterly dividend of $2.10 per share, yielding 1.40%, as of April 12. The company has consistently paid dividends since 2010.\nOverall, UNH ranks 2nd on our list of the best dividend paying stocks according to hedge funds. While we acknowledge the potential of UNH as an investment, our conviction lies in the belief that some deeply undervalued dividend stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. If you are looking for a deeply undervalued dividend stock that is more promising than UNH but that trades at 10 times its earnings and grows its earnings at double digit rates annually, check out our report about the dirt cheap dividend stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nWe recently published a list of the 11 Most Undervalued Quality Stocks to Buy Now. In this article, we are going to take a look at where State Street Corp. (NYSE:STT) stands against other undervalued quality stocks to buy now. On February 24, Kayne Anderson Rudnick chief market strategist Julie Biel joined ‘The Exchange’ on […]\nServiceNow (NYSE: NOW) stock is moving higher in Tuesday's trading.  The software specialist's share price was up 1.9% as of 2:30 p.m. ET, and been up as much as 3.1% earlier in the day.  Two investment firms updated their valuation forecasts for ServiceNow today and lowered their respective price targets on the stock.\nWe recently published a list of the 10 Best Value Dividend Stocks to Buy According to Billionaires. In this article, we are going to take a look at where Citigroup Inc. (NYSE:C) stands against other best value dividend stocks. Dividends, though sometimes underappreciated, have significantly contributed to long-term investor gains. Between 1960 and the end of […]\nNeil Woodford is plotting a fresh comeback six years after the collapse of his investment fund, announcing plans to launch a stock advice app for “thoughtful” investors.\nAfter reporting better-than-expected first quarter results, Goldman Sachs Group Inc. (NYSE:GS) highlighted in its earnings call that the bank navigated the market volatility with record equity revenue and warned about “material risks” to the U.S. and global economies amid the ongoing trade war. What Happened: Goldman Sachs navigated a quarter of “rapidly shifting sentiment” to deliver robust first-quarter 2025 results, highlighted by a record $4.2 billion in equities net revenue, according to it\nThe biotech market is taking a beating amid Trump’s turbulent economic policies.\nOnce inside a company, a deepfake employee can launch a cyberattack for financial gain, warns fraud detection firm Pindrop.\n(Reuters) -     U.S. bank PNC Financial  (PNC) reported a rise in first-quarter profit on Tuesday, helped by a boost in interest income.\nWe recently published a list of the 11 Most Undervalued Quality Stocks to Buy Now. In this article, we are going to take a look at where Bank of New York Mellon Corp. (NYSE:BK) stands against other undervalued quality stocks to buy now. On February 24, Kayne Anderson Rudnick chief market strategist Julie Biel joined […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 15-00_Key Large Cap Reports to Watch This Week",
    "date": "",
    "content": "Title: Key Large Cap Reports to Watch This Week\nDate: 2025-04-15 15:00\nURL: https://finance.yahoo.com/news/key-large-cap-reports-watch-150000362.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nEarnings season is always exciting for investors, with companies finally pulling the curtain back and unveiling what’s happened behind the scenes. Guidance is notably more critical this reporting cycle, given the recent tariff-induced spooks that we’ve become accustomed to.\nImportantly, several notable large-cap stocks are reporting this week, a list that includes Progressive PGR and UnitedHealth UNH. As shown below, PGR and UNH shares have shown great relative strength in 2025.\nImage Source: Zacks Investment Research\nLet’s take a closer look at what to expect from each.\nUnitedHealth Group offers a full spectrum of health benefits, with its Optum segment using data and technology to improve care delivery and health outcomes.\nUNH is currently a Zacks Rank #2 (Buy), with the earnings estimate revisions trend for its upcoming release largely stable over recent months. Top line revisions have also primarily remained stable, with the company expected to see 5% EPS growth on 11% higher sales.\nImage Source: Zacks Investment Research\nShares presently trade at a 19.5X forward 12-month earnings multiple, in line with the five-year median and beneath a 26.6X five-year high. The current PEG ratio works out to 1.6X, above the 1.4X five-year median and off modestly from 1.9X five-year highs.\nImage Source: Zacks Investment Research\nProgressive is one of the largest auto and property insurers in the U.S., known for its direct-to-consumer model and strong underwriting performance. The company offers various insurance products, including auto, home, renters, and commercial lines.\nThe stock is currently a Zacks Rank #2 (Buy), with earnings expectations moving higher across the board. As shown below, the revisions trend for the upcoming print has been notably bullish, up 27% over the last 60 days.\nImage Source: Zacks Investment Research\nRevenue revisions have remained stagnant, with PGR expected to see a big 27% year-over-year increase in EPS on nearly 20% higher sales. The company has been a star earnings performer overall, exceeding the Zacks Consensus EPS estimate by an average of 18% across its last four releases.\nShares presently trade at a 17.6X forward 12-month earnings multiple, which compares to a 19.3X five-year median and 31.9X five-year highs. The stock sports a Style Score of ‘C’ for Value.\nImage Source: Zacks Investment Research\nBottom Line\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive PGR and UnitedHealth UNH partly headlining the reporting docket.\nGuidance will be key from both companies, but it’s worth mentioning that both companies are largely insulated from tariff worries thanks to their domestic operations, reflecting a key differentiator in today’s political climate.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nThe Progressive Corporation (PGR) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nThe kidney dialysis firm doesn’t have an estimate for how long disruption from the attack will last, though DaVita stressed it’s continuing to provide patient care.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nUnitedHealth Group is set to benefit from the Trump administration’s Medicare reimbursement rate hike.\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Eli Lilly and Company (NYSE:LLY) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big […]\nShares of Viking Therapeutics (VKTX) and Structure Therapeutics (GPCR) are on the rise on Monday after Pfizer (PFE) announced its decision to discontinue development of danuglipron, an oral glucagon-like peptide-1 receptor agonist, which was being investigated for chronic weight management. While Morgan Stanley predicts “limited reaction” in Pfizer’s shares following the news, JPMorgan tells investors that the decision is “mostly a positive” for Structure and Viking, both developing drugs in the\nOn Monday, Novo Nordisk A/S (NYSE:NVO) said it had become aware of several hundred units of Ozempic (semaglutide) injection 1 mg distributed outside the Novo Nordisk authorized supply chain in the U.S. The seized counterfeit products feature lot number PAR0362 and illegitimate serial numbers beginning with the first eight digits 51746517. Lot number PAR0362 is an authentic lot number. Only when the lot number is coupled with the eight digits 51746517 it is counterfeit and should not be used. Als\nPFE's decision to scrap the development of danuglipron comes after a study participant develops potential drug-induced liver injury.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 16-09_UnitedHealth Group Incorporated (UNH)_ A Bull Case Theory",
    "date": "",
    "content": "Title: UnitedHealth Group Incorporated (UNH)_ A Bull Case Theory\nDate: 2025-04-15 16:09\nURL: https://finance.yahoo.com/news/unitedhealth-group-incorporated-unh-bull-160952983.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe came across a bullish thesis on UnitedHealth Group Incorporated (UNH) on Substack by Oguz Erkan. In this article, we will summarize the bulls’ thesis on UNH. UnitedHealth Group Incorporated (UNH)'s share was trading at $587.06 as of April 14th. UNH’s trailing and forward P/E were 37.85 and 19.72 respectively according to Yahoo Finance.\nValeri Potapova/Shutterstock.com\nUnitedHealth Group stands as a powerful compounder in the healthcare space, benefiting from the defensive nature of health insurance—a category of spending that consumers prioritize even during economic downturns. In uncertain times, discretionary expenses like tech upgrades, dining out, and travel are often the first to go, but health insurance remains untouchable due to the catastrophic financial consequences of going uninsured. This dynamic gives health insurers, especially UnitedHealth, exceptional pricing power, allowing them to pass on rising costs without losing customers. UnitedHealth’s dominance is underpinned by its vertical integration, particularly through its health services arm, Optum, which continues to grow at a healthy clip above 10% annually. Despite recent concerns sparked by the tragic death of its insurance CEO and skepticism voiced by Bill Ackman regarding profitability, the company’s fundamentals remain unshaken. These events created temporary dislocations in the stock, which long-term believers used as buying opportunities. UnitedHealth’s revenue has compounded at 11% annually over the past five years, and despite modest net profit and return on equity margins at 5%, the consistency and resilience of its business model position it as a reliable performer in all market conditions. Its forward P/E of 20 reflects a fair valuation, especially considering the current environment. The stock has already gained 22% year-to-date, outperforming a declining S&P 500, and still presents a compelling opportunity for investors—particularly on any dip below the $550 level. For those seeking tariff-proof exposure with strong cost-passing capabilities and a resilient growth engine, UnitedHealth remains a top-tier choice. The combination of its indispensable service, stable financials, and strategic integration make it a long-term winner, regardless of market cycles.\nUnitedHealth Group Incorporated (UNH) is on our list of the 30 Most Popular Stocks Among Hedge Funds. As per our database, 150 hedge fund portfolios held UNH at the end of the fourth quarter which was 112 in the previous quarter. While we acknowledge the risk and potential of UNH as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns, and doing so within a shorter timeframe. If you are looking for an AI stock that is more promising than UNH but that trades at less than 5 times its earnings, check out our report about the cheapest AI stock.\nREAD NEXT: 8 Best Wide Moat Stocks to Buy Now and 30 Most Important AI Stocks According to BlackRock.\nDisclosure: None. This article was originally published at Insider Monkey.\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nServiceNow (NYSE: NOW) stock is moving higher in Tuesday's trading.  The software specialist's share price was up 1.9% as of 2:30 p.m. ET, and been up as much as 3.1% earlier in the day.  Two investment firms updated their valuation forecasts for ServiceNow today and lowered their respective price targets on the stock.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nThis summer, UnitedHealth, Amedisys and antitrust regulators will have a magistrate judge’s help in hashing out a solution to the DOJ’s opposition to the merger.\nWe recently published a list of the 10 High Growth Forever Dividend Stocks to Invest In. In this article, we are going to take a look at where Visa Inc. (NYSE:V) stands against other high growth forever dividend stocks. Dividend stocks have trailed the broader market over the past two years, largely due to investors favoring […]\nWe came across a bullish thesis on Heartland Express, Inc. (HTLD) on Substack by Unemployed Value Degen. In this article, we will summarize the bulls’ thesis on HTLD. Heartland Express, Inc. (HTLD)’s share was trading at $8.44 as of April 14th. HTLD’s forward P/E was 833.33 according to Yahoo Finance. Heartland Express (HTLD) presented at the JP […]\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Eli Lilly and Company (NYSE:LLY) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big […]\nIn this issue: renewables adoption at Australian mines; bolstering critical mineral mapping; improving efficiency of crushing and grinding, and more.\nWe came across a bullish thesis on Stryker Corporation (SYK) on Substack by Magnus Ofstad. In this article, we will summarize the bulls’ thesis on SYK. Stryker Corporation (SYK)’s share was trading at $353.42 as of April 14th. SYK’s trailing and forward P/E were 45.54 and 26.04 respectively according to Yahoo Finance. Stryker (SYK) stands out as […]\nOn Monday, Novo Nordisk A/S (NYSE:NVO) said it had become aware of several hundred units of Ozempic (semaglutide) injection 1 mg distributed outside the Novo Nordisk authorized supply chain in the U.S. The seized counterfeit products feature lot number PAR0362 and illegitimate serial numbers beginning with the first eight digits 51746517. Lot number PAR0362 is an authentic lot number. Only when the lot number is coupled with the eight digits 51746517 it is counterfeit and should not be used. Als\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 17-26_Jim Cramer Calls UnitedHealth Group Incorporated (UNH) a Universal Buy – “The Only Gimme”",
    "date": "",
    "content": "Title: Jim Cramer Calls UnitedHealth Group Incorporated (UNH) a Universal Buy – “The Only Gimme”\nDate: 2025-04-15 17:26\nURL: https://finance.yahoo.com/news/jim-cramer-calls-unitedhealth-group-172658143.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses.\nOn Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing to earnings reports from major banks.\n“Rumor, innuendo, intrigue these are the stuff of great novels, of fabulous miniseries, riveting plays, and now they’re the stuff of the stock market.”\nREAD ALSO: Jim Cramer Discussed These 12 Stocks and 10 Stocks on Jim Cramer’s Radar Recently.\nHe noted the chaotic nature of the current environment and remarked that “this tape has it all,” and emphasized how unpredictable developments from the White House have added to the turbulence. Cramer noted that information is being released constantly, through press conferences, posts on Truth Social, or casual remarks, and that each has the potential to move vast sums of money across asset classes.\n“Trillions of dollars in and out of bonds, of currency, of gold, of crypto,” he said, all based on impulsive statements. He pointed out the sheer volume of contradictions in the news cycle and stressed, “Except this isn’t an eight-part blockbuster, it’s our money.” Cramer lamented how even social media activity, like tweets, can trigger massive swings in the markets. He noted that Friday’s market action felt like it was shaped entirely by this dynamic.\nCramer questioned whether the market might be in the process of forming what he called a “liberation day bottom,” a moment when selling pressure finally ends because investors feel that all the bad news is out. But he acknowledged the uncertainty of that theory as he said, “Not sure, I’m just not sure.” He added:\n“Have you ever noticed the weekends don’t provide relaxation anymore because the president’s got advisors? He’s got to put people out. He wants to tweet. He’s got meetings. No relaxation time, no downtime…. Monday’s trading, well, let’s just say that it looks like that it’s earning season so it’s gonna be even harder than usual.”\nFor this article, we compiled a list of 15 stocks that were discussed by Jim Cramer during the episode of Mad Money aired on April 11. We listed the stocks in the order that Cramer mentioned them. We also provided hedge fund sentiment for each stock as of the fourth quarter of 2024, which was taken from Insider Monkey’s database of over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nNumber of Hedge Fund Holders: 150\nCalling UnitedHealth Group Incorporated (NYSE:UNH) a “universal buy”, Cramer said:\n“How about a gimme? I think this company’s the only gimme that I’ve seen this week. This is as close to one as you’re gonna find, not too high a price-to-earnings multiple, not yet overly loved, purely domestic business, has pricing power. This is it. It’s a universal buy.”\nUnitedHealth Group (NYSE:UNH) is a healthcare organization that offers health plans, care services, pharmacy support, and wellness programs. It also delivers software, consulting, and data tools to companies in the healthcare sector. Burke Wealth Management stated the following regarding UnitedHealth Group Incorporated (NYSE:UNH) in its Q4 2024 investor letter:\n“UnitedHealth Group Incorporated (NYSE:UNH): Before I discuss our decision to reduce United Health, I want to express our sadness and disgust regarding the tragic murder of UHC CEO Brian Thompson. Our thoughts and prayers are with his family. His murder played no role in our decision to reduce UNH.\nOverall, UNH ranks 12th on our list of stocks that Jim Cramer discusses. While we acknowledge the potential of UNH as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than UNH but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nThis summer, UnitedHealth, Amedisys and antitrust regulators will have a magistrate judge’s help in hashing out a solution to the DOJ’s opposition to the merger.\nWild fluctuations on Wall Street represent the ideal time for investors to put their cash to work.\nThe kidney dialysis firm doesn’t have an estimate for how long disruption from the attack will last, though DaVita stressed it’s continuing to provide patient care.\nThese retail stocks may be well-positioned to weather tariff headwinds.\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Eli Lilly and Company (NYSE:LLY) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big […]\nPFE's decision to scrap the development of danuglipron comes after a study participant develops potential drug-induced liver injury.\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Novo Nordisk A/S (NYSE:NVO) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big American […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-15 19-00_CVS Health vs. UnitedHealth_ Which Healthcare Stock Has More Upside_",
    "date": "",
    "content": "Title: CVS Health vs. UnitedHealth_ Which Healthcare Stock Has More Upside_\nDate: 2025-04-15 19:00\nURL: https://finance.yahoo.com/news/cvs-health-vs-unitedhealth-healthcare-190000788.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nCurrently, CVS Health CVS and UnitedHealth Group UNH are two major vertically integrated behemoths in the U.S. healthcare market and key constituents of the S&P 500 index. Both companies have transformed beyond their original identities — CVS Health from a retail pharmacy chain into a healthcare powerhouse through its acquisition of Aetna and UnitedHealth from a traditional insurer into a tech-enabled care provider via its expansive Optum platform. Each now combines insurance, care delivery, pharmacy benefit management (PBM) and value-based service models to offer end-to-end healthcare solutions.\nFor investors, it is difficult to choose between the two, as both CVS and UnitedHealth continue to diversify their revenue streams and scale up their clinical and digital infrastructure. While they share structural similarities in business segmentation — insurance, health services, and pharmacy operations — their financial trajectories, operating margins, capital deployment strategies and risk exposures differ notably. Let’s examine which is the stronger buy right now.\nAfter a rough 2024, marked by high utilization at its Aetna insurance unit as well as reimbursement pressure, CVS Health has experienced a dramatic recovery so far in 2025. The stock has become the S&P 500’s top performer, with a year-to-date return of 56%, thereby outperforming all other index members by a significant margin. UnitedHealth, on the other hand, is at number 16 on the chart with a 16.5% gain. The stocks, however, outperformed the benchmark’s 8% dip during this period.\nImage Source: Zacks Investment Research\nAetna Margin Recovery and Cost Efficiencies in Focus: CVS Health is prioritizing margin recovery in its Aetna business, which posted 23% year-over-year revenue growth in the fourth quarter despite an adjusted operating loss. Favorable reserve developments and less severe-than-expected medical trends supported the performance. For 2025, CVS Health projects $132 billion in healthcare benefits revenues and at least $1.5 billion in adjusted operating income, with a 100-basis-point Medical Benefit Ratio improvement to 91.5%.\nWhile Medicare Advantage and individual exchange membership may decline, these are expected to be offset by growth in commercial self-insured plans and stronger plan design. The company is also executing a $2 billion multi-year cost efficiency initiative with 2025 savings expected to fully absorb rising variable expenses.\nStrong Cash Flow Generation and Shareholders’ Return: CVS Health’s 2024 operating cash flow of $9.1 billion exceeded expectations due to early cash receipts from the pharmacy segment. While 2025 guidance projects $6.5 billion in cash flow from operations, the two-year outlook of $15.6 billion in cumulative operating cash flows is a strong indicator of financial stability and flexibility. The company returned $3.3 billion in dividends in 2024 and expects to maintain dividend payments in 2025. It executed debt management strategies to moderately reduce leverage despite interest expense headwinds, with a long-term focus on regaining investment-grade targets.\nReimbursement Issues, Cyberattack Fail to Mar UNH's Momentum: In 2024, UnitedHealth faced substantial external pressure in the form of CMS Medicare rate cuts, Medicaid redeterminations and the Change Healthcare cyberattack. Despite these, the company deployed nearly $17 billion in growth capital to further strengthen its capabilities. It also returned over $16 billion to shareholders through dividends and share repurchases, highlighting the company's financial strength and disciplined capital allocation.\nFor 2025, UnitedHealth expects cash flow from operations to approach $33 billion, or 1.2x net income — a clear sign of robust underlying profitability.\nUNH's Shift Toward Value-Based Care with Optum: Optum Health’s revenues are set to grow from $105 billion in 2024 to $117 billion in 2025, with value-based care reaching 5.4 million patients, up 650,000 driven by services like in-home care. Optum Rx expects revenue growth with 98% retention and 750 new clients, expanding in specialty and infusion services while curbing drug costs.\nBullish Outlook for 2025 and Beyond: UnitedHealth cut its 2024 operating cost ratio by 150 basis points, aided by early AI-driven productivity gains. It is also moving to fully transparent pharmacy rebate models by 2028 to strengthen client trust. Despite a 150-basis-point medical care ratio (MCR) variance in 2024, UNH has proactively priced for 2025, targeting an 86.5% +/-50 bps MCR, supported by strong retention, growing Health Maintenance Organization (HMO) adoption and broader managed care offerings.\nThe Zacks Consensus Estimate for CVS’ 2025 earnings per share suggests an 8.7% improvement from 2024.\nImage Source: Zacks Investment Research\nThe Zacks Consensus Estimate for UNH’s 2025 EPS implies an improvement of 7.5% over the previous fiscal.\nImage Source: Zacks Investment Research\nCVS is trading at a forward 12-month price-to-earnings, which is a commonly used multiple for valuing healthcare stocks, of 11.25X, above its 5-year median of 9.25X and pretty close to the 5-year high of 13.33X. Meanwhile, UNH is presently trading at a forward 12-month price-to-earnings of 19.06X, which is below its 5-year median and high of 19.20X and 26.63X respectively.\nThis suggests that while UNH may appear slightly elevated relative to CVS, it remains attractively valued when compared with its own historical average.\nImage Source: Zacks Investment Research\nWhile both companies present compelling long-term value, UNH, a Zacks Rank #2 (Buy) stock, currently stands out with stronger margins, cash flow, and a below-average P/E despite growth across Optum. CVS Health, a Zacks Rank #3 (Hold) stock, meanwhile, is grappling with challenges like elevated medical costs and shifting payer dynamics in Medicare Advantage. The company recently established a \"baseline with upside potential\" strategy, signaling cautious optimism and operational discipline.\nYou can see the complete list of today’s Zacks Rank #1 (Strong Buy) stocks here.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nCVS Health Corporation (CVS) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nVerve Therapeutics stock rises on demonstrating superior LDL-C lowering ability in a phase Ib study of VERVE-102 in patients with HeFH and/or CAD.\nWe came across a bullish thesis on UnitedHealth Group Incorporated (UNH) on Substack by Oguz Erkan. In this article, we will summarize the bulls’ thesis on UNH. UnitedHealth Group Incorporated (UNH)’s share was trading at $587.06 as of April 14th. UNH’s trailing and forward P/E were 37.85 and 19.72 respectively according to Yahoo Finance. UnitedHealth Group stands […]\nWhile most \"Magnificent 7\" stocks have experienced significant declines amidst Wall Street's volatile start to 2025, Netflix stands out as a resilient performer ahead of its upcoming Q1 earnings report on Thursday, April 17th.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nThe 2025 Q1 earnings season picks up considerably this week, with large-cap companies Progressive and UnitedHealth helping to headline the reporting docket. What can investors expect?\nAmerican Financial stock gains from new business opportunities, increased exposures, a better renewal rate environment and effective capital deployment.\nVeeva Systems (VEEV) closed the most recent trading day at $222.72, moving -0.42% from the previous trading session.\nBioCardia aims to advance the study by enrolling 39 subjects across the US.\nWe recently published a list of 10 Best Pharma Stocks to Buy for Long Term Growth. In this article, we are going to take a look at where Eli Lilly and Company (NYSE:LLY) stands against other best pharma stocks to buy for long term growth. U.S. Pharma Turns to China for Drug Deals With big […]\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 12-00_UnitedHealth (UNH) Q1 Earnings Report Preview_ What To Look For",
    "date": "",
    "content": "Title: UnitedHealth (UNH) Q1 Earnings Report Preview_ What To Look For\nDate: 2025-04-16 12:00\nURL: https://finance.yahoo.com/news/unitedhealth-unh-q1-earnings-report-120059475.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nHealth insurance company UnitedHealth (NYSE:UNH) will be reporting earnings tomorrow before market hours. Here’s what investors should know.\nUnitedHealth missed analysts’ revenue expectations by 0.9% last quarter, reporting revenues of $100.8 billion, up 6.8% year on year. It was a mixed quarter for the company, with a narrow beat of analysts’ EPS estimates. It added 5,000 customers to reach a total of 53.73 million.\nIs UnitedHealth a buy or sell going into earnings? Read our full analysis here, it’s free.\nThis quarter, analysts are expecting UnitedHealth’s revenue to grow 11.7% year on year to $111.5 billion, improving from the 8.6% increase it recorded in the same quarter last year. Adjusted earnings are expected to come in at $7.29 per share.\nAnalysts covering the company have generally reconfirmed their estimates over the last 30 days, suggesting they anticipate the business to stay the course heading into earnings. UnitedHealth has missed Wall Street’s revenue estimates four times over the last two years.\nWith UnitedHealth being the first among its peers to report earnings this season, we don’t have anywhere else to look to get a hint at how this quarter will unravel for healthcare providers & services stocks. However, the segment has faced declining investor sentiment as UnitedHealth’s peer group is down 8.1% on average over the last month. UnitedHealth is up 16.1% during the same time and is heading into earnings with an average analyst price target of $637.72 (compared to the current share price of $583.59).\nWhen a company has more cash than it knows what to do with, buying back its own shares can make a lot of sense–as long as the price is right. Luckily, we’ve found one, a low-priced stock that is gushing free cash flow AND buying back shares. Click here to claim your Special Free Report on a fallen angel growth story that is already recovering from a setback.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where American Express (NYSE:AXP) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nWhile the market continues to digest tariff headlines and other economic developments, UnitedHealth, Newmont, and Sprouts Farmers Market have all been climbing higher.\nWe recently published a list of Jim Cramer is Bullish on These 10 Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host, Jim Cramer, shared his perspective on how investors might approach the stock […]\nUnitedHealth Group is set to benefit from the Trump administration’s Medicare reimbursement rate hike.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nHere are our top picks for the best online brokers for bonds.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 13-26_Jim Cramer_ UnitedHealth (UNH) Is an “Amazing Company” and a “Juggernaut Since Day One”",
    "date": "",
    "content": "Title: Jim Cramer_ UnitedHealth (UNH) Is an “Amazing Company” and a “Juggernaut Since Day One”\nDate: 2025-04-16 13:26\nURL: https://finance.yahoo.com/news/jim-cramer-unitedhealth-unh-amazing-132612066.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes.\nIn his latest appearance on CNBC’s Squawk on the Street, Jim Cramer reacted to the partial tariff exemptions announced by the White House, interpreting them not as a full retreat, but as a strategic pause designed to avoid punishing American companies. He suggested the administration was being careful not to hand over competitive advantages to Southeast Asian rivals, particularly Samsung:\n“So what I saw today, and not to be facetious, but what I see is people saying, you know what, we’ve seen the downside. Maybe we can test it again. But the president has, I don’t want to say blink, because that’s nonsense. What the president did was say, OK, look, we’re not going to continue to punish American companies and give the green light to Korea. I don’t know if you heard Lutnick’s words. He was very specific. Southeast Asia. That’s Samsung. They didn’t want to give the ball to Samsung.”\nREAD ALSO: Jim Cramer Hints at a Bigger Agenda Behind Tariffs and Breaks Down These 7 Stocks and Jim Cramer Reacts to the Surprise Market Surge and Highlights 8 Key Stocks.\nTurning to currency dynamics, Cramer pushed back on what he sees as misplaced panic over a weakening U.S. dollar. Instead, he argued that a softer dollar actually benefits American multinationals and gives long-needed relief to CFOs who’ve spent years blaming currency strength for lost market share:\n“Well, look, I’m not so certain I’m going to do a little contrary stuff on the dollar here. When we listen to conference calls, for the last four years, all we hear about is it would have been so much better if the dollar weren’t so strong. We keep losing share, the dollar’s too strong. Suddenly the dollar’s weaker, and now we start hearing all the downside, what, the bonds? I mean, I’m almost thinking that, I’m gonna put this out there, the people who are saying that it’s the end of the world, that the dollar is weaker, I think they have to go do some work boots on the ground. […] So suddenly the dollar’s weaker and we are petrified? These are people who have an agenda. And their agenda is to say, you know what matters more than anything else? Our hegemony from a strong dollar. And I don’t get it. If you’re in our business of picking stocks, you’re sick and tired of hearing CFOs say, we are done. We’ve got to stop this dollar rise.”\nCramer also gave his opinion about the rhetoric coming from Beijing, likening it to the Cold War-era paranoia of the 1960s and ’70s. He questioned whether a diplomatic breakthrough similar to Nixon’s historic visit to China is even possible under the current tone of U.S.-China relations:\n“But when I listen to the rhetoric from China, this is the 1968-72 rhetoric. It’s the kind of rhetoric that just says there’s never going to be a meeting. Is there a way to have a Nixon to China moment? Because as far as I’m concerned, this is just right now you’re on the verge of when I was a little boy and we kept thinking, when are they going to bomb us? I mean, that was the same rhetoric. When are they going to launch their nuclear weapons? I mean, that’s why we used to live in fear. That’s why we had cubbyholes. That’s why we used to put our heads in a cubbyhole, because the Chinese were going to bomb us if the Russians didn’t bomb us. This is the same sound.”\nTo make our list of the stocks that Jim Cramer talked about, we listed down the stocks he mentioned during CNBC’s Squawk on the Street aired on April 14th.\nFor these stocks, we also mentioned the number of hedge fund investors. Why are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA senior healthcare professional giving advice to a patient in a clinic.\nNumber of Hedge Fund holders: 150\nAhead of UnitedHealth Group Incorporated (NYSE:UNH)’s upcoming earnings release, Jim Cramer made an emphatic bullish prediction. He praised the company’s historical performance, consistency in exceeding expectations, and strategic consolidation efforts that strengthened its industry dominance. Here’s what he said:\n“Yeah, it’s a better than expected. It’s a much better than expected quarter, and I’m raising numbers. Well, that’s all they ever do. I’ve never seen them not. Maybe one quarter in the last 10 years. It’s an amazing company. I remember I was long it in 1989 and made my whole year. This thing was just a juggernaut from day one. Remember when they bought everybody too? Remember the consolidation? That was a really good thing for the industry. There’s an opportunity here.”\nOverall, UNH ranks 4th on our list of key stocks that Jim Cramer analyzes. While we acknowledge the potential of UNH as an investment, our conviction lies in the belief that some AI stocks hold greater promise for delivering higher returns and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than UNH but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where ServiceNow, Inc. (NYSE:NOW) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the Street, […]\nBrian Thompson’s murder has raised questions about the cost of U.S. healthcare, embroiling insurers, drugmakers and PBMs in a battle for the future of the industry.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where Costco (NASDAQ:COST) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing to […]\nShares of Novo Nordisk, Eli Lilly, Structure Therapeutics and Viking Therapeutics gain as PFE abandons development of its obesity candidate, danuglipron, due to safety issues.\nCVS Health and UnitedHealth are two of the top companies leading the S&P 500 chart YTD. But which is the better investment now? Let's take a closer look.\nWe recently published a list of Biotech Stocks Dominate Monday’s Top 10 Gainers. In this article, we are going to take a look at where Viking Therapeutics, Inc. (NASDAQ:VKTX) stands against other biotech stocks that dominate Monday’s top gainers. The stock market kicked off the shortened trading week on a positive note, with Wall Street’s major […]\nWe came across a bullish thesis on Boston Scientific Corporation (BSX) on Substack by Magnus Ofstad. In this article, we will summarize the bulls’ thesis on BSX. Boston Scientific Corporation (BSX)’s share was trading at $94.27 as of April 14th. BSX’s trailing and forward P/E were 75.42 and 33.11 respectively according to Yahoo Finance. Boston Scientific (BSX), […]\n(Bloomberg) -- Supply Lines is a daily newsletter that tracks global trade. Sign up here.Most Read from BloombergHow Did This Suburb Figure Out Mass Transit?The Secret Formula for Faster TrainsEven Oslo Has an Air Quality ProblemNYC Tourist Helicopter Crashes in Hudson River, Killing SixLisbon Mayor Wants Companies to Help Fix City’s Housing ShortagePresident Donald Trump’s administration pressed forward with plans to impose tariffs on semiconductor and pharmaceutical imports by initiating trade\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 15-00_3 Stocks Flashing Bullish Momentum",
    "date": "",
    "content": "Title: 3 Stocks Flashing Bullish Momentum\nDate: 2025-04-16 15:00\nURL: https://finance.yahoo.com/news/3-stocks-flashing-bullish-momentum-150000044.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nThough the market has seen sharp volatility over the past month, negativity hasn’t been entirely widespread, with shares of UnitedHealth UNH, Newmont NEM, and Sprouts Farmers Market SFM all seeing positive gains.\nImage Source: Zacks Investment Research\nBut what’s been driving the outperformance? Let’s take a closer look at each.\nColorado-based Newmont is one of the world's largest producers of gold, owning several active mines in Nevada, Peru, Australia, and Ghana. The surge in gold prices has been the driving factor behind the stock’s strong YTD performance, up nearly 50%.\nNotably, the average gold price per oz reached $2,643 throughout its latest period, melting higher from the $2,004 mark in the same period last year. Free cash flow of $1.6 billion throughout the period was the company’s highest read ever.\nBelow is a chart illustrating NEM’s free cash flow on a quarterly basis. The amplified cash-generating abilities are a huge positive, allowing the company to shell out dividend payments or pay down any debt.\nImage Source: Zacks Investment Research\nThe favorable gold environment has led analysts to up their EPS expectations across the board, with NEM now sporting a very bullish near-term outlook.\nImage Source: Zacks Investment Research\nUnitedHealth offers a full spectrum of health benefits, with its Optum segment using data and technology to improve care delivery and health outcomes. The stock is currently a Zacks Rank #2 (Buy), with its EPS outlook inching higher across nearly all timeframes over the past couple of months.\nImage Source: Zacks Investment Research\nIt’s critical to note that the company is scheduled to report quarterly results this week, with our current consensus expectations alluding to 5% YoY EPS growth on 11% higher sales. The company has been a stellar earnings performer overall, exceeding the Zacks Consensus EPS estimate in each of its last 20 quarterly releases.\nIts results are expected on Thursday, April 17th, before the market’s open. Investors should also note that the company is largely shielded from any tariff worries thanks to its domestic operations within the U.S.\nSFM shares have been strong thanks to robust quarterly results, with the company exceeding both consensus EPS and sales expectations in each of its last ten quarters. Up nearly 160% over the last year, the stock has crushed the S&P 500.\nContinued sales growth has pleased investors, with SFM reporting double-digit percentage YoY sales growth rates in each of its last three periods. Sales of $2.0 billion throughout its latest period grew an impressive 17% from the year-ago mark, reflective of a strong demand picture overall.\nBelow is a chart illustrating the company’s sales on a quarterly basis.\nImage Source: Zacks Investment Research\nThe stock also sports the highly-coveted Zacks Rank #1 (Strong Buy), with its EPS outlook shifting notably bullish across the board. The company’s next set of results come on April 30th.\nImage Source: Zacks Investment Research\nBottom Line\nWhile the market continues to digest tariff headlines and other economic developments, all three stocks above – UnitedHealth UNH, Newmont NEM, and Sprouts Farmers Market SFM – have all been climbing higher, with each also sporting bullish near-term EPS outlooks.\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\nNewmont Corporation (NEM) : Free Stock Analysis Report\nSprouts Farmers Market, Inc. (SFM) : Free Stock Analysis Report\nThis article originally published on Zacks Investment Research (zacks.com).\nZacks Investment Research\nNewmont (NEM) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations.\nUnitedHealth Group is set to benefit from the Trump administration’s Medicare reimbursement rate hike.\nWe recently published a list of the 11 Best Dividend Paying Stocks According to Hedge Funds. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other best dividend-paying stocks. Dividend-paying stocks have consistently attracted investor interest due to their long-term value. CNBC highlights this by examining […]\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nThe major U.S. equities indexes dropped at midday Wednesday, as semiconductor stocks tumbled amid worries about new chip export restrictions to China.\nBrian Thompson’s murder has raised questions about the cost of U.S. healthcare, embroiling insurers, drugmakers and PBMs in a battle for the future of the industry.\nCFG's first-quarter 2025 results benefit from a rise in fee income and a decline in expenses. Yet, a dip in NII acts as a spoilsport.\nCBOE has seen solid earnings estimate revision activity over the past month, and belongs to a strong industry as well.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 16-52_Jim Cramer_ UnitedHealth (UNH) “Defines What People Want” – Totally Domestic and in Demand",
    "date": "",
    "content": "Title: Jim Cramer_ UnitedHealth (UNH) “Defines What People Want” – Totally Domestic and in Demand\nDate: 2025-04-16 16:52\nURL: https://finance.yahoo.com/news/jim-cramer-unitedhealth-unh-defines-165227933.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nWe recently published a list of Jim Cramer is Bullish on These 10 Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other stocks that Jim Cramer discusses.\nOn Friday, Mad Money host, Jim Cramer, shared his perspective on how investors might approach the stock market given the current economic uncertainty.\n“You gotta make a list and decide what you can live with and what’s simply too dicey to buy. That my good friends, is how you have to think about stocks right now if you’re willing to be a slave to this crazy market in order to try to pocket what you can during this difficult period.”\nREAD ALSO: Jim Cramer’s Game Plan: 15 Stocks to Watch and Jim Cramer Discussed These 12 Stocks.\nCramer emphasized that before making any trading decision unless the plan is to hold it long-term and ride out near-term turbulence, investors should run what he described as a “gauntlet” of significant considerations. The first question he raised is whether the company in question does business in any foreign country. While it is common for investors to be cautious about China these days, Cramer pointed out that any nation could suddenly draw the ire of the U.S. president.\n“Now, it’s one thing to be worried about China, but it’s another to recognize that any country could at any time find itself on the president’s bad side. And once they get on his bad side, any American company doing real business there, finished.”\nCramer stressed the importance of avoiding companies that rely on international operations or resources. The second point on his checklist involved evaluating whether a company is cyclical, essentially, if it is vulnerable to swings in the broader economy. Highlighting the scale of the current trade friction, Cramer pointed out that the United States is effectively embargoing $439 billion worth of goods from China. He noted that it is likely to push inflation to levels not seen in a very long time. He added:\n“It’s hard to disagree with that assessment and I say that as someone who generally supports a trade crackdown on the Chinese government.”\nFor this article, we compiled a list of 10 stocks that were discussed by Jim Cramer during the episode of Mad Money aired on April 11. We listed the stocks in the order that Cramer mentioned them. We also provided hedge fund sentiment for each stock as of the fourth quarter of 2024, which was taken from Insider Monkey’s database of over 1,000 hedge funds.\nWhy are we interested in the stocks that hedge funds pile into? The reason is simple: our research has shown that we can outperform the market by imitating the top stock picks of the best hedge funds. Our quarterly newsletter’s strategy selects 14 small-cap and large-cap stocks every quarter and has returned 373.4% since May 2014, beating its benchmark by 218 percentage points (see more details here).\nA senior healthcare professional giving advice to a patient in a clinic.\nNumber of Hedge Fund Holders: 150\nDiscussing health insurers like UnitedHealth Group Incorporated (NYSE:UNH), Cramer said:\n“Then there are the health insurers, Humana, UnitedHealth, and Cigna. They are the ones I have my eyes on. They’re the easiest spot and we want them easy. I know the Charitable Trust should own one of these. I’m just debating which one.”\nUnitedHealth Group (NYSE:UNH) offers health benefit plans, care services, pharmacy support, and health management programs. It also provides software tools, consulting, and data solutions to organizations in the healthcare field. In the beginning of April, Cramer stated:\n“Right now, there’ll be a lot of fund managers who say, why do I need any of this? Just give me stocks that are American stocks that have nothing to do. And UnitedHealth, which sells at 19 times earnings, would probably sell at 25 times earnings in the near-term future, because UnitedHealth actually defines what I’m telling you people want. Up another 12 today. And that’s how money managers work. They’ll buy Umana, they’ll buy UNH, they’ll buy Cigna. […] You’re going to hear people come on, like on two-stock lunch or whatever, and they’re going to say, you know what? I like UnitedHealth and Humana here. Why? Well, they’re totally independent. Totally domestic.”\nOverall, UNH ranks 7th on our list of stocks that Jim Cramer discusses. While we acknowledge the potential of UNH as an investment, our conviction lies in the belief that AI stocks hold greater promise for delivering higher returns, and doing so within a shorter time frame. There is an AI stock that went up since the beginning of 2025, while popular AI stocks lost around 25%. If you are looking for an AI stock that is more promising than UNH but that trades at less than 5 times its earnings, check out our report about this cheapest AI stock.\nREAD NEXT: 20 Best AI Stocks To Buy Now and 30 Best Stocks to Buy Now According to Billionaires.\nDisclosure: None. This article is originally published at Insider Monkey.\nUnitedHealth Group is set to benefit from the Trump administration’s Medicare reimbursement rate hike.\nWe recently published a list of Jim Cramer’s Game Plan: 15 Stocks to Watch. In this article, we are going to take a look at where UnitedHealth Group (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host Jim Cramer outlined what investors should focus on in the week, especially pointing […]\nThis summer, UnitedHealth, Amedisys and antitrust regulators will have a magistrate judge’s help in hashing out a solution to the DOJ’s opposition to the merger.\nBrian Thompson’s murder has raised questions about the cost of U.S. healthcare, embroiling insurers, drugmakers and PBMs in a battle for the future of the industry.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nClark Howard, a prominent consumer finance expert, entrepreneur, author and radio host, challenges the conventional wisdom that striving for an 800 credit score (or higher) is a universally wise...\nFinancial advisors assist you in achieving your financial goals.\nIt can be a smart strategy, provided you understand what you’re risking.\nYou’ll need to do a bit of legwork to find a good fit, but it’s worth it to get one of these loans.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 19-58_UnitedHealth Group Earnings Are Coming. All Eyes Are on Its Insurance Division.",
    "date": "",
    "content": "Title: UnitedHealth Group Earnings Are Coming. All Eyes Are on Its Insurance Division.\nDate: 2025-04-16 19:58\nURL: https://finance.yahoo.com/m/0eaed994-633a-3a05-8169-9a79e0f7dd7f/unitedhealth-group-earnings.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nUnitedHealth Group is set to benefit from the Trump administration’s Medicare reimbursement rate hike.\nWhile the market continues to digest tariff headlines and other economic developments, UnitedHealth, Newmont, and Sprouts Farmers Market have all been climbing higher.\nScotiabank lowered the firm’s price target on Datadog (DDOG) to $125 from $155 and keeps an Outperform rating on the shares. The firm loves the company’s leadership in cloud-native monitoring, its end-to-end solution across the three pillars of observability, and the trend of market consolidation, the analyst tells investors. If macro headline risks stabilize, the firm believe the Datadog should be “one of the stocks to rush back into.” Published first on TheFly – the ultimate source for real-ti\nWe recently published a list of Jim Cramer is Bullish on These 10 Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other stocks that Jim Cramer discusses. On Friday, Mad Money host, Jim Cramer, shared his perspective on how investors might approach the stock […]\nWe came across a bullish thesis on UnitedHealth Group Incorporated (UNH) on Substack by Oguz Erkan. In this article, we will summarize the bulls’ thesis on UNH. UnitedHealth Group Incorporated (UNH)’s share was trading at $587.06 as of April 14th. UNH’s trailing and forward P/E were 37.85 and 19.72 respectively according to Yahoo Finance. UnitedHealth Group stands […]\nThe U.S.-China tech war just claimed another high-profile casualty.\nWith President Donald Trump announcing a wide set of tariffs, there could be increased costs for a range of companies.  Visa (NYSE: V) is a giant in the payments processing space, helping to ensure secure and convenient transactions between vendors and their customers.  The company boasts a solid track record of growing its revenue, net income, and free cash flow, as shown in the table below.\nBaby boomers in America are at or near retirement. So how much should the average middle-class boomer have in savings in order to comfortably weather their golden years? Trending Now: How Much Money...\nA net gain on a home sale of $680k potentially could lead to having to pay capital gains taxes. But in many cases, you won't have to pay taxes on the full amount of the gain. And you may be able to shield all of it. This is due to an exclusion that protects from […] The post I’m Selling My House and Netting $680k. Do I Have to Worry About Capital Gains Taxes? appeared first on SmartReads by SmartAsset.\nFinancial advisors assist you in achieving your financial goals.\nWhen investing in crypto, it helps to look at the top performers to get a sense of what’s going on in the market.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  },
  {
    "title": "2025-04-16 23-00_Netflix & UnitedHealth earnings, housing data_ What to Watch",
    "date": "",
    "content": "Title: Netflix & UnitedHealth earnings, housing data_ What to Watch\nDate: 2025-04-16 23:00\nURL: https://finance.yahoo.com/video/netflix-unitedhealth-earnings-housing-data-230000837.html?.tsrc=rss\nContent:\nOops, something went wrong\nTip: Try a valid symbol or a specific company name for relevant results\nOops, something went wrong\nAs tariffs rattle Big Tech, Wall Street is hoping Netflix will be a safe harbor. Here's what to expect from its earnings report.\nTrump's trade war is unlikely to bring tech manufacturing back to the US anytime soon. Here's why.\nDow slides 700 points, Nasdaq leads market rout as Powell warns of 'challenging' tariff impact\nThe Nasdaq was down over 4% as a tech-led sell-off intensified in late-afternoon trading\nThe major indexes sank to session lows as Fed Chair Powell warned of stagflationary impacts from President Trump's tariffs.\nPowell sees 'challenging scenario' for Fed if Trump tariffs stoke inflation and slow growth\nThe Nasdaq fell over 2%, leading the way down as Nvidia found itself caught in the crossfire of the US-China trade war.\nThe Treasury secretary told us he thinks America's biggest CEOs should stop worrying about the economy. Here's why.\nThe chipmaker's stock took a hit after it revealed the Trump administration's surprise new controls on exports to China.\nStocks resume slide as Nvidia weighs on tech\nRetail sales surged in March at the biggest rate in over two years, in what was the latest sign of the US economy's pre-tariff strength.\nWhy your water bill is an inflation problem that isn't budging\nStock market today: Dow, S&P 500, Nasdaq futures fall as Nvidia reveals costly limits on China exports\nThe Treasury secretary told Yahoo Finance that the next 90 days should provide 'substantial clarity' on tariffs\nTreasury Secretary Scott Bessent tells Yahoo Finance that the US has a 'big toolkit' to deal with bond market volatility\nStocks drift lower as tariff chaos pauses for a day\nThe chip giant committed to building AI infrastructure in the US, and Trump says he's going to help make it happen.\nThe fallout from Trump's tariff whiplash hasn't yet pushed investors to shy away from an old habit\nStocks edge higher after back-to-back rallies with Trump's latest tariff moves in focus\nBofA's Moynihan says 'we potentially face a changing economy' after highest-ever equities trading haul\nThe trade war uncovers new economies of scale\nTrump is wrecking his own economic agenda\nHigher clothing costs from tariffs are coming soon — but not immediately, experts say\nWhy Tesla, GM, and Rivian will be hurt most by China's critical minerals export ban\nTrump says he's 'looking at something' to help car companies with tariffs\nStocks rally for second straight day, while Apple jumps on tech tariff reprieve\nThe Nasdaq briefly turned red as stocks' relief rally failed to hold in early afternoon trading\nAmericans are braced for the biggest unemployment rate jump since the pandemic, a New York Fed survey found\nStocks surge as Apple leads way higher after tech's tariff reprieve\nTrump's temporary tech tariff respite adds to a growing sense that he has a willingness to listen and bend\nGoldman CEO Solomon warns of 'markedly different operating environment' as dealmaking slows\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nTrump has tariffs, taxes, and the debt ceiling on a collision course for this summer\nTrump denies that there was a tariff “exception” for certain electronics announced Friday. (Bloomberg)\nTax day 2025 is coming up. Here’s what to know to file by the deadline.\nCommentary: Put the P/E ratio in timeout for now\nMarket chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing\nApple was on brink of crisis before tariff concession from Trump (Bloomberg)\nCorporate earnings take center stage amid tariff turmoil: What to know this week\nThe best (and worst) time of year to buy a house\nThe Trump family is going all-in on crypto projects, from Bitcoin mining to stablecoins (Bloomberg)\nHow to invest in gold in 4 steps\nChanging jobs can disrupt saving for retirement. Here's how to stay on track.\nTrump exempts phones, computers, chips from ‘reciprocal’ tariffs (Bloomberg)\nMeet Walmart heir Steuart Walton, the most powerful board member you’ve never heard of\nThe tariff uncertainty isn't getting any better in markets: Chart of the Week\n'T-shirts could be the new eggs': Why Trump's chaotic tariff whipsaw is still a huge threat to inflation\nGold notches best week since 2020 amid 'shaken' investor confidence in US\nThe bond market just had one of its most volatile and unusual weeks in recent memory\nStocks capped a wild week with a surge higher, as the S&P 500 posted its biggest weekly gain since 2023\nUnlock stock picks and a broker-level newsfeed that powers Wall Street.\nKey earnings from Taiwan Semiconductor (TSM), UnitedHealth Group (UNH), American Express (AXP), and Netflix (NFLX) are set to be released Thursday, with Netflix no longer reporting its quarterly subscriber numbers.\nMarch housing data is also due, with economists forecasting declines in starts and permits. Meanwhile, markets are watching for more Federal Reserve commentary after Fed Chairman Jerome Powell’s remarks on Wednesday deepened a sell-off.\nTo watch more expert insights and analysis on the latest market action, check out more Market Domination Overtime here.\nTime now for to watch Thursday, April 17th, sponsored by Tasty trade, going to start off on the earnings front here. Some big names reporting tomorrow, including Taiwan Semiconductor, American Express, and Netflix. Now, Netflix announcing first quarter results. That's coming after the markets close. Remember, Netflix says it will no longer be disclosing its quarterly subscriber numbers starting this quarter, but analysts are still expecting that momentum to endure and drive revenue growth in Q1. Then moving over to housing, we're going to be getting some fresh housing data with housing starts and building permits in the morning. Economist expecting both starts and permits to decrease in March to 1.42 million and 1.45 million respectively, on a month-over-month basis. And taking a look at the Fed, got some more Fed commentary coming in tomorrow. That's going to be from Fed governor Michael Barr. It's coming after comments earlier today from Fed Chair Jerome Powell. Powell speaking today at the Economic Club of Chicago, and the markets experienced, you know, a sharp sell-off as a result. Powell saying that the effects of tariffs are moving the Fed away from its dual mandate goal of price stability and maximum employment.\nToday's Research Daily features new research reports on 16 major stocks, including Netflix, Inc. (NFLX), SAP SE (SAP) and Shell plc (SHEL), as well as two micro-cap stocks Preformed Line Products Company (PLPC) and ImmuCell Corporation (ICCC).\nMany growth-focused companies don't pay dividends at all, which is why the yield on the S&P 500 (SNPINDEX: ^GSPC) has fallen to just 1.4%.  Stocks with reliable dividends and high yields can be excellent ways to collect passive income no matter what the broader market is doing.  Here's why these three fool.com contributors think Chevron (NYSE: CVX), Brookfield Renewable Partners (NYSE: BEP) (NYSE: BEPC), and MSC Industrial Direct (NYSE: MSM) are three high-yield dividend stocks to buy now.\nNetflix is slated to report first-quarter results after markets close Thursday, and options markets suggest traders are expecting a stock price big move in the following days.\nWe recently published a list of Jim Cramer Sounds the Alarm on China Rhetoric and Dollar Panic Then Analyzes 11 Key Stocks. In this article, we are going to take a look at where UnitedHealth Group Incorporated (NYSE:UNH) stands against other key stocks that Jim Cramer analyzes. In his latest appearance on CNBC’s Squawk on the […]\nNetflix is set to report its fiscal first quarter earnings on Thursday after the market close. Here's what to know.\nJosé Muñoz, the CEO of Hyundai Motor Company, says he'll keep car prices steady until June 2 as customers try to get ahead of any tariffs and uncertainty. After that, they'll reevaluate. Muñoz&nbsp;says free trade is good for business and they're still investing in the US. He's on \"Bloomberg Open Interest.\"\nAround 69 million Americans will receive a Social Security check this year, and for many, these benefits are a lifeline.  Eighty-eight percent of current retirees say they depend on their monthly checks to some extent, according to a 2024 poll from Gallup, with 60% of that group saying Social Security is a \"major\" source of income.  The cost-of-living adjustment (COLA) is designed to help benefits maintain their buying power over time.\nWe recently published a list of 10 AI Stocks on the Move. In this article, we are going to take a look at where Intel Corporation (NASDAQ:INTC) stands against other AI stocks on the move. Market uncertainty aside, the AI race is tighter than ever. A report by Stanford University’s Institute for Human-Centered AI (HAI) […]\nWhat to expect from Netflix's first-quarter earnings and how will results impact Wall Street sentiment?\nChinese online marketplace Temu and fast-fashion retailer Shein, two of the biggest advertisers on U.S. social media, are sharply cutting their U.S. digital ad spending, industry data show, in a blow to tech companies such as Meta's Facebook and YouTube.  The online retailers, both of which ship low-priced China-made goods direct to U.S. shoppers, had been on an ad spree until recently, targeting younger, thriftier shoppers in digital media.  U.S. President Donald Trump's executive order earlier this month threatens this business.\nTip: Try a valid symbol or a specific company name for relevant results\nSign in to access your portfolio\n\n\n\nTry again."
  }
]